[
  {
    "course_code": "AFRC ST 201A",
    "units": 4,
    "title": "Africa and Disciplines",
    "description": "Seminar, four hours. Major intellectual trends and currents in development of African studies. Emphasis on appreciation of multidisciplinary background of African studies and relevant interpretive strategies. Central questions, critical issues, and current problems affecting Africa. Content varies each year. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/AFRCST201A"
  },
  {
    "course_code": "AFRC ST 201B",
    "units": 4,
    "title": "Africa and Professions",
    "description": "Seminar, three hours. Exploration of key contributions and debates of academic disciplines in African studies, with emphasis on professional dimension. Review of discipline’s literature, resources, career opportunities, and professionals themselves. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/AFRCST201B"
  },
  {
    "course_code": "AFRC ST 296",
    "units": 1,
    "title": "Africanist Working Group",
    "description": "Research group meeting, one hour per week per unit. Collaborative exploration and discussion of current research and literature on modern Africa. Specific projects determined by research being conducted by working group participants. Activities include designing and refining research proposals, gathering and analyzing data, and interpreting and reporting results, as well as presenting research to receive critical feedback from other class participants. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/AFRCST296"
  },
  {
    "course_code": "AFRC ST 596",
    "units": 2,
    "title": "Directed Individual Study or Research",
    "description": "Tutorial, to be arranged. Limited to graduate African studies students. May be repeated, but only 4 units may be applied toward minimum graduate course requirement. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/AFRCST596"
  },
  {
    "course_code": "AFRC ST 597",
    "units": 4,
    "title": "Preparation for MA Comprehensive Examination",
    "description": "Tutorial, to be arranged. Limited to graduate African studies students. Normally taken only during term in which student is being examined. May not be applied toward minimum graduate course requirement. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/AFRCST597"
  },
  {
    "course_code": "AFRC ST 598",
    "units": 4,
    "title": "Research for and Preparation of MA Thesis",
    "description": "Tutorial, to be arranged. Limited to graduate African studies students. Normally taken only during term in which student intends to complete MA thesis. May not be applied toward minimum graduate course requirement. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/AFRCST598"
  }
]