[
  {
    "course_code": "CLASSIC 10",
    "units": 5,
    "title": "Discovering Greeks",
    "description": "Lecture, three hours; discussion, one hour. Knowledge of Greek not required. Study of Greek life and culture from age of Homer to Roman conquest. Readings focus on selections from works of ancient authors in translation. Lectures illustrated with images of art, architecture, and material culture. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC10"
  },
  {
    "course_code": "CLASSIC 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC19"
  },
  {
    "course_code": "CLASSIC 20",
    "units": 5,
    "title": "Discovering Romans",
    "description": "Lecture, three hours; discussion, one hour. Knowledge of Latin not required. Study of Roman life and culture from time of city’s legendary foundations to end of classical antiquity. Readings focus on selections from works of ancient authors in translation. Lectures illustrated with images of art, architecture, and material culture. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC20"
  },
  {
    "course_code": "CLASSIC 30",
    "units": 5,
    "title": "Classical Mythology",
    "description": "Lecture, three hours; discussion, one hour. Introduction to myths and legends of ancient Greece and/or Rome, role of those stories in their societies, and modern approaches to studying them. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC30"
  },
  {
    "course_code": "CLASSIC 40W",
    "units": 5,
    "title": "Reading Greek Literature: Writing-Intensive",
    "description": "Lecture, two hours; discussion, two hours. Requisite: English Composition 3. Exploration in detail and from variety of critical perspectives of carefully selected literary texts characteristic of ancient Greece and significant in Western literary tradition. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC40W"
  },
  {
    "course_code": "CLASSIC 41W",
    "units": 5,
    "title": "Reading Roman Literature: Writing-Intensive",
    "description": "Lecture, two hours; discussion, two hours. Requisite: English Composition 3. Exploration in detail and from variety of critical perspectives of carefully selected set of literary texts characteristic of ancient Rome and significant in Western literary tradition. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC41W"
  },
  {
    "course_code": "CLASSIC 42",
    "units": 5,
    "title": "Cinema and Ancient World",
    "description": "Lecture/screenings, five hours; discussion, one hour. Use of popular culture and cinema to introduce students to ancient Greek and/or Roman culture; focus at discretion of instructor. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Visual & Performance Arts Analysis & Practice (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC42"
  },
  {
    "course_code": "CLASSIC 47",
    "units": 5,
    "title": "Medical Terminology: Origins, Nature, and Practice",
    "description": "Lecture, three hours. Introduction to specialized vocabulary of health sciences, which is rooted in Greek and Roman languages and in those two cultures from which much of history of modern medicine is derived. Students gain working knowledge of fundamental terminology used in medicine and health sciences as well as how this terminology has been composed. Development of ability to interpret and pronounce words. Students apply linguistic rules and how they operate in English and field-specific vocabulary to understand new terminology in various health science fields. Study of etymological origins of fundamental terminology as mnemonic aid for learning and recalling this terminology, and also to serve as mechanism for connecting health/medical professions to humanistic origins. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC47"
  },
  {
    "course_code": "CLASSIC 48",
    "units": 5,
    "title": "Ancient Greek and Roman Medicine",
    "description": "Lecture, three hours; discussion, one hour. Introduction to Greek and Roman medicine in its intellectual and cultural context. Examination of construction of concepts such as health, disease, physician, man, woman, cause, and difference. Readings from Greek literature and healing in cult of Asclepius. Readings of texts from Hippocratic collection, thought to be close to practice and theory of 5th-century BCE Greek physician, relating them to medical practice, competition for students and patients, intellectual display, developing scientific methods, ethnography, and Greek philosophy. Discussion of plagues as attempts to view such outbreaks as social phenomena. Examination of how Hippocratic understanding of how—or whether—we can know about what happens inside body was developed and challenged in 3rd-century BCE Alexandria. Study of Prince of Physicians, Galen, champion of Hippocratic medicine, influential into 18th century. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC48"
  },
  {
    "course_code": "CLASSIC 51A",
    "units": 5,
    "title": "Art and Archaeology of Ancient Greece",
    "description": "Lecture, three hours; discussion, one hour. Survey of major period, theme, or medium of Greek art and archaeology at discretion of instructor. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Visual & Performance Arts Analysis & Practice (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC51A"
  },
  {
    "course_code": "CLASSIC 51B",
    "units": 5,
    "title": "Art and Archaeology of Ancient Rome",
    "description": "Lecture, three hours; discussion, one hour. Survey of major period, theme, or medium of Roman art and archaeology at discretion of instructor. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Visual & Performance Arts Analysis & Practice (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC51B"
  },
  {
    "course_code": "CLASSIC 60",
    "units": 5,
    "title": "Fantastic Journey: Antiquity and Beyond",
    "description": "Lecture, two and one half hours; discussion, one hour. Investigation of phenomenon of fantastic or imaginary journey, from Homer’s Odyssey to Stanley Kubrick’s 2001: A Space Odyssey. Examination of ways in which travel to strange or new worlds is presented through number of texts (and occasionally films) across different cultures and periods, with focus primarily on antiquity but also looking at how important motifs from ancient Greek and Roman travel narratives have endured to present day. Issues include cultural relativism, what makes space either familiar or alien, rebuilding of home in fantastic territories, methods of travel (both fantastic and mundane), methods of measuring time and distance across space, modern classifications of fantasy and science fiction, and to what extent these terms are applicable to ancient world. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC60"
  },
  {
    "course_code": "CLASSIC 88GE",
    "units": 5,
    "title": "General Education Seminar Sequences",
    "description": "Seminar, three hours. Focused study of one aspect of ancient Greek or Roman culture or reception of classical tradition. Topics are interdisciplinary in nature (literature, arts, religion, politics, culture) and make connections between ancient and postclassical eras. Topics include rediscovery of Pompeii and Herculaneum; Roman religion and literature; pleasures of Greek or Roman body; and 18th-century British literature and reception of classics. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC88GE"
  },
  {
    "course_code": "CLASSIC 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC89"
  },
  {
    "course_code": "CLASSIC 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC89HC"
  },
  {
    "course_code": "CLASSIC 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC99"
  },
  {
    "course_code": "CLASSIC M114A",
    "units": 4,
    "title": "History of Ancient Mediterranean World",
    "description": "(Same as History M112C.) Lecture, five hours. Intensive on-site study of history and culture of ancient Rome from founding of city to conversion of Christianity. Part of UCLA Summer Travel Program. P/NP or letter grading.",
    "cross_listed": [
      "HIST M112C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM114A"
  },
  {
    "course_code": "CLASSIC M114B",
    "units": 4,
    "title": "History and Monuments of Rome: Field Studies",
    "description": "(Same as History M112E.) Fieldwork, five hours. Enforced corequisite: course M114A. Examination of history, art, and monuments of ancient Rome through daily lectures and field walks to museums and archaeological sites. Field trips outside Rome to Pompeii, Hadrian’s Villa, and ancient Ostia. Reception and ruins of Roman antiquity in medieval, Renaissance, and modern eras explored in their historical context. Part of UCLA Summer Travel Program. P/NP or letter grading.",
    "corequisites": [
      "CLASSIC M114A"
    ],
    "cross_listed": [
      "HIST M112E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM114B"
  },
  {
    "course_code": "CLASSIC M121",
    "units": 4,
    "title": "Ancient and Medieval Political Theory",
    "description": "(Same as Political Science M111A.) Lecture, three or four hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exposition and critical analysis of major thinkers such as Plato, Aristotle, Thucydides, St. Augustine, Aquinas, Machiavelli, and More and questions such as forms of government, citizenship, justice, happiness, rhetoric, religion, emotion. P/NP or letter grading.",
    "cross_listed": [
      "POL SCI M111A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM121"
  },
  {
    "course_code": "CLASSIC M124",
    "units": 4,
    "title": "Modern Receptions of Ancient Political Thought",
    "description": "(Same as Political Science M119A.) Lecture, three hours. Designed for juniors/seniors. Study of how Western culture has conceived and reinterpreted political thought of ancient Greeks and Romans. Topics include examination of influential case(s) of modern reception of classical antiquity. P/NP or letter grading.",
    "cross_listed": [
      "POL SCI M119A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM124"
  },
  {
    "course_code": "CLASSIC M125",
    "units": 5,
    "title": "Invention of Democracy",
    "description": "(Same as Political Science M112B.) Lecture, three or four hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Democracy was invented in ancient Greece as political form grounded on equality before law, citizenship, and freedom. It came into existence as struggle by demos, people, aware of its excellence and proud of its power, kratos. It became only regime capable of including all members of community while disregarding wealth, status, and diverging interests. Examination of history and theory of ancient democracy. P/NP or letter grading.",
    "cross_listed": [
      "POL SCI M112B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM125"
  },
  {
    "course_code": "CLASSIC 130",
    "units": 4,
    "title": "Race, Ethnicity, Identity in Greco-Roman World",
    "description": "Lecture, two and one half hours. Examination of construction of racial and ethnic identities in Greco-Roman world and ways that ancient texts and study of antiquity have influenced Western constructions of race. Case studies include both ethnographic constructions of other by dominant groups (e.g. invention of stereotypes like barbarian and noble savage) and experiences of members of marginalized groups within dominant cultures (e.g. Egyptian identity in Hellenistic Egypt, Greek, Syrian, and Jewish identity in Roman Empire). P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC130"
  },
  {
    "course_code": "CLASSIC M133",
    "units": 4,
    "title": "Ancient Historiography: Theory and Practice",
    "description": "(Same as History M113C.) Lecture, three hours. Study of theory, practice, and development of writing history in cultures of ancient Greece and Rome. Focus is literary, centered on questions of genre and rhetoric. Encourages appreciation for how ancient historiography relates to other ancient genres (epic, biography, oratory). Readings may draw widely from various authors, including Herodotus, Thucydides, Livy, Tacitus, and others. P/NP or letter grading.",
    "cross_listed": [
      "HIST M113C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM133"
  },
  {
    "course_code": "CLASSIC 137",
    "units": 4,
    "title": "Ancient Lives: Art of Biography",
    "description": "Lecture, three hours. Study of origins, development, and practice of writing lives (i.e., biography) represented in cultures of ancient Greece and Rome. Readings include examples from Greek and Roman lives of Plutarch and lives of Roman Emperors (Caesars) by Suetonius. Comparisons with modern biographical traditions in literature and film. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC137"
  },
  {
    "course_code": "CLASSIC 138",
    "units": 4,
    "title": "Ancient Letters",
    "description": "Lecture, three hours. Requisite: course 10 or 20. Study of practice of letter writing in ancient Greek and Roman worlds. Broad survey of letters as literary compositions and historical documents or more focused analysis of one particular period, author, or theme. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC138"
  },
  {
    "course_code": "CLASSIC 140",
    "units": 4,
    "title": "Topics in History of Greek Literature",
    "description": "Lecture, three hours. Requisite: course 10 or 40W. Investigation of specific issue in understanding of Greek literature, such as definition of one genre or evaluation of particular author. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 40W"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC140"
  },
  {
    "course_code": "CLASSIC 141",
    "units": 4,
    "title": "Topics in History of Latin Literature",
    "description": "Lecture, three hours. Requisite: course 20 or 41W. Investigation of specific issue in interpretation of Latin literature, such as definition of one genre or evaluation of particular author. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 20",
      "CLASSIC 41W"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC141"
  },
  {
    "course_code": "CLASSIC 142",
    "units": 4,
    "title": "Ancient Epic",
    "description": "Lecture, three hours. Requisite: one course from 10, 20, 30, 40W, or 41W. Homer’s Iliad and Odyssey, Vergil’s Aeneid, and Ovid’s Metamorphoses, studied in translation. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 20",
      "CLASSIC 30",
      "CLASSIC 40W",
      "CLASSIC 41W"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC142"
  },
  {
    "course_code": "CLASSIC 143A",
    "units": 4,
    "title": "Ancient Tragedy",
    "description": "Lecture, three hours. Requisite: course 10 or 40W. Survey of tragedy from 5th-century Athens through later antiquity. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 40W"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC143A"
  },
  {
    "course_code": "CLASSIC 143B",
    "units": 4,
    "title": "Ancient Comedy",
    "description": "Lecture, three hours. Requisite: course 10 or 20. Survey of comedy as it developed in Greek and Roman worlds. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC143B"
  },
  {
    "course_code": "CLASSIC 144",
    "units": 4,
    "title": "Topical Studies in Ancient Culture",
    "description": "Lecture, three hours. Investigation of one problem in ancient culture that involves discussion of both Greek and Roman material. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC144"
  },
  {
    "course_code": "CLASSIC M145A",
    "units": 4,
    "title": "Ancient Greek and Roman Philosophy",
    "description": "(Same as Philosophy M103A.) Lecture, three hours. Study of some major Greek and Roman philosophical texts, including those of pre-Socratics, Plato, Aristotle, and Hellenistic philosophers, with emphasis on historical and cultural setting of texts, their literary form, interrelations, and contribution to discussion of basic philosophical issues. P/NP or letter grading.",
    "cross_listed": [
      "PHILOS M103A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM145A"
  },
  {
    "course_code": "CLASSIC M145B",
    "units": 4,
    "title": "Later Ancient Greek Philosophy",
    "description": "(Same as Philosophy M103B). Lecture, three hours. Requisite: one course from M145A, Philosophy 1, 100A, M101B, or M102. Study of some major texts in Greek philosophy of Hellenistic and Roman periods. Readings vary and include works by Stoics, skeptics, philosophers of science, Neoplatonists, etc. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC M145A",
      "PHIL 1",
      "PHIL 100A",
      "PHIL M101B",
      "PHIL M102"
    ],
    "cross_listed": [
      "PHILOS M103B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM145B"
  },
  {
    "course_code": "CLASSIC M146A",
    "units": 4,
    "title": "Plato—Earlier Dialogues",
    "description": "(Same as Philosophy M101A.) Lecture, three hours; discussion, one hour. Preparation: one philosophy course. Study of selected topics in early and middle dialogues of Plato. P/NP or letter grading.",
    "cross_listed": [
      "PHILOS M101A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM146A"
  },
  {
    "course_code": "CLASSIC M146B",
    "units": 4,
    "title": "Plato—Later Dialogues",
    "description": "(Same as Philosophy M101B.) Lecture, three hours; discussion, one hour. Preparation: one philosophy course. Study of selected topics in middle and later dialogues of Plato. P/NP or letter grading.",
    "cross_listed": [
      "PHILOS M101B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM146B"
  },
  {
    "course_code": "CLASSIC M147",
    "units": 4,
    "title": "Aristotle",
    "description": "(Same as Philosophy M102.) Lecture, three hours; discussion, one hour. Preparation: one philosophy course. Study of selected works of Aristotle. P/NP or letter grading.",
    "cross_listed": [
      "PHILOS M102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM147"
  },
  {
    "course_code": "CLASSIC 148",
    "units": 5,
    "title": "Early Greek Medicine and Thought",
    "description": "Lecture, three hours; discussion, one hour. Versions of medical theory and practice in context of Greek intellectual and cultural developments. Readings from medical, philosophical, and historical texts. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Philosophical & Linguistic Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC148"
  },
  {
    "course_code": "CLASSIC M149",
    "units": 4,
    "title": "Bodies in Antiquity",
    "description": "(Same as Disability Studies M122.) Lecture, three hours. Investigation of individuals and groups that compose ancient Greek and Roman societies and relationship they have with larger social body, with particular focus on marginalized or minority groups such as women, noncitizens (resident aliens and provincials), slaves, children, elderly, and disabled. Examination of ways these groups contribute to or detract from our understanding of ancient society as whole. May be repeated for credit with topic change. P/NP or letter grading.",
    "cross_listed": [
      "DIS STD M122"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM149"
  },
  {
    "course_code": "CLASSIC 150A",
    "units": 4,
    "title": "Female in Greek Literature and Culture",
    "description": "Lecture, three hours. Requisite: course 10. Interdisciplinary study of concept of female in Greek literature and culture. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC150A"
  },
  {
    "course_code": "CLASSIC 150B",
    "units": 4,
    "title": "Female in Roman Literature and Culture",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 20. Interdisciplinary study of concept of female in Roman literature and culture. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "CLASSIC 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC150B"
  },
  {
    "course_code": "CLASSIC C151E",
    "units": 12,
    "title": "Archaeological Field Techniques",
    "description": "Off-campus field archaeology, 36 hours. Preparation: at least one classical archaeology course. Training in techniques of archaeological research in field, including topographic and area survey, mapping and recording artifacts, excavation and data analysis. Conducted in Mediterranean area. Concurrently scheduled with course C251E. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICC151E"
  },
  {
    "course_code": "CLASSIC 152A",
    "units": 4,
    "title": "Ancient City: Greek World",
    "description": "Lecture, three hours. Enforced requisite: course 10 or 51A or Art History 20 or History 1A. Range of interdisciplinary approaches to study of Athens and/or cities of Greek world, including Asia Minor, south Italy, and Sicily. Approaches, themes, and periods (both ancient city and receptions of city from classical antiquity to modern era) vary depending on individual instructor and topic. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 51A",
      "ART HIS 20",
      "HIST 1A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC152A"
  },
  {
    "course_code": "CLASSIC 152B",
    "units": 4,
    "title": "Ancient City: Roman World",
    "description": "Lecture, three hours. Enforced requisite: course 20 or 51B or Art History 20 or History 1A. Range of interdisciplinary approaches to study of Rome and/or cities of Italy and Roman Empire. Approaches, themes, and periods (both ancient city and receptions of city from classical antiquity to modern era) vary depending on individual instructor and topic. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 20",
      "CLASSIC 51B",
      "ART HIS 20",
      "HIST 1A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC152B"
  },
  {
    "course_code": "CLASSIC M153A",
    "units": 4,
    "title": "Minoan Art and Archaeology",
    "description": "(Same as Art History M111.) Lecture, three hours. Requisite: course 10 or 51A or Art History 20. Study of development of art and architecture in Minoan Crete from circa 3000 to 1000 BC. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 51A",
      "ART HIS 20"
    ],
    "cross_listed": [
      "ART HIS M111"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM153A"
  },
  {
    "course_code": "CLASSIC M153B",
    "units": 4,
    "title": "Mycenaean Art and Archaeology",
    "description": "(Same as Art History M112A.) Lecture, three hours. Requisite: course 10 or 51A or Art History 20. Study of development of art and architecture in Mycenaean Greece from circa 2000 to 1000 BC. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 51A",
      "ART HIS 20"
    ],
    "cross_listed": [
      "ART HIS M112A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM153B"
  },
  {
    "course_code": "CLASSIC M153C",
    "units": 4,
    "title": "Archaic Greek Art and Archaeology",
    "description": "(Same as Art History M112B.) Lecture, three hours. Requisite: course 10 or 51A or Art History 20. Study of development of art and architecture of Greek world from approximately 800 through 490 BC. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 51A",
      "ART HIS 20"
    ],
    "cross_listed": [
      "ART HIS M112B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM153C"
  },
  {
    "course_code": "CLASSIC M153D",
    "units": 4,
    "title": "Classical Greek Art and Archaeology",
    "description": "(Same as Art History M112C.) Lecture, three hours. Requisite: course 10 or 51A or Art History 20. Study of development of art and architecture of Greek world from approximately 490 through 350 BC. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 51A",
      "ART HIS 20"
    ],
    "cross_listed": [
      "ART HIS M112C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM153D"
  },
  {
    "course_code": "CLASSIC M153E",
    "units": 4,
    "title": "Hellenistic Greek Art and Archaeology",
    "description": "(Same as Art History M112D.) Lecture, three hours. Requisite: course 10 or 51A or Art History 20. Study of development of art and architecture of Greek world from middle of 4th century BC, including transmittal of Greek art forms to Romans. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 51A",
      "ART HIS 20"
    ],
    "cross_listed": [
      "ART HIS M112D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM153E"
  },
  {
    "course_code": "CLASSIC M153F",
    "units": 4,
    "title": "Etruscan Art and Archaeology",
    "description": "(Same as Art History M113A.) Lecture, three hours. Requisite: course 20 or 51B or Art History 20. Arts of Italic peninsula from circa 1000 BC to end of Roman Republic. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 20",
      "CLASSIC 51B",
      "ART HIS 20"
    ],
    "cross_listed": [
      "ART HIS M113A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM153F"
  },
  {
    "course_code": "CLASSIC M153G",
    "units": 4,
    "title": "Roman Art and Archaeology",
    "description": "(Same as Art History M113B.) Lecture, three hours. Requisite: course 20 or 51B or Art History 20. Art and architecture of Rome and its Empire from circa 300 BC to AD 300. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 20",
      "CLASSIC 51B",
      "ART HIS 20"
    ],
    "cross_listed": [
      "ART HIS M113B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM153G"
  },
  {
    "course_code": "CLASSIC M153H",
    "units": 4,
    "title": "Late Roman Art",
    "description": "(Same as Art History M113C.) Lecture, three hours. Requisite: course 20 or 51B or Art History 20. Art of Roman Empire from 2nd through 4th century (AD). P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 20",
      "CLASSIC 51B",
      "ART HIS 20"
    ],
    "cross_listed": [
      "ART HIS M113C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM153H"
  },
  {
    "course_code": "CLASSIC M153I",
    "units": 4,
    "title": "Classical Archaeology: Greco-Roman Architecture",
    "description": "(Same as Art History M114A.) Lecture, three hours. Requisite: one course from 10, 20, 51A, 51B, Art History 20, or History 1A. Knowledge of Greek and Latin not required. General introduction to study of Aegean, Greek, and Roman architecture, sculpture, and painting. May be repeated for credit with department consent. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 20",
      "CLASSIC 51A",
      "CLASSIC 51B",
      "ART HIS 20",
      "HIST 1A"
    ],
    "cross_listed": [
      "ART HIS M114A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM153I"
  },
  {
    "course_code": "CLASSIC M153J",
    "units": 4,
    "title": "Classical Archaeology: Greco-Roman Sculpture",
    "description": "(Same as Art History M114B.) Lecture, three hours. Requisite: one course from 10, 20, 51A, 51B, Art History 20, or History 1A. Knowledge of Greek and Latin not required. General introduction to study of Aegean, Greek, and Roman architecture, sculpture, and painting. May be repeated for credit with department consent. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 20",
      "CLASSIC 51A",
      "CLASSIC 51B",
      "ART HIS 20",
      "HIST 1A"
    ],
    "cross_listed": [
      "ART HIS M114B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM153J"
  },
  {
    "course_code": "CLASSIC M153K",
    "units": 4,
    "title": "Classical Archaeology: Greco-Roman Painting",
    "description": "(Same as Art History M114C.) Lecture, three hours. Requisite: one course from 10, 20, 51A, 51B, Art History 20, or History 1A. Knowledge of Greek and Latin not required. General introduction to study of Aegean, Greek, and Roman architecture, sculpture, and painting. May be repeated for credit with department consent. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 20",
      "CLASSIC 51A",
      "CLASSIC 51B",
      "ART HIS 20",
      "HIST 1A"
    ],
    "cross_listed": [
      "ART HIS M114C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM153K"
  },
  {
    "course_code": "CLASSIC M153L",
    "units": 4,
    "title": "Late Antique Art and Architecture",
    "description": "(Same as Art History CM115A.) Lecture, three hours. Art and architecture of late Roman Empire and early Christian world. P/NP or letter grading.",
    "cross_listed": [
      "ART HIS CM115A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM153L"
  },
  {
    "course_code": "CLASSIC 160",
    "units": 4,
    "title": "Legal Advocacy in Ancient World",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Requisite: course 10 or 20. Study of theory and practice of legal advocacy in classical Greece and Rome. May be repeated for credit. Letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC160"
  },
  {
    "course_code": "CLASSIC 161",
    "units": 4,
    "title": "Women's History in Ancient Mediterranean",
    "description": "Lecture, three hours. Overview of approaches to problem of writing women’s history in ancient Mediterranean world. Topics include law, medicine, work, religion (pagan, Christian, Jewish), and literature, with particular attention to themes of war, slavery, and sex trafficking. Exercises train students in critical use of primary documents and ancient sources, including inscriptions and other forms of material culture. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC161"
  },
  {
    "course_code": "CLASSIC 162",
    "units": 4,
    "title": "Reception of Ancient Myth",
    "description": "Lecture, three hours. Traces reading and re-use of myth from antiquity to present, including global receptions in areas such as literature, philosophy, art, film, and politics. May be repeated once for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC162"
  },
  {
    "course_code": "CLASSIC 163",
    "units": 4,
    "title": "Ovid and Consequences",
    "description": "Lecture, three hours. Study of Ovid’s Metamorphoses and persistence and extent of Roman poet’s influence on subsequent literature, art, and film. Close analysis of Ovid’s seminal text before turning to poem’s classical, medieval, Renaissance, and modern imitators, from Apuleius to Shakespeare to Picasso and beyond. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC163"
  },
  {
    "course_code": "CLASSIC 164",
    "units": 4,
    "title": "Spectacle Entertainments of Ancient Rome",
    "description": "Lecture, three hours. Requisite: course 20. Study of culture and politics of urban entertainment in ancient Rome, including gladiatorial competitions, chariot races, and theatrical productions. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC164"
  },
  {
    "course_code": "CLASSIC 165",
    "units": 4,
    "title": "Ancient Athletics",
    "description": "Lecture, three hours. Requisite: course 10 or History 1A. Study of ancient Greek and Roman athletics and their connections with religion, politics, literature, and art. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "HIST 1A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC165"
  },
  {
    "course_code": "CLASSIC 166A",
    "units": 4,
    "title": "Greek Religion",
    "description": "Lecture, three hours. Requisite: course 10 or 30. Study of religion of ancient Greeks. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 30"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC166A"
  },
  {
    "course_code": "CLASSIC 166B",
    "units": 4,
    "title": "Roman Religion",
    "description": "Lecture, three hours. Requisite: course 20. Study of religion of ancient Romans. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC166B"
  },
  {
    "course_code": "CLASSIC M167",
    "units": 4,
    "title": "Magic in Ancient World",
    "description": "(Same as Ancient Near East M167.) Lecture, three hours; discussion, one hour (when scheduled). Requisite: course 10 or 20. Exploration of art of influencing natural course of events by occult means as practiced in ancient world at large. Coverage of beliefs in supernatural forces, rites aimed at controlling these forces effectively, and character and social roles of ritual experts in various cultures of ancient world. Source material includes types of magical spells, literary texts about magic and magicians, and artifacts such as amulets and ritual implements. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 20"
    ],
    "cross_listed": [
      "AN N EA M167"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM167"
  },
  {
    "course_code": "CLASSIC 168",
    "units": 4,
    "title": "Comparative Mythology",
    "description": "Lecture, three hours. Requisites: course 30, or GE Clusters 30A, 30B, and 30CW. Religious, mythical, and/or historical traditions of Greece and Rome compared with each other and with other traditions worldwide. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 30",
      "CLUSTER 30A",
      "CLUSTER 30B",
      "CLUSTER 30CW"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC168"
  },
  {
    "course_code": "CLASSIC 169",
    "units": 4,
    "title": "Sex in Ancient World",
    "description": "Lecture, three hours. Requisite: course 10 or 20 or History 1A. Examination of sex and gender systems of Greek and Roman cultures in ancient Mediterranean world. What Greek and Roman sex/gender systems were, how they changed over time, and difference it makes. Readings include both modern theories about sex and history as foundation for course and broad range of ancient texts in translation. P/NP or letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 20",
      "HIST 1A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC169"
  },
  {
    "course_code": "CLASSIC M170C",
    "units": 4,
    "title": "Power and Imagination in Byzantium",
    "description": "(Same as History M116C.) Lecture, three hours; discussion, one hour (when scheduled). Requisites: History 116A, 116B. Designed for juniors/seniors. Study of relations of authority and intelligentsia in highly centralized Byzantine Empire. Topics include criticism of emperor, iconoclasm, intellectual freedom, attempts at reform. Letter grading.",
    "prerequisites": [
      "HIST 116A",
      "HIST 116B"
    ],
    "cross_listed": [
      "HIST M116C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM170C"
  },
  {
    "course_code": "CLASSIC 171",
    "units": 4,
    "title": "Black Classicism: African American Receptions of Classical Antiquity",
    "description": "Lecture, three hours. Study of reception of Greco-Roman antiquity, especially literature, by Black intellectuals, poets, novelists, and artists. Readings pair ancient texts with works by major African American writers (Dove, Ellison, Morrison) alongside scholarly discourse on Classica Africana. Also covers aspects of history of discipline of classics in U.S. with focus on Black experience. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC171"
  },
  {
    "course_code": "CLASSIC 175",
    "units": 4,
    "title": "Classics in Central and South America",
    "description": "Lecture, three hours. Introduction to topics in classical reception through investigation of influence of Greco-Roman poetry on poetry of Central and South America of colonial period and beyond. From Homer to Vergil, poets of classical antiquity established robust tradition of epic with well-established literary tropes and nationalistic aims, cultural voice contributing to development of unified sense of national identity. Classical definition of epic as genre and sense of epic as vehicle for affirming and questioning national identity persisted well beyond antiquity. Investigation of one such area by examining epic traditions of Central and South America, (mediated through European models that preceded and helped shape them) and their conscious engagement with classical tradition, through examples of both neo-Latin productions and vernacular poetry in Spanish and Portuguese. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC175"
  },
  {
    "course_code": "CLASSIC 180",
    "units": 4,
    "title": "Introduction to Classical Linguistics",
    "description": "Lecture, three hours. Requisite: Greek 3 or Latin 3. Linguistic approach to Greek and Latin, including Indo-European background, etymology, pronunciation, alphabets, sociolinguistics (dialects, bilingualism), and applications to classical literature. P/NP or letter grading.",
    "prerequisites": [
      "GREEK 3",
      "LATIN 3"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC180"
  },
  {
    "course_code": "CLASSIC 185",
    "units": 5,
    "title": "Origins and Nature of English Vocabulary",
    "description": "Lecture, three hours. Origins and nature of English vocabulary, from Proto-Indo-European prehistory to current slang. Topics include Greek and Latin component in English (including technical terminology), alphabet and English spelling, semantic change and word formation, vocabulary in literature and film. P/NP or letter grading.",
    "satisfies": [
      "General Education - Philosophical & Linguistic Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC185"
  },
  {
    "course_code": "CLASSIC 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC188SA"
  },
  {
    "course_code": "CLASSIC 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "CLASSIC 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC188SB"
  },
  {
    "course_code": "CLASSIC 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "CLASSIC 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC188SC"
  },
  {
    "course_code": "CLASSIC 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC189"
  },
  {
    "course_code": "CLASSIC 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC189HC"
  },
  {
    "course_code": "CLASSIC 190",
    "units": 1,
    "title": "Research Colloquia in Classics",
    "description": "Seminar, one hour. Limited to juniors/seniors. Designed to bring together students undertaking supervised tutorial research in seminar setting with one or more faculty members to discuss their own work or related work in discipline. Led by one supervising faculty member. May be repeated for credit. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC190"
  },
  {
    "course_code": "CLASSIC 191",
    "units": 5,
    "title": "Capstone Seminar: Classics",
    "description": "Seminar, three hours. Requisites: courses 10, 20, at least four upper-division major courses. Limited to declared junior/senior departmental majors; minors may be admitted with consent of instructor. Topical research seminar on important themes, periods, genres of ancient Greek and Roman world. Intended to provide students with opportunity for serious engagement with research in discipline under close faculty supervision. Readings, discussions, oral presentations, and final research paper or project. May be repeated for credit. Letter grading.",
    "prerequisites": [
      "CLASSIC 10",
      "CLASSIC 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC191"
  },
  {
    "course_code": "CLASSIC 193",
    "units": 1,
    "title": "Journal Club Seminars: Classics",
    "description": "Seminar, one hour. Limited to undergraduate students. Group discussion of readings and topics selected from current issues in classics and related disciplines. May be repeated for credit. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC193"
  },
  {
    "course_code": "CLASSIC 197",
    "units": 2,
    "title": "Individual Studies in Classics",
    "description": "Tutorial, two hours. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC197"
  },
  {
    "course_code": "CLASSIC 198A",
    "units": 2,
    "title": "Honors Research in Classics",
    "description": "Tutorial, six hours. Requisite: course 191. Limited to junior/senior departmental honors program students. Tutorial under direct supervision of faculty member. Research and development of thesis outline in preparation of paper to be completed in course 198B. May be repeated for credit. Individual contract required. In Progress grading (credit to be given only on completion of course 198B).",
    "prerequisites": [
      "CLASSIC 191"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC198A"
  },
  {
    "course_code": "CLASSIC 198B",
    "units": 5,
    "title": "Honors Research in Classics",
    "description": "Tutorial, 15 hours. Requisite: course 198A. Limited to junior/senior departmental honors program students. Completion of final research thesis under direct supervision of faculty member. May be repeated for credit. Individual contract required. Letter grading.",
    "prerequisites": [
      "CLASSIC 198A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC198B"
  },
  {
    "course_code": "CLASSIC 199",
    "units": 2,
    "title": "Directed Research in Classics",
    "description": "Tutorial, two hours. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC199"
  },
  {
    "course_code": "CLASSIC 200",
    "units": 4,
    "title": "History of Classical Scholarship",
    "description": "Lecture, four hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC200"
  },
  {
    "course_code": "CLASSIC 201B",
    "units": 2,
    "title": "Topics in Ancient History: Roman World",
    "description": "Seminar, three hours. Introduction to basic methods and approaches to study of Roman history by intensive examination of selected topics, including readings of ancient texts and modern scholarship. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC201B"
  },
  {
    "course_code": "CLASSIC M218",
    "units": 4,
    "title": "Paleography of Latin and Vernacular Manuscripts, 900 to 1500",
    "description": "(Same as English M215, French M210, and History M218.) Lecture, three hours; discussion, two hours. Introduction to history of Latin and vernacular manuscript book from 900 to 1500 to (1) train students to make informed judgments with regard to place and date of origin, (2) provide training in accurate reading and transcription of later medieval scripts, and (3) examine manuscript book as witness to changing society that produced it. Focus on relationship between Latin manuscripts and vernacular manuscripts with regard to their respective presentation of written texts. S/U or letter grading.",
    "cross_listed": [
      "HIST M218",
      "Paleography of Latin and Vernacular Manuscripts, 900",
      "Paleography of Latin and Vernacular Manuscripts, 1500",
      "ENGL M215",
      "Paleography of Latin and Vernacular Manuscripts, 900",
      "Paleography of Latin and Vernacular Manuscripts, 1500",
      "FRNCH M210",
      "Paleography of Latin and Vernacular Manuscripts, 900",
      "Paleography of Latin and Vernacular Manuscripts, 1500"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICM218"
  },
  {
    "course_code": "CLASSIC 220A",
    "units": 2,
    "title": "Interfaces: Transmission of Roman Literature",
    "description": "Seminar, three hours. Examination of transmission of Latin classical literature in late antiquity, Middle Ages, and Renaissance to understand processes by which Latin literature has been preserved. S/U (2-unit course) or letter (4-unit course) grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC220A"
  },
  {
    "course_code": "CLASSIC 244",
    "units": 2,
    "title": "Textual Criticism: Studies in Preparation of Critical Edition of Greek and/or Latin Texts",
    "description": "Seminar, three hours. Different steps required in preparation of critical edition of ancient text: localizing manuscripts; collation; establishing stemma; selecting right reading on basis of knowledge of context, of language of author, and of sources; emendations; formulation of apparatus criticus and apparatus fontium. S/U (2-unit course) or letter (4-unit course) grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC244"
  },
  {
    "course_code": "CLASSIC 245",
    "units": 2,
    "title": "Computing and Classics",
    "description": "Seminar, three hours. Introduction to processing and analysis of digitized texts of classical authors for purposes of literary history and criticism. S/U (2-unit course) or letter (4-unit course) grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC245"
  },
  {
    "course_code": "CLASSIC 246",
    "units": 2,
    "title": "Greek and Latin Meter",
    "description": "Seminar, three hours. Comprehensive study of meter as it functions in classical poetry. S/U (2-unit course) or letter (4-unit course) grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC246"
  },
  {
    "course_code": "CLASSIC 250",
    "units": 2,
    "title": "Topics in Greek and Roman Culture and Literature",
    "description": "Seminar, three hours. Interdisciplinary study on topics of ancient Greek and Roman culture and/or literature. May be repeated for credit with topic change. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC250"
  },
  {
    "course_code": "CLASSIC 251A",
    "units": 2,
    "title": "Seminar: Classical Archaeology—Aegean Bronze Age",
    "description": "Seminar, three hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC251A"
  },
  {
    "course_code": "CLASSIC 251B",
    "units": 2,
    "title": "Seminar: Classical Archaeology—Greco-Roman Architecture",
    "description": "Seminar, three hours. Studies in style and iconography of various periods of Aegean, Greek, and Roman architecture. S/U (2-unit course) or letter (4-unit course) grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC251B"
  },
  {
    "course_code": "CLASSIC 251C",
    "units": 2,
    "title": "Seminar: Classical Archaeology—Greco-Roman Sculpture",
    "description": "Seminar, three hours. Studies in style and iconography of various periods of Aegean, Greek, and Roman sculpture. S/U (2-unit course) or letter (4-unit course) grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC251C"
  },
  {
    "course_code": "CLASSIC 251D",
    "units": 2,
    "title": "Seminar: Classical Archeology—Greco-Roman Painting",
    "description": "Seminar, three hours. Studies in style and iconography of various periods of Aegean, Greek, and Roman painting. May be repeated for credit with consent of instructor. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC251D"
  },
  {
    "course_code": "CLASSIC C251E",
    "units": 12,
    "title": "Archaeological Field Techniques",
    "description": "Off-campus field archaeology, 36 hours. Preparation: at least one classical archaeology course. Training in techniques of archaeological research in field, including topographic and area survey, mapping and recording artifacts, excavation and data analysis. Conducted in Mediterranean area. Concurrently scheduled with course C151E. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSICC251E"
  },
  {
    "course_code": "CLASSIC 252",
    "units": 2,
    "title": "Topography and Monuments of Athens",
    "description": "Lecture, two or four hours. Detailed studies in topography and monuments of Athens, combining evidence of literature, inscriptions, and actual remains. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC252"
  },
  {
    "course_code": "CLASSIC 253",
    "units": 2,
    "title": "Topography and Monuments of Rome",
    "description": "Lecture, two or four hours. Detailed studies in topography and monuments of ancient Rome, combining evidence of literature, inscriptions, and actual remains. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC253"
  },
  {
    "course_code": "CLASSIC 260",
    "units": 2,
    "title": "Topics in Ancient Religion",
    "description": "Seminar, three hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC260"
  },
  {
    "course_code": "CLASSIC 287",
    "units": 2,
    "title": "Graduate Colloquium in Classical Literature",
    "description": "Seminar, three hours. Survey of basic methods of and approaches to classical scholarship, including textual criticism, literary interpretation and theory, hermeneutics, interdisciplinary studies, and computer applications to classics. Emphasis varies from year to year, depending on instructor(s). May be repeated for credit with topic change. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC287"
  },
  {
    "course_code": "CLASSIC 288",
    "units": 2,
    "title": "Literary Theory",
    "description": "Discussion, three hours. Designed for graduate students. Introduction to chief texts in literary theory and criticism for readers of classical literature, with application to classical texts. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC288"
  },
  {
    "course_code": "CLASSIC 495",
    "units": 2,
    "title": "Teaching Classics",
    "description": "Seminar, two hours. Normally to be taken by all graduate students in term before or during their first assignments as teaching assistants. Seminar/workshop in various pedagogical issues and strategies in preparation for teaching classical civilization, Greek, and/or Latin undergraduate courses. Readings and group discussions in topics related to teaching in field of classics. May not be applied toward MA or PhD course requirements. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC495"
  },
  {
    "course_code": "CLASSIC 501",
    "units": 2,
    "title": "Cooperative Program",
    "description": "Tutorial, to be arranged. Preparation: consent of UCLA adviser and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC501"
  },
  {
    "course_code": "CLASSIC 596",
    "units": 2,
    "title": "Directed Individual Study or Research",
    "description": "Tutorial, to be arranged. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC596"
  },
  {
    "course_code": "CLASSIC 597",
    "units": 2,
    "title": "Study for MA Comprehensive Examination or PhD Qualifying Examinations",
    "description": "Tutorial, to be arranged. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC597"
  },
  {
    "course_code": "CLASSIC 599",
    "units": 2,
    "title": "Research for PhD Dissertation",
    "description": "Tutorial, to be arranged. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CLASSIC599"
  }
]