[
  {
    "course_code": "EC ENGR 1",
    "units": 1,
    "title": "Undergraduate Seminar",
    "description": "Seminar, one hour; outside study, two hours. Introduction by faculty members and industry lecturers to electrical engineering disciplines through current and emerging applications of autonomous systems and vehicles, biomedical devices, aerospace electronic systems, consumer products, data science, and entertainment products (amusement rides, etc.), as well as energy generation, storage, and transmission. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR1"
  },
  {
    "course_code": "EC ENGR 2",
    "units": 4,
    "title": "Physics for Electrical Engineers",
    "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: Physics 1C. Introduction to concepts of modern physics necessary to understand solid-state devices, including elementary quantum theory, Fermi energies, and concepts of electrons in solids. Discussion of electrical properties of semiconductors leading to operation of junction devices. Letter grading.",
    "prerequisites": [
      "PHYSICS 1C"
    ],
    "equivalent_courses": [
      "EC ENGR 2H"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR2"
  },
  {
    "course_code": "EC ENGR 2H",
    "units": 4,
    "title": "Physics for Electrical Engineers (Honors)",
    "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisite: Physics 1C. Honors course parallel to course 2. Letter grading.",
    "prerequisites": [
      "PHYSICS 1C"
    ],
    "equivalent_courses": [
      "EC ENGR 2"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR2H"
  },
  {
    "course_code": "EC ENGR 3",
    "units": 4,
    "title": "Introduction to Electrical Engineering",
    "description": "Lecture, two hours; laboratory, two hours; outside study, eight hours. Introduction to field of electrical engineering. Basic circuits techniques with application to explanation of electrical engineering inventions such as telecommunications, electrical grid, automatic computing and control, and enabling device technology. Research frontiers of electrical engineering. Introduction to measurement and design of electrical circuits. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR3"
  },
  {
    "course_code": "EC ENGR 10",
    "units": 4,
    "title": "Circuit Theory I",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisites: course 3 (or Computer Science 1 or Materials Science 10), Mathematics 33A, Physics 1B. Corequisites: course 11L (enforced), Mathematics 33B. Introduction to linear circuit analysis. Resistive circuits, capacitors, inductors and ideal transformers, Kirchhoff laws, node and loop analysis, first-order circuits, second-order circuits, Thevenin and Norton theorem, sinusoidal steady state. Letter grading.",
    "prerequisites": [
      "EC ENGR 3",
      "COM SCI 1",
      "MAT SCI 10",
      "MATH 33A",
      "PHYSICS 1B"
    ],
    "corequisites": [
      "EC ENGR 11L",
      "MATH 33B"
    ],
    "equivalent_courses": [
      "EC ENGR 10H"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR10"
  },
  {
    "course_code": "EC ENGR 10H",
    "units": 4,
    "title": "Circuit Theory I (Honors)",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisites: course 3 (or Computer Science 1 or Materials Science 10), Mathematics 33A, Physics 1B. Corequisites: course 11L (enforced only for Computer Science and Engineering and Electrical Engineering majors), Mathematics 33B. Honors course parallel to course 10. Letter grading.",
    "prerequisites": [
      "EC ENGR 3",
      "COM SCI 1",
      "MAT SCI 10",
      "MATH 33A",
      "PHYSICS 1B"
    ],
    "corequisites": [
      "EC ENGR 11L",
      "MATH 33B"
    ],
    "equivalent_courses": [
      "EC ENGR 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR10H"
  },
  {
    "course_code": "EC ENGR 11L",
    "units": 1,
    "title": "Circuits Laboratory I",
    "description": "Lecture, one hour; laboratory, one hour; outside study, one hour. Enforced corequisite: course 10. Experiments with basic circuits containing resistors, capacitors, inductors, and transformers. Ohm’s law voltage and current division, Thevenin and Norton equivalent circuits, superposition, transient and steady state analysis. Letter grading.",
    "prerequisites": [
      "EC ENGR 10"
    ],
    "corequisites": [
      "EC ENGR 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR11L"
  },
  {
    "course_code": "EC ENGR M16",
    "units": 4,
    "title": "Logic Design of Digital Systems",
    "description": "(Same as Computer Science M51A.) Lecture, four hours; discussion, two hours; outside study, six hours. Introduction to digital systems. Specification and implementation of combinational and sequential systems. Standard logic modules and programmable logic arrays. Specification and implementation of algorithmic systems: data and control sections. Number systems and arithmetic algorithms. Error control codes for digital information. Letter grading.",
    "cross_listed": [
      "COM SCI M51A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM16"
  },
  {
    "course_code": "EC ENGR 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR19"
  },
  {
    "course_code": "EC ENGR 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR89"
  },
  {
    "course_code": "EC ENGR 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR99"
  },
  {
    "course_code": "EC ENGR 100",
    "units": 4,
    "title": "Electrical and Electronic Circuits",
    "description": "Lecture, three hours; discussion, one hour; outside study, eight hours. Requisites: Mathematics 33A, 33B or Mechanical and Aerospace Engineering 82, Physics 1C. Not open for credit to students with credit for course 110. Electrical quantities, linear circuit elements, circuit principles, signal waveforms, transient and steady state circuit behavior, semiconductor diodes and transistors, small signal models, and operational amplifiers. Letter grading.",
    "prerequisites": [
      "MATH 33A",
      "MATH 33B",
      "MECH&AE 82",
      "PHYSICS 1C"
    ],
    "credit_exclusions": [
      "EC ENGR 110"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR100"
  },
  {
    "course_code": "EC ENGR 101A",
    "units": 4,
    "title": "Engineering Electromagnetics",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisites: Mathematics 32A and 32B, or 33A and 33B, Physics 1C. Electromagnetic field concepts, waves and phasors, transmission lines and Smith chart, transient responses, vector analysis, introduction to Maxwell equations, static and quasi-static electric and magnetic fields. Letter grading.",
    "prerequisites": [
      "MATH 32A",
      "MATH 32B",
      "MATH 33A",
      "MATH 33B",
      "PHYSICS 1C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR101A"
  },
  {
    "course_code": "EC ENGR 101B",
    "units": 4,
    "title": "Electromagnetic Waves",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisite: course 101A. Time-varying fields and Maxwell equations, plane wave propagation and interaction with media, energy flow and Poynting vector, guided waves in waveguides, phase and group velocity, radiation and antennas. Letter grading.",
    "prerequisites": [
      "EC ENGR 101A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR101B"
  },
  {
    "course_code": "EC ENGR 102",
    "units": 4,
    "title": "Systems and Signals",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: Mathematics 33A. Corequisite: Mathematics 33B. Elements of differential equations, first- and second-order equations, variation of parameters method and method of undetermined coefficients, existence and uniqueness. Systems: input/output description, linearity, time-invariance, and causality. Impulse response functions, superposition and convolution integrals. Laplace transforms and system functions. Fourier series and transforms. Frequency responses, responses of systems to periodic signals. Sampling theorem. Letter grading.",
    "prerequisites": [
      "MATH 33A"
    ],
    "corequisites": [
      "MATH 33B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR102"
  },
  {
    "course_code": "EC ENGR 110",
    "units": 4,
    "title": "Circuit Theory II",
    "description": "Lecture, three hours; discussion, one hour; outside study, eight hours. Enforced requisites: courses 10, M16 (or Computer Science M51A), 102. Corequisite: course 111L (enforced only for Computer Science and Engineering and Electrical Engineering majors). Sinusoidal excitation and phasors, AC steady state analysis, AC steady state power, network functions, poles and zeros, frequency response, mutual inductance, ideal transformer, application of Laplace transforms to circuit analysis. Letter grading.",
    "prerequisites": [
      "EC ENGR 10",
      "EC ENGR M16",
      "COM SCI M51A",
      "COM SCI 102"
    ],
    "corequisites": [
      "EC ENGR 111L"
    ],
    "equivalent_courses": [
      "EC ENGR 110H"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR110"
  },
  {
    "course_code": "EC ENGR 110H",
    "units": 4,
    "title": "Circuit Theory II (Honors)",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisites: courses 10, M16 (or Computer Science M51A), 102. Corequisite: course 111L. Sinusoidal excitation and phasors, AC steady state analysis, AC steady state power, network functions, poles and zeros, frequency response, mutual inductance, ideal transformer, application of Laplace transforms to circuit analysis. Letter grading.",
    "prerequisites": [
      "EC ENGR 10",
      "EC ENGR M16",
      "COM SCI M51A",
      "COM SCI 102"
    ],
    "corequisites": [
      "EC ENGR 111L"
    ],
    "equivalent_courses": [
      "EC ENGR 110"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR110H"
  },
  {
    "course_code": "EC ENGR 110L",
    "units": 2,
    "title": "Circuit Measurements Laboratory",
    "description": "Laboratory, four hours; outside study, two hours. Requisite: course 100 or 110. Experiments with basic circuits containing resistors, capacitors, inductors, and op-amps. Ohm’s law voltage and current division, Thevenin and Norton equivalent circuits, superposition, transient and steady state analysis, and frequency response principles. Letter grading.",
    "prerequisites": [
      "EC ENGR 100",
      "EC ENGR 110"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR110L"
  },
  {
    "course_code": "EC ENGR 111L",
    "units": 1,
    "title": "Circuits Laboratory II",
    "description": "Lecture, one hour; laboratory, one hour; outside study, one hour. Enforced requisites: courses 10, 11L. Enforced corequisite: course 110. Experiments with electrical circuits containing resistors, capacitors, inductors, transformers, and op-amps. Steady state power analysis, frequency response principles, op-amp-based circuit synthesis, and two-port network principles. Letter grading.",
    "prerequisites": [
      "EC ENGR 10",
      "EC ENGR 11L"
    ],
    "corequisites": [
      "EC ENGR 110"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR111L"
  },
  {
    "course_code": "EC ENGR 112",
    "units": 4,
    "title": "Introduction to Power Systems",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisite: course 110. Complete overview of organization and operation of interconnected power systems. Development of appropriate models for interconnected power systems and learning how to perform power flow, economic dispatch, and short circuit analysis. Introduction to power system transient dynamics. Letter grading.",
    "prerequisites": [
      "EC ENGR 110"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR112"
  },
  {
    "course_code": "EC ENGR 113",
    "units": 4,
    "title": "Digital Signal Processing",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisite: course 102. Relationship between continuous-time and discrete-time signals. Z-transform. Discrete Fourier transform. Fast Fourier transform. Structures for digital filtering. Introduction to digital filter design techniques. Letter grading.",
    "prerequisites": [
      "EC ENGR 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR113"
  },
  {
    "course_code": "EC ENGR 113DA",
    "units": 4,
    "title": "Digital Signal Processing Design",
    "description": "Lecture, two hours; laboratory, four hours; outside study, six hours. Enforced requisite: course 113. Real-time implementation of digital signal processing algorithms on digital processor chips. Experiments involving A/D and D/A conversion, aliasing, digital filtering, sinusoidal oscillators, Fourier transforms, and finite wordlength effects. Course project involving original design and implementation of machine learning and signal processing systems for communications, radar, medical and other imaging, speech, music, or video using DSP hardware. Lectures include ethical concerns and societal implications of DSP-related technologies, and bi-weekly Writing II discussions. In progress grading (credit to be given only on completion of course 113DW).",
    "prerequisites": [
      "EC ENGR 113"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR113DA"
  },
  {
    "course_code": "EC ENGR 113DW",
    "units": 4,
    "title": "Digital Signal Processing Design",
    "description": "(Formerly numbered 113DB.) Laboratory, four hours; outside study, eight hours. Enforced requisites: courses 113, 113DA. Real-time implementation of digital signal processing algorithms on digital processor chips. Experiments involving A/D and D/A conversion, aliasing, digital filtering, sinusoidal oscillators, Fourier transforms, and finite wordlength effects. Course project involving original design and implementation of signal processing systems for communications, speech, audio, or video using DSP chip. Completion of projects begun in course 113DA. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Writing II"
    ],
    "prerequisites": [
      "EC ENGR 113",
      "EC ENGR 113DA"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR113DW"
  },
  {
    "course_code": "EC ENGR 114",
    "units": 4,
    "title": "Speech and Image Processing Systems Design",
    "description": "Lecture, three hours; discussion, one hour; laboratory, two hours; outside study, six hours. Enforced requisite: course 113. Design principles of speech and image processing systems. Speech production, analysis, and modeling in first half of course; design techniques for image enhancement, filtering, and transformation in second half. Lectures supplemented by laboratory implementation of speech and image processing tasks. Letter grading.",
    "prerequisites": [
      "EC ENGR 113"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR114"
  },
  {
    "course_code": "EC ENGR 115A",
    "units": 4,
    "title": "Analog Electronic Circuits I",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisite: course 110. Review of physics and operation of diodes and bipolar and MOS transistors. Equivalent circuits and models of semiconductor devices. Analysis and design of single-stage amplifiers. DC biasing circuits. Small-signal analysis. Operational amplifier systems. Letter grading.",
    "prerequisites": [
      "EC ENGR 110"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR115A"
  },
  {
    "course_code": "EC ENGR 115AL",
    "units": 2,
    "title": "Analog Electronics Laboratory I",
    "description": "Laboratory, four hours; outside study, two hours. Enforced requisites: courses 110L or 111L, 115A. Experimental determination of device characteristics, resistive diode circuits, single-stage amplifiers, compound transistor stages, effect of feedback on single-stage amplifiers, operational amplifiers, and operational amplifier circuits. Introduction to hands-on design experience based on individual student hardware design and implementation platforms. Letter grading.",
    "prerequisites": [
      "EC ENGR 110L",
      "EC ENGR 111L",
      "EC ENGR 115A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR115AL"
  },
  {
    "course_code": "EC ENGR 115B",
    "units": 4,
    "title": "Analog Electronic Circuits II",
    "description": "Lecture, four hours; discussion, one hour; outside study, eight hours. Enforced requisite: course 115A. Analysis and design of differential amplifiers in bipolar and CMOS technologies. Current mirrors and active loads. Frequency response of amplifiers. Feedback and its properties. Stability issues and frequency compensation. Letter grading.",
    "prerequisites": [
      "EC ENGR 115A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR115B"
  },
  {
    "course_code": "EC ENGR 115C",
    "units": 4,
    "title": "Digital Electronic Circuits",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisites: course 100 or 115A, and Computer Science M51A. Transistor-level digital circuit analysis and design. Modern logic families (static CMOS, pass-transistor, dynamic logic), integrated circuit (IC) layout, digital circuits (logic gates, flipflops/latches, counters, etc.), computer-aided simulation of digital circuits. Letter grading.",
    "prerequisites": [
      "EC ENGR 100",
      "EC ENGR 115A",
      "COM SCI M51A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR115C"
  },
  {
    "course_code": "EC ENGR 115DA",
    "units": 4,
    "title": "Electronic Circuits and Systems Design",
    "description": "(Formerly numbered 164DA.) Lecture, two hours; laboratory, two hours; outside study, eight hours. Recommended corequisite: course 115B or consent of instructor. Design of analog circuits, components and systems, emphasizing theoretical foundations and hands-on experience. Design of key analog and digital building blocks according to given specifications or in the form of open-ended problems. Introduction to advanced topics related to projects through lectures and laboratories. Creation by students of end-to-end systems in application context, managing trade-offs across subsystems while meeting constraints and optimizing metrics related to cost, performance, ease of use, manufacturability, testing, and other real-world issues. Oral and written presentations of project results are required. In Progress grading (credit to be given only on completion of course 115DW).",
    "prerequisites": [
      "EC ENGR 115B"
    ],
    "corequisites": [
      "EC ENGR 115B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR115DA"
  },
  {
    "course_code": "EC ENGR 115DW",
    "units": 4,
    "title": "Electronic Circuits and Systems Design",
    "description": "(Formerly numbered 115DB.) Lecture, one hour; laboratory, three hours; outside study, eight hours. Enforced requisite: course 115DA. Limited to senior Electrical Engineering majors. Design of analog circuits, components and systems, emphasizing theoretical foundations and hands-on experience. Design of key analog and digital building blocks according to given specifications or in the form of open-ended problems. Introduction to advanced topics related to projects through lectures and laboratories. Creation by students of end-to-end systems in application context, managing trade-offs across subsystems while meeting constraints and optimizing metrics related to cost, performance, ease of use, manufacturability, testing, and other real-world issues. Professional technical writing instruction and assignments. Professional technical writing instruction on assignments. Oral and written presentations of project results are required. Completion of projects begun in course 115DA. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Writing II"
    ],
    "prerequisites": [
      "EC ENGR 115DA"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR115DW"
  },
  {
    "course_code": "EC ENGR 115E",
    "units": 4,
    "title": "Design Studies in Electronic Circuits",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisite: course 115B. Description of process of circuit design through lectures to complement other laboratory-based design courses. Topics vary by instructor and include communication circuits, power electronics, and instrumentation and measurement and may entail simulation-based design projects. Emphasis throughout on design-oriented analysis and rigorous approach to practical circuit design. Letter grading.",
    "prerequisites": [
      "EC ENGR 115B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR115E"
  },
  {
    "course_code": "EC ENGR M116C",
    "units": 4,
    "title": "Computer Systems Architecture",
    "description": "(Same as Computer Science M151B.) Lecture, four hours; discussion, two hours; outside study, six hours. Enforced requisites: course M16 or Computer Science M51A, Computer Science 33. Recommended: course M116L or Computer Science M152A, Computer Science 111. Computer system organization and design, implementation of CPU datapath and control, instruction set design, memory hierarchy (caches, main memory, virtual memory) organization and management, input/output subsystems (bus structures, interrupts, DMA), performance evaluation, pipelined processors. Letter grading.",
    "prerequisites": [
      "EC ENGR M16",
      "COM SCI M51A",
      "COM SCI 33"
    ],
    "cross_listed": [
      "COM SCI M151B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM116C"
  },
  {
    "course_code": "EC ENGR M116L",
    "units": 2,
    "title": "Introductory Digital Design Laboratory",
    "description": "(Same as Computer Science M152A.) Laboratory, four hours; outside study, two hours. Enforced requisite: course M16 or Computer Science M51A. Hands-on design, implementation, and debugging of digital logic circuits, use of computer-aided design tools for schematic capture and simulation, implementation of complex circuits using programmed array logic, design projects. Letter grading.",
    "prerequisites": [
      "EC ENGR M16",
      "COM SCI M51A"
    ],
    "cross_listed": [
      "COM SCI M152A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM116L"
  },
  {
    "course_code": "EC ENGR M117",
    "units": 4,
    "title": "Computer System Security",
    "description": "(Formerly numbered 117.) (Same as Computer Science M138.) Lecture, four hours; laboratory, one hour; outside study, seven hours. Requisite: Computer Science 33. Recommended requisite: Computer Science 111. Introduction to fundamental knowledge of computer system security. Students gain understanding of exploit techniques; learn to use the security tools; learn to design and implement secure systems; and learn concepts of computer security including software vulnerability analysis and defense, web security, mobile security, and network security. Covers the latest security topics in practice (e.g., cryptocurrency), and in research (e.g., state-of-the-art fuzzing techniques and machine-learning-based security analysis). Students get hands-on experience in analyzing and designing secure systems. Includes course project for cutting-edge security research. Letter grading.",
    "prerequisites": [
      "COM SCI 33"
    ],
    "cross_listed": [
      "COM SCI M138"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM117"
  },
  {
    "course_code": "EC ENGR M119",
    "units": 4,
    "title": "Fundamentals of Embedded Networked Systems",
    "description": "(Same as Computer Science M119.) Lecture, four hours; discussion, one hour; outside study, seven hours. Requisites: course 132B or Computer Science 118; one course from course 131A, Civil and Environmental Engineering 110, Mathematics 170A, 170E, Statistics 100A; Computer Science 33. Design trade-offs and principles of operation of cyber physical systems such as devices and systems constituting Internet of Things. Topics include signal propagation and modeling, sensing, node architecture and operation, and applications. Letter grading.",
    "prerequisites": [
      "EC ENGR 132B",
      "COM SCI 118"
    ],
    "cross_listed": [
      "COM SCI M119"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM119"
  },
  {
    "course_code": "EC ENGR 121B",
    "units": 4,
    "title": "Principles of Semiconductor Device Design",
    "description": "Lecture, three hours; discussion, one hour; outside study, eight hours. Enforced requisite: course 2. Introduction to principles of operation of bipolar and MOS transistors, equivalent circuits, high-frequency behavior, voltage limitations. Letter grading.",
    "prerequisites": [
      "EC ENGR 2"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR121B"
  },
  {
    "course_code": "EC ENGR 121DA",
    "units": 4,
    "title": "Semiconductor Processing and Device Design",
    "description": "Lecture, four hours; laboratory, four hours; outside study, four hours. Enforced requisite or corequisite: course 121B. Design fabrication and characterization of p-n junction and transistors. Students perform various processing tasks such as wafer preparation, oxidation, diffusion, metallization, and photolithography. Introduction to CAD tools used in integrated circuit processing and device design. Device structure optimization tool based on MEDICI; process integration tool based on SUPREM. Course familiarizes students with those tools. Using CAD tools, CMOS process integration to be designed. In progress grading (credit to be given only on completion of course 121DB).",
    "prerequisites": [
      "EC ENGR 121B"
    ],
    "corequisites": [
      "EC ENGR 121B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR121DA"
  },
  {
    "course_code": "EC ENGR 121DB",
    "units": 4,
    "title": "Semiconductor Processing and Device Design",
    "description": "Lecture, two hours; laboratory, four hours; outside study, six hours. Enforced requisites: courses 121B, 121DA. Design fabrication and characterization of p-n junction and transistors. Students perform various processing tasks such as wafer preparation, oxidation, diffusion, metallization, and photolithography. Introduction to CAD tools used in integrated circuit processing and device design. Device structure optimization tool based on MEDICI; process integration tool based on SUPREM. Course familiarizes students with those tools. Using CAD tools, CMOS process integration to be designed. Letter grading.",
    "prerequisites": [
      "EC ENGR 121B",
      "EC ENGR 121DA"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR121DB"
  },
  {
    "course_code": "EC ENGR 123A",
    "units": 4,
    "title": "Fundamentals of Solid-State I",
    "description": "Lecture, three hours; discussion, one hour; outside study, eight hours. Requisite: course 2 or Physics 1C. Limited to junior/senior engineering majors. Fundamentals of solid-state, introduction to quantum mechanics and quantum statistics applied to solid-state. Crystal structure, energy levels in solids, and band theory and semiconductor properties. Letter grading.",
    "prerequisites": [
      "EC ENGR 2",
      "PHYSICS 1C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR123A"
  },
  {
    "course_code": "EC ENGR 123B",
    "units": 4,
    "title": "Fundamentals of Solid-State II",
    "description": "Lecture, four hours; outside study, eight hours. Enforced requisite: course 123A. Discussion of solid-state properties, lattice vibrations, thermal properties, dielectric, magnetic, and superconducting properties. Letter grading.",
    "prerequisites": [
      "EC ENGR 123A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR123B"
  },
  {
    "course_code": "EC ENGR 128",
    "units": 4,
    "title": "Principles of Nanoelectronics",
    "description": "Lecture, four hours; discussion, four hours; outside study, four hours. Requisite: Physics 1C. Introduction to fundamentals of nanoscience for electronics nanosystems. Principles of fundamental quantities: electron charge, effective mass, Bohr magneton, and spin, as well as theoretical approaches. From these nanoscale components, discussion of basic behaviors of nanosystems such as analysis of dynamics, variability, and noise, contrasted with those of scaled CMOS. Incorporation of design project in which students are challenged to design electronics nanosystems. Letter grading.",
    "prerequisites": [
      "PHYSICS 1C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR128"
  },
  {
    "course_code": "EC ENGR 131A",
    "units": 4,
    "title": "Probability and Statistics",
    "description": "Lecture, four hours; discussion, one hour; outside study, 10 hours. Requisites: Mathematics 32B, 33B. Introduction to basic concepts of probability, including random variables and vectors, distributions and densities, moments, characteristic functions, and limit theorems. Applications to communication, control, and signal processing. Introduction to computer simulation and generation of random events. Letter grading.",
    "prerequisites": [
      "MATH 32B",
      "MATH 33B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR131A"
  },
  {
    "course_code": "EC ENGR 132A",
    "units": 4,
    "title": "Introduction to Communication Systems",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisites: courses 102, 113, 131A. Review of basic probability, basics of hypothesis testing, sufficient statistics and waveform communication, signal-design tradeoffs for digital communications, basics of error control coding, intersymbol interference channels and orthogonal frequency division multiplexing (OFDM), basics of wireless communications. Letter grading.",
    "prerequisites": [
      "EC ENGR 102",
      "EC ENGR 113",
      "EC ENGR 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR132A"
  },
  {
    "course_code": "EC ENGR 132B",
    "units": 4,
    "title": "Data Communications and Telecommunication Networks",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisite: course 131A. Layered communications architectures. Queueing system modeling and analysis. Error control, flow and congestion control. Packet switching, circuit switching, and routing. Network performance analysis and design. Multiple-access communications: TDMA, FDMA, polling, random access. Local, metropolitan, wide area, integrated services networks. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR132B"
  },
  {
    "course_code": "EC ENGR 133A",
    "units": 4,
    "title": "Applied Numerical Computing",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisites: course 131A, and Civil Engineering M20 or Computer Science 31 or Mechanical and Aerospace Engineering M20. Introduction to numerical computing/analysis; analytic formulations versus numerical solutions; floating-point representations and rounding errors. Review of MATLAB; mathematical software. Linear equations; LU factorization; bounds on error; iterative methods for solving linear equations; conditioning and stability; complexity. Interpolation and approximation; splines. Zeros and roots of nonlinear equations. Linear least squares and orthogonal (QR) factorization; statistical interpretation. Numerical optimization; Newton method; nonlinear least squares. Numerical quadrature. Solving ordinary differential equations. Eigenvalues and singular values; QR algorithm; statistical applications. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A",
      "C&EE M20",
      "COM SCI 31",
      "MECH&AE M20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR133A"
  },
  {
    "course_code": "EC ENGR 133B",
    "units": 4,
    "title": "Simulation, Optimization, and Data Analysis",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisite: course 133A. Simulation of dynamical systems. Algorithms for ordinary differential and difference equations. Fourier analysis; fast Fourier transforms. Random number generators. Simulation of stochastic systems, Monte Carlo methods. Constrained optimization; applications of optimization to engineering design, modeling, and data analysis. Introduction to data mining and machine learning. Algorithms and complexity. Integration of mathematical software in applications. Letter grading.",
    "prerequisites": [
      "EC ENGR 133A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR133B"
  },
  {
    "course_code": "EC ENGR 134",
    "units": 4,
    "title": "Graph Theory in Engineering",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Basics of graph theory, including trees, bipartite graphs and matching, vertex and edge coloring, planar graphs and networks. Emphasis on reducing real-world engineering problems to graph theory formulations. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR134"
  },
  {
    "course_code": "EC ENGR 141",
    "units": 4,
    "title": "Principles of Feedback Control",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisite: course 102. Mathematical modeling of physical control systems in form of differential equations and transfer functions. Design problems, system performance indices of feedback control systems via classical techniques, root-locus and frequency-domain methods. Computer-aided solution of design problems from real world. Letter grading.",
    "prerequisites": [
      "EC ENGR 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR141"
  },
  {
    "course_code": "EC ENGR 142",
    "units": 4,
    "title": "Linear Systems: State-Space Approach",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisite: course 102. State-space methods of linear system analysis and synthesis, with application to problems in networks, control, and system modeling. Letter grading.",
    "prerequisites": [
      "EC ENGR 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR142"
  },
  {
    "course_code": "EC ENGR C143A",
    "units": 4,
    "title": "Neural Signal Processing",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisites: course 131A, Mathematics 33A. Topics include fundamental properties of electrical activity in neurons; technology for measuring neural activity; spiking statistics and Poisson processes; generative models and classification; regression and Kalman filtering; principal components analysis, factor analysis, and expectation maximization. Concurrently scheduled with course C243A. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A",
      "MATH 33A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRC143A"
  },
  {
    "course_code": "EC ENGR M146",
    "units": 4,
    "title": "Introduction to Machine Learning",
    "description": "(Same as Computer Science M146.) Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: course 131A or Civil and Environmental Engineering 110 or Mathematics 170A or 170E or Statistics 100A; Computer Science 32 or Program in Computing 10C; Mathematics 33A. Introduction to breadth of data science. Foundations for modeling data sources, principles of operation of common tools for data analysis, and application of tools and models to data gathering and analysis. Topics include statistical foundations, regression, classification, kernel methods, clustering, expectation maximization, principal component analysis, decision theory, reinforcement learning and deep learning. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A",
      "C&EE 110",
      "MATH 170A",
      "MATH 170E",
      "STATS 100A"
    ],
    "cross_listed": [
      "COM SCI M146"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM146"
  },
  {
    "course_code": "EC ENGR C147",
    "units": 4,
    "title": "Neural Networks and Deep Learning",
    "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 131A, 133A or 205A, and M146, or equivalent. Review of machine learning concepts; maximum likelihood; supervised classification; neural network architectures; backpropagation; regularization for training neural networks; optimization for training neural networks; convolutional neural networks; practical CNN architectures; deep learning libraries in Python; recurrent neural networks, backpropagation through time, long short-term memory and gated recurrent units; variational autoencoders; generative adversarial networks; adversarial examples and training. Concurrently scheduled with course C247. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A",
      "EC ENGR 133A",
      "EC ENGR 205A",
      "EC ENGR M146"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRC147"
  },
  {
    "course_code": "EC ENGR M148",
    "units": 4,
    "title": "Introduction to Data Science",
    "description": "(Same as Computer Science M148.) Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: one course from 131A, Civil and Environmental Engineering 110, Mathematics 170A, Mathematics 170E, or Statistics 100A, and Computer Science 31 or Program in Computing 10A, and 10B. How to analyze data arising in real world so as to understand corresponding phenomenon. Covers topics in machine learning, data analytics, and statistical modeling classically employed for prediction. Comprehensive, hands-on overview of data science domain by blending theoretical and practical instruction. Data science lifecycle: data selection and cleaning, feature engineering, model selection, and prediction methodologies. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A",
      "C&EE 110",
      "MATH 170A",
      "MATH 170E",
      "STATS 100A",
      "COM SCI 31",
      "PIC 10A",
      "PIC 10B"
    ],
    "cross_listed": [
      "COM SCI M148"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM148"
  },
  {
    "course_code": "EC ENGR 149",
    "units": 4,
    "title": "Foundations of Computer Vision",
    "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Recommended requisites: courses 102, 131A, Mathematics 33A. Covers foundations of computer vision from both theoretical and practical perspective. Particular emphasis on classical computer vision, which should be seen as complementary to deep learning. Study is relevant for various majors in the sciences specializing in artificial intelligence, cyberphysical systems and information engineering, robotics, machine learning, perception, and others looking for applications. Letter grading.",
    "prerequisites": [
      "EC ENGR 102",
      "EC ENGR 131A",
      "MATH 33A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR149"
  },
  {
    "course_code": "EC ENGR M153",
    "units": 4,
    "title": "Introduction to Microscale and Nanoscale Manufacturing",
    "description": "(Same as Bioengineering M153, Chemical Engineering M153, and Mechanical and Aerospace Engineering M183B.) Lecture, three hours; laboratory, four hours; outside study, five hours. Enforced requisites: Chemistry 20A, Physics 1A, 1B, 1C, 4AL. Introduction to general manufacturing methods, mechanisms, constrains, and microfabrication and nanofabrication. Focus on concepts, physics, and instruments of various microfabrication and nanofabrication techniques that have been broadly applied in industry and academia, including various photolithography technologies, physical and chemical deposition methods, and physical and chemical etching methods. Hands-on experience for fabricating microstructures and nanostructures in modern clean-room environment. Letter grading.",
    "prerequisites": [
      "CHEM 20A",
      "PHYSICS 1A",
      "PHYSICS 1B",
      "PHYSICS 1C",
      "PHYSICS 4AL"
    ],
    "cross_listed": [
      "BIOENGR M153",
      "MECH&AE M183B",
      "CH ENGR M153"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM153"
  },
  {
    "course_code": "EC ENGR 162A",
    "units": 4,
    "title": "Wireless Communication Links and Antennas",
    "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Enforced requisite: course 101B. Basic properties of transmitting and receiving antennas and antenna arrays. Array synthesis. Adaptive arrays. Friis transmission formula, radar equations. Cell-site and mobile antennas, bandwidth budget. Noise in communication systems (transmission lines, antennas, atmospheric, etc.). Cell-site and mobile antennas, cell coverage for signal and traffic, interference, multipath fading, ray bending, and other propagation phenomena. Letter grading.",
    "prerequisites": [
      "EC ENGR 101B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR162A"
  },
  {
    "course_code": "EC ENGR 163A",
    "units": 4,
    "title": "Introductory Microwave Circuits",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisite: course 101B. Transmission lines description of waveguides, impedance matching techniques, power dividers, directional couplers, active devices, transistor amplifier design. Letter grading.",
    "prerequisites": [
      "EC ENGR 101B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR163A"
  },
  {
    "course_code": "EC ENGR 163C",
    "units": 4,
    "title": "Fundamental Principles of Radiofrequency and Microwave Systems",
    "description": "Lecture, four hours; outside study, eight hours. Enforced requisite: course 101B. Theory and design of modern radiofrequency (RF) and microwave systems such as cellular communications, satellite systems, radar systems, wireless sensors, and biological applications of microwaves such as magnetic resonance imaging (MRI). Letter grading.",
    "prerequisites": [
      "EC ENGR 101B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR163C"
  },
  {
    "course_code": "EC ENGR 163DA",
    "units": 4,
    "title": "Microwave and Wireless Design I",
    "description": "Lecture, one hour; laboratory, three hours; outside study, eight hours. Enforced requisites: courses 101A, 101B. Course 163DA is enforced requisite to 163DB. Limited to senior Electrical Engineering majors. Capstone design course, with emphasis on transmission line-based circuits and components to address need in industry and research community for students with microwave and wireless circuit design experiences. Standard design procedure for waveguide and transmission line-based microwave circuits and systems to gain experience in using Microwave CAD software such as Agilent ADS or HFSS. How to fabricate and test these designs, In Progress grading (credit to be given only on completion of course 163DB).",
    "prerequisites": [
      "EC ENGR 101A",
      "EC ENGR 101B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR163DA"
  },
  {
    "course_code": "EC ENGR 163DB",
    "units": 4,
    "title": "Microwave and Wireless Design II",
    "description": "Lecture, one hour; laboratory, three hours; outside study, eight hours. Enforced requisites: courses 101A, 101B, 163DA. Limited to senior Electrical Engineering majors. Design of radio frequency circuits and systems, with emphasis on both theoretical foundations and hands-on experience. Design of radio frequency transceivers and their building blocks according to given specifications or in form of open-ended problems. Introduction to advanced topics related to projects through lecture and laboratories. Creation by students of end-to-end systems in application context, managing trade-offs across subsystems while meeting constraints and optimizing metrics related to cost, performance, ease of use, manufacturability, testing, and other real-world issues. Oral and written presentations of project results required. Letter grading.",
    "prerequisites": [
      "EC ENGR 101A",
      "EC ENGR 101B",
      "EC ENGR 163DA"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR163DB"
  },
  {
    "course_code": "EC ENGR 170A",
    "units": 4,
    "title": "Principles of Photonics",
    "description": "Lecture, four hours; recitation, one hour; outside study, seven hours. Enforced requisites: courses 2, 101A. Development of solid foundation on essential principles of photonics from ground up with minimum prior knowledge on this subject. Topics include optical properties of materials, optical wave propagation and modes, optical interferometers and resonators, optical coupling and modulation, optical absorption and emission, principles of lasers and light-emitting diodes, and optical detection. Letter grading.",
    "prerequisites": [
      "EC ENGR 2",
      "EC ENGR 101A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR170A"
  },
  {
    "course_code": "EC ENGR 170B",
    "units": 4,
    "title": "Lasers and Photonic Devices",
    "description": "Lecture, four hours; recitation, one hour; outside study, seven hours. Enforced requisite: course 170A. Coverage of laser physics, related photonic devices, and applications of lasers. Topics include resonators, thermal radiation, Einstein coefficients, optical amplification, semiconductor lasers, optical modulation and detection. Letter grading.",
    "prerequisites": [
      "EC ENGR 170A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR170B"
  },
  {
    "course_code": "EC ENGR 170C",
    "units": 4,
    "title": "Photonic Sensors and Solar Cells",
    "description": "Lecture, four hours; recitation, one hour; outside study, seven hours. Enforced requisite: course 101A. Recommended: courses 2, 170A. Fundamentals of detection of light for communication and sensing, as well as conversion of light to electrical energy in solar cells. Introduction to radiometry, semiconductor photodetectors, noise processes and figures of merit, thermal detectors, and photovoltaic solar cells of various types and materials. Letter grading.",
    "prerequisites": [
      "EC ENGR 101A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR170C"
  },
  {
    "course_code": "EC ENGR M171L",
    "units": 2,
    "title": "Data Communication Systems Laboratory",
    "description": "(Same as Computer Science M171L.) Laboratory, four to eight hours; outside study, two to four hours. Recommended preparation: course M116L. Limited to seniors. Not open to students with credit for course M117. Interpretation of analog-signaling aspects of digital systems and data communications through experience in using contemporary test instruments to generate and display signals in relevant laboratory setups. Use of oscilloscopes, pulse and function generators, baseband spectrum analyzers, desktop computers, terminals, modems, PCs, and workstations in experiments on pulse transmission impairments, waveforms and their spectra, modem and terminal characteristics, and interfaces. Letter grading.",
    "credit_exclusions": [
      "COM SCI 117"
    ],
    "cross_listed": [
      "COM SCI M171L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM171L"
  },
  {
    "course_code": "EC ENGR 173DA",
    "units": 4,
    "title": "Photonics and Communication Design",
    "description": "Lecture, one hour; laboratory, three hours; outside study, eight hours. Enforced requisite: course 101A. Recommended: course 170A or Bioengineering C170. Introduction to measurement of basic photonic devices, including LEDs, lasers, detectors, and amplifiers; fiber-optic fundamentals and measurement of fiber systems. Modulation techniques, including AM, FM, phase and suppressed carrier methods. Possible projects include lasers, optical communication, and biomedical imaging and sensing. Choice of project preliminary design. In Progress grading (credit to be given only on completion of course 173DB).",
    "prerequisites": [
      "EC ENGR 101A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR173DA"
  },
  {
    "course_code": "EC ENGR 173DB",
    "units": 4,
    "title": "Photonics and Communication Design",
    "description": "Lecture, one hour; laboratory, three hours; outside study, eight hours. Enforced requisites: courses 101A, 173DA. Introduction to measurement of basic photonic devices, including LEDs, lasers, detectors, and amplifiers; fiber-optic fundamentals and measurement of fiber systems. Modulation techniques, including AM, FM, phase and suppressed carrier methods. Possible projects include lasers, optical communication, and biomedical imaging and sensing. Finalization of design and testing of projects begun in course 173DA. Letter grading.",
    "prerequisites": [
      "EC ENGR 101A",
      "EC ENGR 173DA"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR173DB"
  },
  {
    "course_code": "EC ENGR 176",
    "units": 4,
    "title": "Photonics in Biomedical Applications",
    "description": "Lecture, three hours; discussion, one hour; outside study, eight hours. Enforced requisite: course 101A. Study of different types of optical systems and their physics background. Examination of their roles in current and projected biomedical applications. Specific capabilities of photonics to be related to each example. Letter grading.",
    "prerequisites": [
      "EC ENGR 101A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR176"
  },
  {
    "course_code": "EC ENGR 180DA",
    "units": 4,
    "title": "Systems Design",
    "description": "Lecture, two hours; laboratory, four hours; outside study, six hours. Limited to senior Electrical Engineering and Computer Engineering majors. Advanced systems design integrating communications, control, and signal processing subsystems. Introduction to advanced topics related to projects through lecture and laboratories. Open-ended projects vary each offering. Student teams create high-performance designs that manage trade-offs among subsystem components, including cost, performance, ease of use, and other real-world constraints. Societal implications of such systems. Professional technical writing instruction and assignments. Oral and written presentation of project results. In Progress grading (credit to be given only on completion of course 180DW).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR180DA"
  },
  {
    "course_code": "EC ENGR 180DW",
    "units": 4,
    "title": "Systems Design",
    "description": "(Formerly numbered 180DB.) Laboratory, four hours; outside study, eight hours. Enforced requisite: course 180DA. Advanced systems design integrating communications, control, and signal processing subsystems. Introduction to advanced topics related to projects through lecture and laboratories. Open-ended projects vary each offering. Student teams create high-performance designs that manage trade-offs among subsystem components, including cost, performance, ease of use, and other real-world constraints. Societal implications of such systems. Professional technical writing instruction and assignments. Oral and written presentation of project results. Completion of projects begun in course 180DA. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Writing II"
    ],
    "prerequisites": [
      "EC ENGR 180DA"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR180DW"
  },
  {
    "course_code": "EC ENGR 181DA",
    "units": 4,
    "title": "Honors Thesis",
    "description": "Tutorial, one hour; outside study, 11 hours. Limited to seniors. Research by individuals or small teams under supervision of faculty mentor, leading to composition and presentation of honors thesis. Study of fundamentals of modern research and development: project conception, planning, development and testing; design iteration cycle; research and data documentation standards; how to read technical literature. Planning, execution, and documentation of original open-ended research/development project. Study of research fundamentals, conception of project plan, and first iteration of design such as experiment, simulation, algorithm, or hardware artifact, each with testing and validation plan. Written documentation of design with oral presentation. In Progress grading (credit to be given only on completion of course 181DB).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR181DA"
  },
  {
    "course_code": "EC ENGR 181DB",
    "units": 4,
    "title": "Honors Thesis",
    "description": "Tutorial, one hour; outside study, 11 hours. Enforced requisite: course 181DA. Limited to seniors. Research by individuals or small teams under supervision of faculty mentor, leading to composition and presentation of honors thesis. Study of fundamentals of modern research and development: project conception, planning, development and testing; design iteration cycle; research and data documentation standards; how to read technical literature. Planning, execution, and documentation of original open-ended research/development project. Iterations of design. Written documentation in form of thesis documenting results in their societal and technical contexts, and oral presentation/demonstration of final results. Letter grading.",
    "prerequisites": [
      "EC ENGR 181DA"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR181DB"
  },
  {
    "course_code": "EC ENGR CM182",
    "units": 4,
    "title": "Science, Technology, and Public Policy",
    "description": "(Same as Public Affairs M164 and Public Policy CM182.) Lecture, three hours. Recent and continuing advances in science and technology are raising profoundly important public policy issues. Consideration of selection of critical policy issues, each of which has substantial ethical, social, economic, political, scientific, and technological aspects. Concurrently scheduled with course CM282. Letter grading.",
    "cross_listed": [
      "PUB PLC CM182",
      "PUB AFF M164"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRCM182"
  },
  {
    "course_code": "EC ENGR 183DA",
    "units": 4,
    "title": "Design of Robotic Systems I",
    "description": "Lecture, four hours; laboratory, two hours; outside study, six hours. Requisite: course 102. Recommended: courses 141, 142. Course 183DA is requisite to 183DB. Limited to senior Electrical Engineering majors. Topics in robotic design include integrated electromechanical design, design for manufacturing (DFM), design software, and design automation. Topics in robotic manufacturing include materials, sensors and actuators, programming, and rapid prototyping. Topics in control include manipulation, motion and path planning, learning and adaptation, and human-robot interaction. Additional topics may include distributed and multi-robot systems, bio-inspired robotics, project management, and societal implications. Open-ended projects vary annually. Student teams create and analyze robotic systems for various applications. Oral and written presentation of project results. In Progress grading (credit to be given only on completion of course 183DB).",
    "prerequisites": [
      "EC ENGR 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR183DA"
  },
  {
    "course_code": "EC ENGR 183DB",
    "units": 4,
    "title": "Design of Robotic Systems II",
    "description": "Laboratory, four hours; outside study, eight hours. Requisite: course 183DA. Recommended: courses 141, 142. Limited to senior Electrical Engineering majors. Topics in robotic design include integrated electromechanical design, design for manufacturing (DFM), design software, and design automation. Topics in robotic manufacturing include materials, sensors and actuators, programming, and rapid prototyping. Topics in control include manipulation, motion and path planning, learning and adaptation, and human-robot interaction. Additional topics may include distributed and multi-robot systems, bio-inspired robotics, project management, and societal implications. Open-ended projects vary annually. Student teams create and analyze robotic systems for various applications. Oral and written presentation of project results. Letter grading.",
    "prerequisites": [
      "EC ENGR 183DA"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR183DB"
  },
  {
    "course_code": "EC ENGR 184DA",
    "units": 2,
    "title": "Independent Group Project Design",
    "description": "Laboratory, five hours; discussion, one hour. Enforced requisites: courses M16, 110, 110L. Course 184DA is enforced requisite to 184DB. Courses centered on group project that runs year long to give students intensive experience on hardware design, microcontroller programming, and project coordination. Several projects based on autonomous robots that traverse small mazes and courses offered yearly and target regional competitions. Students may submit proposals that are evaluated and approved by faculty members. Topics include sensing circuits and amplifier-based design, microcontroller programming, feedback control, actuation, and motor control. In Progress grading (credit to be given only on completion of course 184DB).",
    "prerequisites": [
      "EC ENGR M16",
      "EC ENGR 110",
      "EC ENGR 110L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR184DA"
  },
  {
    "course_code": "EC ENGR 184DB",
    "units": 2,
    "title": "Independent Group Project Design",
    "description": "Laboratory, five hours; discussion, one hour. Enforced requisites: courses M16, 110, 110L, 184DA. Courses centered on group project that runs year long to give students intensive experience on hardware design, microcontroller programming, and project coordination. Several projects based on autonomous robots that traverse small mazes and courses offered yearly and target regional competitions. Students may submit proposals that are evaluated and approved by faculty members. Topics include sensing circuits and amplifier-based design, microcontroller programming, feedback control, actuation, and motor control. Letter grading.",
    "prerequisites": [
      "EC ENGR M16",
      "EC ENGR 110",
      "EC ENGR 110L",
      "EC ENGR 184DA"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR184DB"
  },
  {
    "course_code": "EC ENGR M185",
    "units": 4,
    "title": "Introduction to Plasma Science and Engineering",
    "description": "(Same as Earth, Planetary, and Space Sciences M156 and Physics M122.) Lecture, three hours; discussion, one hour; outside study, eight hours. Requisite: course 101A or Physics 110B. Senior-level introductory course on electrodynamics of charged particles and their collective behavior in plasmas in laboratory, near-Earth space and astrophysical settings. Covers selected applications taken from fusion energy, space weather, materials processing, generation of coherent radiation and particle accelerators. Letter grading.",
    "prerequisites": [
      "EC ENGR 101A",
      "PHYSICS 110B"
    ],
    "cross_listed": [
      "EPS SCI M156",
      "PHYSICS M122"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM185"
  },
  {
    "course_code": "EC ENGR 188",
    "units": 4,
    "title": "Special Courses in Electrical Engineering",
    "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Special topics in electrical engineering for undergraduate students taught on experimental or temporary basis, such as those taught by resident and visiting faculty members. May be repeated once for credit with topic or instructor change. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR188"
  },
  {
    "course_code": "EC ENGR 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR188SA"
  },
  {
    "course_code": "EC ENGR 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "EC ENGR 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR188SB"
  },
  {
    "course_code": "EC ENGR 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "EC ENGR 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR188SC"
  },
  {
    "course_code": "EC ENGR 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR189"
  },
  {
    "course_code": "EC ENGR 194",
    "units": 2,
    "title": "Research Group Seminars: Electrical Engineering",
    "description": "Seminar, four hours; outside study, eight hours. Designed for undergraduate students who are part of research group. Discussion of research methods and current literature in field. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR194"
  },
  {
    "course_code": "EC ENGR 199",
    "units": 2,
    "title": "Directed Research in Electrical Engineering",
    "description": "Tutorial, to be arranged. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit with school approval. Individual contract required; enrollment petitions available in Office of Academic and Student Affairs. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR199"
  },
  {
    "course_code": "EC ENGR 201A",
    "units": 4,
    "title": "VLSI Design Automation",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 115C. Fundamentals of design automation of VLSI circuits and systems, including introduction to circuit and system platforms such as field programmable gate arrays and multicore systems; high-level synthesis, logic synthesis, and technology mapping; physical design; and testing and verification. Letter grading.",
    "prerequisites": [
      "EC ENGR 115C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR201A"
  },
  {
    "course_code": "EC ENGR 201C",
    "units": 4,
    "title": "Modeling of VLSI Circuits and Systems",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 115C. Detailed study of VLSI circuit and system models considering performance, signal integrity, power and thermal effects, reliability, and manufacturability. Discussion of principles of modeling and optimization codevelopment. Letter grading.",
    "prerequisites": [
      "EC ENGR 115C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR201C"
  },
  {
    "course_code": "EC ENGR 201D",
    "units": 4,
    "title": "Design in Nanoscale Technologies",
    "description": "Lecture, four hours; outside study, eight hours. Enforced requisite: course 115C. Challenges of digital circuit design and layout in deeply scaled technologies, with focus on design-manufacturing interactions. Summary of large-scale digital design flow; basic manufacturing flow; lithographic patterning, resolution enhancement, and mask preparation; yield and variation modeling; circuit reliability and aging issues; design rules and their origins; layout design for manufacturing; test structures and process control; circuit and architecture methods for variability mitigation. Letter grading.",
    "prerequisites": [
      "EC ENGR 115C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR201D"
  },
  {
    "course_code": "EC ENGR M202A",
    "units": 4,
    "title": "Embedded Systems",
    "description": "(Same as Computer Science M213A.) Lecture, four hours; discussion, one hour; outside study, seven hours. Designed for graduate computer science and electrical engineering students. Methodologies and technologies for design of embedded systems. Topics include hardware and software platforms for embedded systems, techniques for modeling and specification of system behavior, software organization, real-time operating system scheduling, real-time communication and packet scheduling, low-power battery and energy-aware system design, timing synchronization, fault tolerance and debugging, and techniques for hardware and software architecture optimization. Theoretical foundations as well as practical design methods. Letter grading.",
    "cross_listed": [
      "COM SCI M213A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM202A"
  },
  {
    "course_code": "EC ENGR M202B",
    "units": 4,
    "title": "Energy-Aware Computing and Cyber-Physical Systems",
    "description": "(Same as Computer Science M213B.) Lecture, four hours; outside study, eight hours. Requisite: course M16 or Computer Science M51A. Recommended: course M116C or Computer Science M151B, and Computer Science 111. System-level management and cross-layer methods for power and energy consumption in computing and communication at various scales ranging across embedded, mobile, personal, enterprise, and data-center scale. Computing, networking, sensing, and control technologies and algorithms for improving energy sustainability in human-cyber-physical systems. Topics include modeling of energy consumption, energy sources, and energy storage; dynamic power management; power-performance scaling and energy proportionality; duty-cycling; power-aware scheduling; low-power protocols; battery modeling and management; thermal management; sensing of power consumption. Letter grading.",
    "prerequisites": [
      "EC ENGR M16",
      "COM SCI M51A"
    ],
    "cross_listed": [
      "COM SCI M213B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM202B"
  },
  {
    "course_code": "EC ENGR 202C",
    "units": 4,
    "title": "Networked Embedded Systems Design",
    "description": "Lecture, four hours; laboratory, four hours; outside study, four hours. Designed for graduate computer science and electrical engineering students. Training in combination of networked embedded systems design combining embedded hardware platform, embedded operating system, and hardware/software interface. Essential graduate student background for research and industry career paths in wireless devices for applications ranging from conventional wireless mobile devices to new area of wireless health. Laboratory design modules and course projects based on state-of-art embedded hardware platform. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR202C"
  },
  {
    "course_code": "EC ENGR 205A",
    "units": 4,
    "title": "Matrix Analysis for Scientists and Engineers",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Preparation: one undergraduate linear algebra course. Designed for first-year graduate students in all branches of engineering, science, and related disciplines. Introduction to matrix theory and linear algebra, language in which virtually all of modern science and engineering is conducted. Review of matrices taught in undergraduate courses and introduction to graduate-level topics. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR205A"
  },
  {
    "course_code": "EC ENGR M206",
    "units": 4,
    "title": "Machine Perception",
    "description": "(Same as Computer Science M268.) Lecture, four hours; discussion, two hours; outside study, six hours. Designed for graduate students. Computational aspects of processing visual and other sensory information. Unified treatment of early vision in man and machine. Integration of symbolic and iconic representations in process of image segmentation. Computing multimodal sensory information by neural-net architectures. Letter grading.",
    "cross_listed": [
      "COM SCI M268"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM206"
  },
  {
    "course_code": "EC ENGR M208B",
    "units": 4,
    "title": "Functional Analysis for Applied Mathematics and Engineering",
    "description": "(Same as Mathematics M268A.) Lecture, four hours; outside study, eight hours. Requisites: course 208A (or Mathematics 115A and 115B), Mathematics 131A, 131B, 132. Topics may include Lp spaces, Hilbert, Banach, and separable spaces; Fourier transforms; linear functionals. Riesz representation theory, linear operators and their adjoints; self-adjoint and compact operators. Spectral theory. Differential operators such as Laplacian and eigenvalue problems. Resolvent distributions and Green’s functions. Semigroups. Applications. S/U or letter grading.",
    "prerequisites": [
      "EC ENGR 208A",
      "MATH 115A",
      "MATH 115B",
      "MATH 131A",
      "MATH 131B",
      "MATH 132"
    ],
    "cross_listed": [
      "MATH M268A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM208B"
  },
  {
    "course_code": "EC ENGR M208C",
    "units": 4,
    "title": "Topics in Functional Analysis for Applied Mathematics and Engineering",
    "description": "(Same as Mathematics M268B.) Lecture, four hours; outside study, eight hours. Requisite: course M208B. Semigroups of linear operators over Hilbert spaces; generator and resolvent, generation theorems, Laplace inversion formula. Dissipative operators and contraction semigroups. Analytic semigroups and spectral representation. Semigroups with compact resolvents. Parabolic and hyperbolic systems. Controllability and stabilizability. Spectral theory of differential operators, PDEs, generalized functions. S/U or letter grading.",
    "prerequisites": [
      "EC ENGR M208B"
    ],
    "cross_listed": [
      "MATH M268B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM208C"
  },
  {
    "course_code": "EC ENGR 209AS",
    "units": 4,
    "title": "Special Topics in Circuits and Embedded Systems",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Special topics in one or more aspects of circuits and embedded systems, such as digital, analog, mixed-signal, and radio frequency integrated circuits (RF ICs); electronic design automation; wireless communication circuits and systems; embedded processor architectures; embedded software; distributed sensor and actuator networks; robotics; and embedded security. May be repeated for credit with topic change. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR209AS"
  },
  {
    "course_code": "EC ENGR 209BS",
    "units": 2,
    "title": "Seminar: Circuits and Embedded Systems",
    "description": "Seminar, two to four hours; outside study, four to eight hours. Seminars and discussions on current and advanced topics in one or more aspects of circuits and embedded systems, such as digital, analog, mixed-signal, and radio frequency integrated circuits (RF ICs); electronic design automation; wireless communication circuits and systems; embedded processor architectures; embedded software; distributed sensor and actuator networks; robotics; and embedded security. May be repeated for credit with topic change. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR209BS"
  },
  {
    "course_code": "EC ENGR 210A",
    "units": 4,
    "title": "Adaptation and Learning",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Preparation: prior training in probability theory, random processes, and linear algebra. Recommended requisites: courses 205A, 241A. Mean-square-error estimation and filters, least-squares estimation and filters, steepest-descent algorithms, stochastic-gradient algorithms, convergence, stability, tracking, and performance, algorithms for adaptation and learning, adaptive filters, learning and classification, optimization. Letter grading.",
    "prerequisites": [
      "EC ENGR 205A",
      "EC ENGR 241A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR210A"
  },
  {
    "course_code": "EC ENGR 210B",
    "units": 4,
    "title": "Inference over Networks",
    "description": "Lecture, four hours; outside study, eight hours. Preparation: prior training in probability theory, random processes, linear algebra, and adaptation. Enforced requisite: course 210A. Adaptation, learning, estimation, and detection over networks. Steepest-descent algorithms, stochastic-gradient algorithms, convergence, stability, tracking, and performance analyses. Distributed optimization. Online and distributed adaptation and learning. Synchronous and asynchronous network behavior. Incremental, consensus, diffusion, and gossip strategies. Letter grading.",
    "prerequisites": [
      "EC ENGR 210A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR210B"
  },
  {
    "course_code": "EC ENGR 211A",
    "units": 4,
    "title": "Digital Image Processing I",
    "description": "Lecture, three hours; discussion, one hour; laboratory, four hours; outside study, four hours. Preparation: computer programming experience. Requisite: course 113. Fundamentals of digital image processing theory and techniques. Topics include two-dimensional linear system theory, image transforms, and enhancement. Concepts covered in lecture applied in computer laboratory assignments. Letter grading.",
    "prerequisites": [
      "EC ENGR 113"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR211A"
  },
  {
    "course_code": "EC ENGR 212A",
    "units": 4,
    "title": "Theory and Design of Digital Filters",
    "description": "Lecture, three hours; discussion, one hour; outside study, eight hours. Requisite: course 113. Approximation of filter specifications. Use of design charts. Structures for recursive digital filters. FIR filter design techniques. Comparison of IIR and FIR structures. Implementation of digital filters. Limit cycles. Overflow oscillations. Discrete random signals. Wave digital filters. Letter grading.",
    "prerequisites": [
      "EC ENGR 113"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR212A"
  },
  {
    "course_code": "EC ENGR M214A",
    "units": 4,
    "title": "Digital Speech Processing",
    "description": "(Same as Bioengineering M214A.) Lecture, three hours; laboratory, two hours; outside study, seven hours. Requisite: course 113. Theory and applications of digital processing of speech signals. Mathematical models of human speech production and perception mechanisms, speech analysis/synthesis. Techniques include linear prediction, filter-bank models, and homomorphic filtering. Applications to speech synthesis, automatic recognition, and hearing aids. Letter grading.",
    "prerequisites": [
      "EC ENGR 113"
    ],
    "cross_listed": [
      "BIOENGR M214A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM214A"
  },
  {
    "course_code": "EC ENGR 214B",
    "units": 4,
    "title": "Advanced Topics in Speech Processing",
    "description": "Lecture, three hours; discussion, one hour; computer assignments, two hours; outside study, six hours. Requisite: course M214A. Advanced techniques used in various speech-processing applications, with focus on speech recognition by humans and machine. Physiology and psychoacoustics of human perception. Dynamic Time Warping (DTW) and Hidden Markov Models (HMM) for automatic speech recognition systems, pattern classification, and search algorithms. Aids for hearing impaired. Letter grading.",
    "prerequisites": [
      "EC ENGR M214A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR214B"
  },
  {
    "course_code": "EC ENGR 215A",
    "units": 4,
    "title": "Analog Integrated Circuit Design",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 115B. Analysis and design of analog integrated circuits. MOS and bipolar device structures and models, single-stage and differential amplifiers, noise, feedback, operational amplifiers, offset and distortion, sampling devices and discrete-time circuits, bandgap references. Letter grading.",
    "prerequisites": [
      "EC ENGR 115B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR215A"
  },
  {
    "course_code": "EC ENGR 215B",
    "units": 4,
    "title": "Advanced Digital Integrated Circuits",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisites: courses 115C, M216A. Analysis and comparison of modern logic families. VLSI memories (SRAM, DRAM, and ROMs). Accuracy of various simulation models and simulation methods for digital circuits. Letter grading.",
    "prerequisites": [
      "EC ENGR 115C",
      "EC ENGR M216A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR215B"
  },
  {
    "course_code": "EC ENGR 215C",
    "units": 4,
    "title": "Analysis and Design of RF Circuits and Systems",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 215A. Principles of RF circuit and system design, with emphasis on monolithic implementation in VLSI technologies. Basic concepts, communications background, transceiver architectures, low-noise amplifiers and mixers, oscillators, frequency synthesizers, power amplifiers. Letter grading.",
    "prerequisites": [
      "EC ENGR 215A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR215C"
  },
  {
    "course_code": "EC ENGR 215D",
    "units": 4,
    "title": "Analog Microsystem Design",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 215A. Analysis and design of data conversion interfaces and filters. Sampling circuits and architectures, D/A conversion techniques, A/D converter architectures, building blocks, precision techniques, discrete- and continuous-time filters. Letter grading.",
    "prerequisites": [
      "EC ENGR 215A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR215D"
  },
  {
    "course_code": "EC ENGR 215E",
    "units": 4,
    "title": "Signaling and Synchronization",
    "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 215A, M216A. Analysis and design of circuits for synchronization and communication for VLSI systems. Use of both digital and analog design techniques to improve data rate of electronics between functional blocks, chips, and systems. Advanced clocking methodologies, phase-locked loop design for clock generation, and high-performance wire-line transmitters, receivers, and timing recovery circuits. Letter grading.",
    "prerequisites": [
      "EC ENGR 215A",
      "EC ENGR M216A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR215E"
  },
  {
    "course_code": "EC ENGR M216A",
    "units": 4,
    "title": "Design of VLSI Circuits and Systems",
    "description": "(Same as Computer Science M258A.) Lecture, four hours; discussion, two hours; laboratory, four hours; outside study, two hours. Requisites: courses M16 or Computer Science M51A, and 115A. Recommended: course 115C. LSI/VLSI design and application in computer systems. Fundamental design techniques that can be used to implement complex integrated systems on chips. Letter grading.",
    "prerequisites": [
      "EC ENGR M16",
      "COM SCI M51A",
      "COM SCI 115A"
    ],
    "cross_listed": [
      "COM SCI M258A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM216A"
  },
  {
    "course_code": "EC ENGR 216B",
    "units": 4,
    "title": "VLSI Signal Processing",
    "description": "Lecture, four hours; outside study, eight hours. Advanced concepts in VLSI signal processing, with emphasis on architecture design and optimization within block-based description that can be mapped to hardware. Fundamental concepts from digital signal processing (DSP) theory, architecture, and circuit design applied to complex DSP algorithms in emerging applications for personal communications and healthcare. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR216B"
  },
  {
    "course_code": "EC ENGR M216C",
    "units": 4,
    "title": "LSI in Computer System Design",
    "description": "(Same as Computer Science M258C.) Lecture, four hours; laboratory, four hours; outside study, four hours. Requisite: course M216A. LSI/VLSI design and application in computer systems. In-depth studies of VLSI architectures and VLSI design tools. Letter grading.",
    "prerequisites": [
      "EC ENGR M216A"
    ],
    "cross_listed": [
      "COM SCI M258C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM216C"
  },
  {
    "course_code": "EC ENGR M217",
    "units": 4,
    "title": "Biomedical Imaging",
    "description": "(Same as Bioengineering M217.) Lecture, three hours; discussion, one hour; outside study, eight hours. Requisite: course 114 or 211A. Optical imaging modalities in biomedicine. Other nonoptical imaging modalities discussed briefly for comparison purposes. Letter grading.",
    "prerequisites": [
      "EC ENGR 114",
      "EC ENGR 211A"
    ],
    "cross_listed": [
      "BIOENGR M217"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM217"
  },
  {
    "course_code": "EC ENGR 218",
    "units": 4,
    "title": "Network Economics and Game Theory",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Discussion of how different cooperative and noncooperative games among agents can be constructed to model, analyze, optimize, and shape emerging interactions among users in different networks and system settings. How strategic agents can successfully compete with each other for limited and time-varying resources by optimizing their decision process and learning from their past interaction with other agents. To determine their optimal actions in these distributed, informationally decentralized environments, agents need to learn and model directly or implicitly other agents’ responses to their actions. Discussion of existing multiagent learning techniques and learning in games, including adjustment processes for learning equilibria, fictitious play, regret-learning, and more. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR218"
  },
  {
    "course_code": "EC ENGR 219",
    "units": 4,
    "title": "Large-Scale Data Mining: Models and Algorithms",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Introduction of variety of scalable data modeling tools, both predictive and causal, from different disciplines. Topics include supervised and unsupervised data modeling tools from machine learning, such as support vector machines, different regression engines, different types of regularization and kernel techniques, deep learning, and Bayesian graphical models. Emphasis on techniques to evaluate relative performance of different methods and their applicability. Includes computer projects that explore entire data analysis and modeling cycle: collecting and cleaning large-scale data, deriving predictive and causal models, and evaluating performance of different models. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR219"
  },
  {
    "course_code": "EC ENGR 221A",
    "units": 4,
    "title": "Physics of Semiconductor Devices I",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Physical principles and design considerations of junction devices. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR221A"
  },
  {
    "course_code": "EC ENGR 221B",
    "units": 4,
    "title": "Physics of Semiconductor Devices II",
    "description": "Lecture, four hours; outside study, eight hours. Principles and design considerations of field effect devices and charge-coupled devices. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR221B"
  },
  {
    "course_code": "EC ENGR 221C",
    "units": 4,
    "title": "Microwave Semiconductor Devices",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Physical principles and design considerations of microwave solid-state devices: Schottky barrier mixer diodes, IMPATT diodes, transferred electron devices, tunnel diodes, microwave transistors. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR221C"
  },
  {
    "course_code": "EC ENGR 222",
    "units": 4,
    "title": "Integrated Circuits Fabrication Processes",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 2. Principles of integrated circuits fabrication processes. Technological limitations of integrated circuits design. Topics include bulk crystal and epitaxial growth, thermal oxidation, diffusion, ion-implantation, chemical vapor deposition, dry etching, lithography, and metallization. Introduction of advanced process simulation tools. Letter grading.",
    "prerequisites": [
      "EC ENGR 2"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR222"
  },
  {
    "course_code": "EC ENGR 223",
    "units": 4,
    "title": "Solid-State Electronics I",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Recommended requisite: course 270. Energy band theory, electronic band structure of various elementary, compound, and alloy semiconductors, defects in semiconductors. Recombination mechanisms, transport properties. Letter grading.",
    "prerequisites": [
      "EC ENGR 270"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR223"
  },
  {
    "course_code": "EC ENGR 224",
    "units": 4,
    "title": "Solid-State Electronics II",
    "description": "Lecture, four hours; outside study, eight hours. Requisite: course 223. Techniques to solve Boltzmann transport equation, various scattering mechanisms in semiconductors, high field transport properties in semiconductors, Monte Carlo method in transport. Optical properties. Letter grading.",
    "prerequisites": [
      "EC ENGR 223"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR224"
  },
  {
    "course_code": "EC ENGR 225",
    "units": 4,
    "title": "Physics of Semiconductor Nanostructures and Devices",
    "description": "Lecture, four hours; outside study, eight hours. Requisite: course 223. Theoretical methods for circulating electronics and optical properties of semiconductor structures. Quantum size effects and low-dimensional systems. Application to semiconductor nanometer scale devices, including negative resistance diodes, transistors, and detectors. Letter grading.",
    "prerequisites": [
      "EC ENGR 223"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR225"
  },
  {
    "course_code": "EC ENGR 229",
    "units": 4,
    "title": "Seminar: Advanced Topics in Solid-State Electronics",
    "description": "Seminar, four hours; outside study, eight hours. Requisites: courses 223, 224. Current research areas, such as radiation effects in semiconductor devices, diffusion in semiconductors, optical and microwave semiconductor devices, nonlinear optics, and electron emission. Letter grading.",
    "prerequisites": [
      "EC ENGR 223",
      "EC ENGR 224"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR229"
  },
  {
    "course_code": "EC ENGR 229S",
    "units": 2,
    "title": "Advanced Electrical Engineering Seminar",
    "description": "Seminar, two hours; outside study, six hours. Preparation: successful completion of PhD major field examination. Seminar on current research topics in solid-state and quantum electronics (Section 1) or in electronic circuit theory and applications (Section 2). Students report on tutorial topic and on research topic in their dissertation area. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR229S"
  },
  {
    "course_code": "EC ENGR 230A",
    "units": 4,
    "title": "Detection and Estimation in Communication",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 131A. Applications of estimation and detection concepts in communication and signal processing; random signal and noise characterizations by analysis and simulations; mean square (MS) and maximum likelihood (ML) estimations and algorithms; detection under ML, Bayes, and Neyman/Pearson (NP) criteria; signal-to-noise ratio (SNR) and error probability evaluations. Introduction to Monte Carlo simulations. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR230A"
  },
  {
    "course_code": "EC ENGR 230B",
    "units": 4,
    "title": "Digital Communication Systems",
    "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 132A, 230A. Principles and practical techniques for communication at physical and multiple access layers. Review of communications over Gaussian channel. Synchronization and adaptive equalization. Nonlinear impairments in radio transceivers. Wireless channel models, diversity techniques, and link budgets. Modulations for wireless channels. Multi-antenna methods. Wireless multiple access and resource allocation techniques. Scalable approaches to meeting wireless data rate demand. Letter grading.",
    "prerequisites": [
      "EC ENGR 132A",
      "EC ENGR 230A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR230B"
  },
  {
    "course_code": "EC ENGR 230C",
    "units": 4,
    "title": "Signal Processing in Communications",
    "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 131A, 230A. Concepts and implementations of signal processing in communication and signal processing systems. Spectral analysis using Fourier transform and windowing, parametric modeling, eigen-decomposition methods, time-frequency analysis, wavelet transform, and sub-band processing. Array processing using beamforming for SNIR enhancement, smart antenna, and source separation and localization. Introduction to compressive sampling and applications. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A",
      "EC ENGR 230A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR230C"
  },
  {
    "course_code": "EC ENGR 230D",
    "units": 4,
    "title": "Algorithms and Processing in Communication Systems",
    "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 131A, 230A. Review of computational linear algebra methods on QRD, eigen- and singular-value decompositions, and LS estimation with applications to estimation and detection in communication, radar, speech, image, and array processing systems. Systolic and parallel algorithms and VLSI architectures for high performance and high throughput real-time estimation, detection, decoding, and beamforming applications. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A",
      "EC ENGR 230A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR230D"
  },
  {
    "course_code": "EC ENGR 231A",
    "units": 4,
    "title": "Information Theory",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 131A. Fundamentals information compression, transmission, processing, and learning. Topics include limits and algorithms for lossless data compression, connections to model estimation and learning, channel capacity, rate versus distortion in lossy compression, and basics of information theory for networks. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR231A"
  },
  {
    "course_code": "EC ENGR 231B",
    "units": 4,
    "title": "Network Information Theory",
    "description": "Lecture, four hours; outside study, eight hours. Enforced requisite: course 231A. Point-to-point multiple-input, multiple-output (MIMO) wireless channels: capacity and outage; single-hop networks: multiple access, broadcast, interference, and relay channels; channels and sources with side-information; basics of multiterminal lossy data compression; basics of network information flow over general noisy networks. Letter grading.",
    "prerequisites": [
      "EC ENGR 231A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR231B"
  },
  {
    "course_code": "EC ENGR 231E",
    "units": 4,
    "title": "Channel Coding Theory",
    "description": "Lecture, four hours; outside study, eight hours. Requisite: course 131A. Fundamentals of error control codes and decoding algorithms. Topics include block codes, convolutional codes, trellis codes, and turbo codes. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR231E"
  },
  {
    "course_code": "EC ENGR 232A",
    "units": 4,
    "title": "Stochastic Modeling with Applications to Telecommunication Systems",
    "description": "Lecture, four hours; outside study, eight hours. Requisite: course 131A. Stochastic processes as applied to study of telecommunication systems, traffic engineering, business, and management. Discrete-time and continuous-time Markov chain processes. Renewal processes, regenerative processes, Markov-renewal, semi-Markov and semiregenerative stochastic processes. Decision and reward processes. Applications to traffic and queueing analysis of basic telecommunications and computer communication networks, Internet, and management systems. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR232A"
  },
  {
    "course_code": "EC ENGR 232B",
    "units": 4,
    "title": "Queueing Systems and Intelligent Transportation Networks",
    "description": "Lecture, four hours; outside study, eight hours. Requisite: course 131A or equivalent. Modeling, analysis, and design of queuing systems; traffic management and design of intelligent transportation systems, communications networks, autonomous vehicular networks, business and management systems. Markovian and non-Markovian queuing systems and networks. Applications to traffic engineering, transportation and autonomous vehicular systems; computer communications, management and business systems. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR232B"
  },
  {
    "course_code": "EC ENGR 232D",
    "units": 4,
    "title": "Communications Networking and Traffic Management for Autonomous Mobile Systems",
    "description": "Lecture, four hours; outside study, eight hours. Requisite: course 131A or equivalent. Analysis, design, and traffic management of autonomous mobile systems. Telecommunication networks, mobile wireless networks, and multiple-access communication systems. Networking architectures, multiple-access communications under adaptive quality-of-service metrics. Switching, routing, networking protocols, and Internet. Autonomous mobile networked systems. Cellular wireless networks, WiFi mesh networks, peer-to-peer mobile ad hoc wireless networks. Autonomous transportation networked systems. Traffic management architectures in support of self-driving cars. Smart grid networks. Adaptive multimedia streaming over mobile wireless networks. Embedded sensor networks. Energy and pollution aware sustainable networking. Security mechanisms. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR232D"
  },
  {
    "course_code": "EC ENGR 232E",
    "units": 4,
    "title": "Large Scale Social and Complex Networks: Design and Algorithms",
    "description": "Lecture, four hours; recitation, one hour; outside study, seven hours. Modeling and design of large-scale complex networks, including social networks, peer-to-peer file-sharing networks, World Wide Web, and gene networks. Modeling of characteristic topological features of complex networks, such as power laws and percolation threshold. Mining topology to design algorithms for various applications, such as e-mail spam detection, friendship recommendations, viral popularity, and epidemics. Introduction to network algorithms, computational complexity, and nondeterministic, polynomial-time completeness. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR232E"
  },
  {
    "course_code": "EC ENGR 233",
    "units": 4,
    "title": "Wireless Communications System Design, Modeling, and Implementation",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 113. Covers algorithms, architectures, and implementation for radio transceivers, physical, and network layer functionalities. Topics include wireless channel modeling, single-carrier and multi-carrier systems, multiple antenna systems, radio impairments and their correction, architectures and circuits design trade-offs, wideband spectrum sensing, wideband signaling, cognitive radio, massive multiple-input, multiple-output (MIMO) systems, and applications in 5G and Internet of things (IoT) communication. Letter grading.",
    "prerequisites": [
      "EC ENGR 113"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR233"
  },
  {
    "course_code": "EC ENGR 234A",
    "units": 4,
    "title": "Network Coding Theory and Applications",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Algebraic approach and main theorem in network coding, combinatorial approach and alphabet size, linear programming approach and throughput benefits, network code design algorithms, secure network coding, network coding for wireless, other applications. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR234A"
  },
  {
    "course_code": "EC ENGR 235A",
    "units": 4,
    "title": "Mathematical Foundations of Data Storage Systems",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 131A or equivalent. Research developments in new mathematical techniques for emerging large-scale, ultra-reliable, fast, and affordable data storage systems. Topics include, but are not limited to, graph-based codes and algebraic codes and decoders for modern storage devices (e.g., Flash), rank modulation, rewriting codes, algorithms for data deduplication and synchronization, and redundant array of independent disks (RAID) systems. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR235A"
  },
  {
    "course_code": "EC ENGR 236A",
    "units": 4,
    "title": "Linear Programming",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: Mathematics 115A or equivalent knowledge of linear algebra. Basic graduate course in linear optimization. Geometry of linear programming. Duality. Simplex method. Interior-point methods. Decomposition and large-scale linear programming. Quadratic programming and complementary pivot theory. Engineering applications. Introduction to integer linear programming and computational complexity theory. Letter grading.",
    "prerequisites": [
      "MATH 115A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR236A"
  },
  {
    "course_code": "EC ENGR 236B",
    "units": 4,
    "title": "Convex Optimization",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 236A. Introduction to convex optimization and its applications. Convex sets, functions, and basics of convex analysis. Convex optimization problems (linear and quadratic programming, second-order cone and semidefinite programming, geometric programming). Lagrange duality and optimality conditions. Applications of convex optimization. Unconstrained minimization methods. Interior-point and cutting-plane algorithms. Introduction to nonlinear programming. Letter grading.",
    "prerequisites": [
      "EC ENGR 236A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR236B"
  },
  {
    "course_code": "EC ENGR 236C",
    "units": 4,
    "title": "Optimization Methods for Large-Scale Systems",
    "description": "Lecture, four hours; outside study, eight hours. Requisite: course 236B. First-order algorithms for convex optimization: subgradient method, conjugate gradient method, proximal gradient and accelerated proximal gradient methods, block coordinate descent. Decomposition of large-scale optimization problems. Augmented Lagrangian method and alternating direction method of multipliers. Monotone operators and operator-splitting algorithms. Second-order algorithms: inexact Newton methods, interior-point algorithms for conic optimization. Letter grading.",
    "prerequisites": [
      "EC ENGR 236B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR236C"
  },
  {
    "course_code": "EC ENGR M237",
    "units": 4,
    "title": "Dynamic Programming",
    "description": "(Same as Mechanical and Aerospace Engineering M276.) Lecture, four hours; outside study, eight hours. Recommended requisite: course 232A or 236A or 236B. Introduction to mathematical analysis of sequential decision processes. Finite horizon model in both deterministic and stochastic cases. Finite-state infinite horizon model. Methods of solution. Examples from inventory theory, finance, optimal control and estimation, Markov decision processes, combinatorial optimization, communications. Letter grading.",
    "prerequisites": [
      "EC ENGR 232A",
      "EC ENGR 236A",
      "EC ENGR 236B"
    ],
    "cross_listed": [
      "MECH&AE M276"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM237"
  },
  {
    "course_code": "EC ENGR 238",
    "units": 4,
    "title": "Multimedia Communications and Processing",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 131A. Key concepts, principles, and algorithms of online learning and learning how to make decisions under uncertainty in broad context, including Markov decision processes, optimal stopping, reinforcement learning, structural results for online learning, multiarmed bandits learning, multiagent learning, multiagent deep learning. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR238"
  },
  {
    "course_code": "EC ENGR 239AS",
    "units": 4,
    "title": "Special Topics in Signals and Systems",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Special topics in one or more aspects of signals and systems, such as communications, control, image processing, information theory, multimedia, computer networking, optimization, speech processing, telecommunications, and VLSI signal processing. May be repeated for credit with topic change. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR239AS"
  },
  {
    "course_code": "EC ENGR 239BS",
    "units": 4,
    "title": "Seminar: Signals and Systems",
    "description": "Seminar, two to four hours; outside study, four to eight hours. Seminars and discussions on current and advanced topics in one or more aspects of signals and systems, such as communications, control, image processing, information theory, multimedia, computer networking, optimization, speech processing, telecommunications, and VLSI signal processing. May be repeated for credit with topic change. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR239BS"
  },
  {
    "course_code": "EC ENGR M240A",
    "units": 4,
    "title": "Linear Dynamic Systems",
    "description": "(Same as Chemical Engineering M280A and Mechanical and Aerospace Engineering M270A.) Lecture, four hours; outside study, eight hours. Requisite: course 141 or Mechanical and Aerospace Engineering 171A. State-space description of linear time-invariant (LTI) and time-varying (LTV) systems in continuous and discrete time. Linear algebra concepts such as eigenvalues and eigenvectors, singular values, Cayley/Hamilton theorem, Jordan form; solution of state equations; stability, controllability, observability, realizability, and minimality. Stabilization design via state feedback and observers; separation principle. Connections with transfer function techniques. Letter grading.",
    "prerequisites": [
      "EC ENGR 141",
      "MECH&AE 171A"
    ],
    "cross_listed": [
      "CH ENGR M280A",
      "MECH&AE M270A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM240A"
  },
  {
    "course_code": "EC ENGR M240C",
    "units": 4,
    "title": "Optimal Control",
    "description": "(Same as Chemical Engineering M280C and Mechanical and Aerospace Engineering M270C.) Lecture, four hours; outside study, eight hours. Requisite: course 240B. Applications of variational methods, Pontryagin maximum principle, Hamilton/Jacobi/Bellman equation (dynamic programming) to optimal control of dynamic systems modeled by nonlinear ordinary differential equations. Letter grading.",
    "prerequisites": [
      "EC ENGR 240B"
    ],
    "cross_listed": [
      "MECH&AE M270C",
      "CH ENGR M280C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM240C"
  },
  {
    "course_code": "EC ENGR 241A",
    "units": 4,
    "title": "Stochastic Processes",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 131A. Review of basic probability, axiomatic development, expectation, convergence of random processes: stationarity, power spectral density. Response of linear systems to random inputs. Basics of estimation. Special random processes, Markov processes, martingales, etc. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR241A"
  },
  {
    "course_code": "EC ENGR M242A",
    "units": 4,
    "title": "Nonlinear Dynamic Systems",
    "description": "(Same as Chemical Engineering M282A and Mechanical and Aerospace Engineering M272A.) Lecture, four hours; outside study, eight hours. Requisite: course M240A or Chemical Engineering M280A or Mechanical and Aerospace Engineering M270A. State-space techniques for studying solutions of time-invariant and time-varying nonlinear dynamic systems with emphasis on stability. Lyapunov theory (including converse theorems), invariance, center manifold theorem, input-to-state stability and small-gain theorem. Letter grading.",
    "prerequisites": [
      "EC ENGR M240A",
      "CH ENGR M280A",
      "MECH&AE M270A"
    ],
    "cross_listed": [
      "MECH&AE M272A",
      "CH ENGR M282A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM242A"
  },
  {
    "course_code": "EC ENGR C243A",
    "units": 4,
    "title": "Neural Signal Processing",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisites: course 131A, Mathematics 33A. Topics include fundamental properties of electrical activity in neurons; technology for measuring neural activity; spiking statistics and Poisson processes; generative models and classification; regression and Kalman filtering; principal components analysis, factor analysis, and expectation maximization. Concurrently scheduled with course C143A. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A",
      "MATH 33A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRC243A"
  },
  {
    "course_code": "EC ENGR 246",
    "units": 4,
    "title": "Foundations of Statistical Machine Learning",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Enforced requisites: course 131A, Mathematics 33A. Introduction to foundations of statistical machine learning. Overview of several widely used learning algorithms including logistic and linear regression, kernel methods and support vector machine (SVM), ensemble learning methods, decisions trees and nearest neighbor classifiers. Connections to information theory through probably approximately correct (PAC) learning, stability, bias-complexity trade-off, structural risk minimization, minimum description length (MDL), and universal learning. Introduction to representation learning with topics including unsupervised learning, clustering, (non-linear) dimensionality reduction, sketching, parametric distribution estimation including Gaussian mixtures, expectation maximization, non-parametric distribution estimation, property testing and neural networks focused on distribution sampling (variational autoencoders ÝVAEs¨, generative adversarial networks ÝGANs¨). Discussion of reinforcement learning. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A",
      "MATH 33A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR246"
  },
  {
    "course_code": "EC ENGR C247",
    "units": 4,
    "title": "Neural Networks and Deep Learning",
    "description": "Lecture, four hours; discussion, two hours; outside study, six hours. Requisites: courses 131A, 133A or 205A, and M146, or equivalent. Review of machine learning concepts; maximum likelihood; supervised classification; neural network architectures; backpropagation; regularization for training neural networks; optimization for training neural networks; convolutional neural networks; practical CNN architectures; deep learning libraries in Python; recurrent neural networks, backpropagation through time, long short-term memory and gated recurrent units; variational autoencoders; generative adversarial networks; adversarial examples and training. Concurrently scheduled with course C147. Letter grading.",
    "prerequisites": [
      "EC ENGR 131A",
      "EC ENGR 133A",
      "EC ENGR 205A",
      "EC ENGR M146"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRC247"
  },
  {
    "course_code": "EC ENGR M248S",
    "units": 2,
    "title": "Seminar: Systems, Dynamics, and Control Topics",
    "description": "(Same as Chemical Engineering M297 and Mechanical and Aerospace Engineering M299A.) Seminar, two hours; outside study, six hours. Limited to graduate engineering students. Presentations of research topics by leading academic researchers from fields of systems, dynamics, and control. Students who work in these fields present their papers and results. S/U grading.",
    "cross_listed": [
      "MECH&AE M299A",
      "CH ENGR M297"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM248S"
  },
  {
    "course_code": "EC ENGR M250B",
    "units": 4,
    "title": "Microelectromechanical Systems (MEMS) Fabrication",
    "description": "(Same as Bioengineering M250B and Mechanical and Aerospace Engineering M280B.) Lecture, three hours; discussion, one hour; outside study, eight hours. Enforced requisite: course M153. Advanced discussion of micromachining processes used to construct MEMS. Coverage of many lithographic, deposition, and etching processes, as well as their combination in process integration. Materials issues such as chemical resistance, corrosion, mechanical properties, and residual/intrinsic stress. Letter grading.",
    "prerequisites": [
      "EC ENGR M153"
    ],
    "cross_listed": [
      "BIOENGR M250B",
      "MECH&AE M280B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM250B"
  },
  {
    "course_code": "EC ENGR M252",
    "units": 4,
    "title": "Microelectromechanical Systems (MEMS) Device Physics and Design",
    "description": "(Same as Bioengineering M252 and Mechanical and Aerospace Engineering M282.) Lecture, four hours; discussion, one hour; outside study, seven hours. Introduction to MEMS design. Design methods, design rules, sensing and actuation mechanisms, microsensors, and microactuators. Designing MEMS to be produced with both foundry and nonfoundry processes. Computer-aided design for MEMS. Design project required. Letter grading.",
    "cross_listed": [
      "MECH&AE M282",
      "BIOENGR M252"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM252"
  },
  {
    "course_code": "EC ENGR M255",
    "units": 4,
    "title": "Neuroengineering",
    "description": "(Same as Bioengineering M260 and Neuroscience M206.) Lecture, four hours; laboratory, three hours; outside study, five hours. Requisites: Mathematics 32A, Physics 1B or 5C. Introduction to principles and technologies of bioelectricity and neural signal recording, processing, and stimulation. Topics include bioelectricity, electrophysiology (action potentials, local field potentials, EEG, ECOG), intracellular and extracellular recording, microelectrode technology, neural signal processing (neural signal frequency bands, filtering, spike detection, spike sorting, stimulation artifact removal), brain-computer interfaces, deep-brain stimulation, and prosthetics. Letter grading.",
    "prerequisites": [
      "MATH 32A",
      "PHYSICS 1B",
      "PHYSICS 5C"
    ],
    "cross_listed": [
      "BIOENGR M260",
      "NEURO M206"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM255"
  },
  {
    "course_code": "EC ENGR M256A",
    "units": 2,
    "title": "Evaluation of Research Literature in Neuroengineering",
    "description": "(Same as Bioengineering M261A and Neuroscience M212A.) Discussion, two hours; outside study, four hours. Critical discussion and analysis of current literature related to neuroengineering research. S/U grading.",
    "cross_listed": [
      "NEURO M212A",
      "BIOENGR M261A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM256A"
  },
  {
    "course_code": "EC ENGR M256B",
    "units": 2,
    "title": "Evaluation of Research Literature in Neuroengineering",
    "description": "(Same as Bioengineering M261B and Neuroscience M212B.) Discussion, two hours; outside study, four hours. Critical discussion and analysis of current literature related to neuroengineering research. S/U grading.",
    "cross_listed": [
      "NEURO M212B",
      "BIOENGR M261B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM256B"
  },
  {
    "course_code": "EC ENGR M256C",
    "units": 2,
    "title": "Evaluation of Research Literature in Neuroengineering",
    "description": "(Same as Bioengineering M261C and Neuroscience M212C.) Discussion, two hours; outside study, four hours. Critical discussion and analysis of current literature related to neuroengineering research. S/U grading.",
    "cross_listed": [
      "BIOENGR M261C",
      "NEURO M212C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM256C"
  },
  {
    "course_code": "EC ENGR M257",
    "units": 4,
    "title": "Nanoscience and Technology",
    "description": "(Same as Mechanical and Aerospace Engineering M287.) Lecture, four hours; outside study, eight hours. Introduction to fundamentals of nanoscale science and technology. Basic physical principles, quantum mechanics, chemical bonding and nanostructures, top-down and bottom-up (self-assembly) nanofabrication; nanocharacterization; nanomaterials, nanoelectronics, and nanobiodetection technology. Introduction to new knowledge and techniques in nano areas to understand scientific principles behind nanotechnology and inspire students to create new ideas in multidisciplinary nano areas. Letter grading.",
    "cross_listed": [
      "MECH&AE M287"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM257"
  },
  {
    "course_code": "EC ENGR 260A",
    "units": 4,
    "title": "Advanced Engineering Electrodynamics",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisites: courses 101B, 162A. Advanced treatment of concepts in electrodynamics and their applications to modern engineering problems. Vector calculus in generalized coordinate system. Solutions of wave equation and special functions. Reflection, transmission, and polarization. Vector potential, duality, reciprocity, and equivalence theorems. Scattering from cylinder, half-plane, wedge, and sphere, including radar cross-section characterization. Green’s functions in electromagnetics and dyadic calculus. Letter grading.",
    "prerequisites": [
      "EC ENGR 101B",
      "EC ENGR 162A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR260A"
  },
  {
    "course_code": "EC ENGR 260B",
    "units": 4,
    "title": "Advanced Engineering Electrodynamics",
    "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 101B, 162A, 260A. Advanced treatment of concepts and numerical techniques in electrodynamics and their applications to modern engineering problems. Differential geometry of curves and surfaces. Geometrical optics and geometrical theory of diffraction. Physical optics techniques. Asymptotic techniques and uniform theories. Integral equations in electromagnetics. Numerical techniques based on method of moments. Letter grading.",
    "prerequisites": [
      "EC ENGR 101B",
      "EC ENGR 162A",
      "EC ENGR 260A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR260B"
  },
  {
    "course_code": "EC ENGR 261",
    "units": 4,
    "title": "Microwave and Millimeter Wave Circuits",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 163A. Rectangular and circular waveguides, microstrip, stripline, finline, and dielectric waveguide distributed circuits, with applications in microwave and millimeter wave integrated circuits. Substrate materials, surface wave phenomena. Analytical methods for discontinuity effects. Design of passive microwave and millimeter wave circuits. Letter grading.",
    "prerequisites": [
      "EC ENGR 163A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR261"
  },
  {
    "course_code": "EC ENGR 262",
    "units": 4,
    "title": "Antenna Theory and Design",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 162A. Antenna patterns. Sum and difference patterns. Optimum designs for rectangular and circular apertures. Arbitrary side lobe topography. Discrete arrays. Mutual coupling. Design of feeding networks. Letter grading.",
    "prerequisites": [
      "EC ENGR 162A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR262"
  },
  {
    "course_code": "EC ENGR 263",
    "units": 4,
    "title": "Reflector Antennas Synthesis, Analysis, and Measurement",
    "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 260A, 260B. Reflector pattern analysis techniques. Single and multireflector antenna configurations. Reflector synthesis techniques. Reflector feeds. Reflector tolerance studies, including systematic and random errors. Array-fed reflector antennas. Near-field measurement techniques. Compact range concepts. Microwave diagnostic techniques. Modern satellite and ground antenna applications. Letter grading.",
    "prerequisites": [
      "EC ENGR 260A",
      "EC ENGR 260B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR263"
  },
  {
    "course_code": "EC ENGR 266",
    "units": 4,
    "title": "Computational Methods for Electromagnetics",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisites: courses 162A, 163A. Computational techniques for partial differential and integral equations: finite-difference, finite-element, method of moments. Applications include transmission lines, resonators, integrated circuits, solid-state device modeling, electromagnetic scattering, and antennas. Letter grading.",
    "prerequisites": [
      "EC ENGR 162A",
      "EC ENGR 163A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR266"
  },
  {
    "course_code": "EC ENGR 270",
    "units": 4,
    "title": "Applied Quantum Mechanics",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Preparation: modern physics (or course 123A), linear algebra, and ordinary differential equations courses. Principles of quantum mechanics for applications in lasers, solid-state physics, and nonlinear optics. Topics include eigenfunction expansions, observables, Schrödinger equation, uncertainty principle, central force problems, Hilbert spaces, WKB approximation, matrix mechanics, density matrix formalism, and radiation theory. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR270"
  },
  {
    "course_code": "EC ENGR 271",
    "units": 4,
    "title": "Classical Laser Theory",
    "description": "Lecture, four hours; outside study, eight hours. Enforced requisite: course 170A. Microscopic and macroscopic laser phenomena and propagation of optical pulses using classical formalism. Letter grading.",
    "prerequisites": [
      "EC ENGR 170A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR271"
  },
  {
    "course_code": "EC ENGR 272",
    "units": 4,
    "title": "Dynamics of Lasers",
    "description": "Lecture, four hours; outside study, eight hours. Requisite: course 271. Ultrashort laser pulse characteristics, generation, and measurement. Gain switching, Q switching, cavity dumping, active and passive mode locking. Pulse compression and soliton pulse formation. Nonlinear pulse generation: soliton laser, additive-pulse mode locking, and parametric oscillators. Pulse measurement techniques. Letter grading.",
    "prerequisites": [
      "EC ENGR 271"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR272"
  },
  {
    "course_code": "EC ENGR 273",
    "units": 4,
    "title": "Nonlinear Photonics",
    "description": "Lecture, four hours; discussion, one hour; outside study, seven hours. Requisite: course 170A. Recommended: course 271. Nonlinear optical susceptibilities. Coupled-wave and coupled-mode theories. Crystal optics, electro-optics, and magneto-optics. Nonlinear optical interactions, sum- and difference-frequency generation, harmonic and parametric generation, stimulated Raman and Brillouin scattering, field-induced index changes and self-phase modulation. Nonlinear photonic devices. Nonlinear guided-wave photonics and devices. Letter grading.",
    "prerequisites": [
      "EC ENGR 170A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR273"
  },
  {
    "course_code": "EC ENGR 274",
    "units": 4,
    "title": "Optical Communication and Sensing Design",
    "description": "Lecture, three hours; outside study, nine hours. Requisites: courses 170A and 170B or equivalent. Top-down introduction to physical layer design in fiber optic communication systems, including Telecom, Datacom, and CATV. Fundamentals of digital and analog optical communication systems, fiber transmission characteristics, and optical modulation techniques, including direct and external modulation and computer-aided design. Architectural-level design of fiber optic transceiver circuits, including preamplifier, quantizer, clock and data recovery, laser driver, and predistortion circuits. Letter grading.",
    "prerequisites": [
      "EC ENGR 170A",
      "EC ENGR 170B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR274"
  },
  {
    "course_code": "EC ENGR M275",
    "units": 4,
    "title": "Micro- and Nanoscale Biosensing for Molecular Diagnostics",
    "description": "(Same as Bioengineering M273.) Lecture, four hours; discussion, one hour; outside study, seven hours. Covers state-of-art and emerging biosensors in context of molecular diagnostics. Students learn relevant biology and biochemistry pertinent to molecular diagnostics. Students gain thorough understanding of interfaces between bioparticles, biofluids, and electronics. Topics include biosensor performance parameters, modes of detection, sample preparation challenges, microfluidics, and emerging wearable biosensing platforms, as well as proteomics, genomics, and DNA sequencing technologies. Letter grading.",
    "cross_listed": [
      "BIOENGR M273"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM275"
  },
  {
    "course_code": "EC ENGR 279AS",
    "units": 4,
    "title": "Special Topics in Physical and Wave Electronics",
    "description": "Lecture, four hours; discussion, on hour; outside study, seven hours. Special topics in one or more aspects of physical and wave electronics, such as electromagnetics, microwave and millimeter wave circuits, photonics and optoelectronics, plasma electronics, microelectromechanical systems, solid state, and nanotechnology. May be repeated for credit with topic change. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR279AS"
  },
  {
    "course_code": "EC ENGR 279BS",
    "units": 2,
    "title": "Seminar: Physical and Wave Electronics",
    "description": "Seminar, two to four hours; outside study, four to eight hours. Seminars and discussions on current and advanced topics in one or more aspects of physical and wave electronics, such as electromagnetics, microwave and millimeter wave circuits, photonics and optoelectronics, plasma electronics, microelectromechanical systems, solid state, and nanotechnology. May be repeated for credit with topic change. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR279BS"
  },
  {
    "course_code": "EC ENGR 279CS",
    "units": 1,
    "title": "Clean Green IGERT Brown-Bag Seminar",
    "description": "Seminar, one hour. Required of students in Clean Energy for Green Industry (IGERT) Research. Literature seminar presented by graduate students and experts from around country who conduct research in energy harvest, storage, and conservation. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR279CS"
  },
  {
    "course_code": "EC ENGR CM282",
    "units": 4,
    "title": "Science, Technology, and Public Policy",
    "description": "(Same as Public Policy CM282.) Lecture, three hours. Recent and continuing advances in science and technology are raising profoundly important public policy issues. Consideration of selection of critical policy issues, each of which has substantial ethical, social, economic, political, scientific, and technological aspects. Concurrently scheduled with course CM182. Letter grading.",
    "cross_listed": [
      "PUB PLC CM282"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRCM282"
  },
  {
    "course_code": "EC ENGR 285A",
    "units": 4,
    "title": "Plasma Waves and Instabilities",
    "description": "Lecture, four hours; outside study, eight hours. Requisites: courses 101A, and M185 or Physics M122. Wave phenomena in plasmas described by macroscopic fluid equations. Microwave propagation, plasma oscillations, ion acoustic waves, cyclotron waves, hydromagnetic waves, drift waves. Rayleigh/Taylor, Kelvin/Helmholtz, universal, and streaming instabilities. Application to experiments in fully and partially ionized gases. Letter grading.",
    "prerequisites": [
      "EC ENGR 101A",
      "EC ENGR M185",
      "PHYSICS M122"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR285A"
  },
  {
    "course_code": "EC ENGR 285B",
    "units": 4,
    "title": "Advanced Plasma Waves and Instabilities",
    "description": "Lecture, four hours; outside study, eight hours. Requisites: courses M185, and 285A or Physics 222A. Interaction of intense electromagnetic waves with plasmas: waves in inhomogeneous and bounded plasmas, nonlinear wave coupling and damping, parametric instabilities, anomalous resistivity, shock waves, echoes, laser heating. Emphasis on experimental considerations and techniques. Letter grading.",
    "prerequisites": [
      "EC ENGR M185",
      "EC ENGR 285A",
      "PHYSICS 222A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR285B"
  },
  {
    "course_code": "EC ENGR M287",
    "units": 4,
    "title": "Fusion Plasma Physics and Analysis",
    "description": "(Same as Mechanical and Aerospace Engineering M237B.) Lecture, four hours; outside study, eight hours. Fundamentals of plasmas at thermonuclear burning conditions. Fokker/Planck equation and applications to heating by neutral beams, RF, and fusion reaction products. Bremsstrahlung, synchrotron, and atomic radiation processes. Plasma surface interactions. Fluid description of burning plasma. Dynamics, stability, and control. Applications in tokamaks, tandem mirrors, and alternate concepts. Letter grading.",
    "cross_listed": [
      "MECH&AE M237B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM287"
  },
  {
    "course_code": "EC ENGR M293",
    "units": 2,
    "title": "Intellectual Property for Technology Entrepreneurs and Managers",
    "description": "(Same as Management M247.) Seminar, two hours; outside study, four hours. Introduction to intellectual property (IP) in context of technology products and markets. Topics include best practices to put in place before product development starts, how to develop high-value patent portfolios, patent licensing, offensive and defensive IP litigation considerations, trade secrets, opportunities and pitfalls of open source software, trademarks, managing copyright in increasingly complex content ecosystems, and adopting IP strategies to globalized marketplaces. Includes case studies inspired by complex IP questions facing technology companies today. S/U or letter grading.",
    "cross_listed": [
      "MGMT M247"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM293"
  },
  {
    "course_code": "EC ENGR 295",
    "units": 3,
    "title": "Academic Technical Writing for Electrical Engineers",
    "description": "Seminar, three hours. Designed for electrical engineering PhD students who have completed preliminary examinations. Students read models of good writing and learn to make rhetorical observations and writing decisions, improve their academic and technical writing skills by writing and revising conference and journal papers, and practice writing for and speaking to various audiences, including potential students, engineers outside their specific fields, and nonengineers (colleagues outside field, policymakers, etc.). Students write in variety of genres, all related to their professional development as electrical engineers. Emphasis on writing as vital way to communicate precise technical and professional information in distinct contexts, directly resulting in specific outcomes. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR295"
  },
  {
    "course_code": "EC ENGR 296",
    "units": 2,
    "title": "Seminar: Research Topics in Electrical Engineering",
    "description": "Seminar, two hours; outside study, four hours. Advanced study and analysis of current topics in electrical engineering. Discussion of current research and literature in research specialty of faculty member teaching course. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR296"
  },
  {
    "course_code": "EC ENGR 297",
    "units": 1,
    "title": "Seminar Series: Electrical Engineering",
    "description": "Seminar, 90 minutes; outside study, 90 minutes. Limited to graduate electrical engineering students. Weekly seminars and discussion by invited speakers on research topics of heightened interest. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR297"
  },
  {
    "course_code": "EC ENGR 298",
    "units": 2,
    "title": "Seminar: Engineering",
    "description": "Seminar, to be arranged. Limited to graduate electrical engineering students. Seminars may be organized in advanced technical fields. If appropriate, field trips may be arranged. May be repeated with topic change. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR298"
  },
  {
    "course_code": "EC ENGR 299",
    "units": 4,
    "title": "MS Project Seminar",
    "description": "Seminar, to be arranged. Required of all MS students not in thesis option. Supervised research in small groups or individually under guidance of faculty mentor. Regular meetings, culminating report, and presentation required. Individual contract required; enrollment petitions available in Office of Graduate Student Affairs. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR299"
  },
  {
    "course_code": "EC ENGR M495",
    "units": 2,
    "title": "Teaching Preparation Seminar: Teaching and Writing Pedagogies for Electrical Engineers",
    "description": "(Same as English Composition M495K). Seminar, two hours. Limited to graduate electrical engineering students. Required of all departmental teaching assistants (TAs). May be taken concurrently while holding a TA appointment. Seminar on pedagogy and logistics of being a TA with emphasis on student-centered teaching, clear communication, and multimodal teaching and learning. S/U grading.",
    "cross_listed": [
      "ENGCOMP M495K"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGRM495"
  },
  {
    "course_code": "EC ENGR 596",
    "units": 2,
    "title": "Directed Individual or Tutorial Studies",
    "description": "Tutorial, to be arranged. Limited to graduate electrical engineering students. Petition forms to request enrollment may be obtained from assistant dean, Graduate Studies. Supervised investigation of advanced technical problems. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR596"
  },
  {
    "course_code": "EC ENGR 597A",
    "units": 2,
    "title": "Preparation for MS Comprehensive Examination",
    "description": "Tutorial, to be arranged. Limited to graduate electrical engineering students. Reading and preparation for MS comprehensive examination. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR597A"
  },
  {
    "course_code": "EC ENGR 597B",
    "units": 2,
    "title": "Preparation for PhD Preliminary Examinations",
    "description": "Tutorial, to be arranged. Limited to graduate electrical engineering students. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR597B"
  },
  {
    "course_code": "EC ENGR 597C",
    "units": 2,
    "title": "Preparation for PhD Oral Qualifying Examination",
    "description": "Tutorial, to be arranged. Limited to graduate electrical engineering students. Preparation for oral qualifying examination, including preliminary research on dissertation. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR597C"
  },
  {
    "course_code": "EC ENGR 598",
    "units": 2,
    "title": "Research for and Preparation of MS Thesis",
    "description": "Tutorial, to be arranged. Limited to graduate electrical engineering students. Supervised independent research for MS candidates, including thesis prospectus. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR598"
  },
  {
    "course_code": "EC ENGR 599",
    "units": 2,
    "title": "Research for and Preparation of PhD Dissertation",
    "description": "Tutorial, to be arranged. Limited to graduate electrical engineering students. Usually taken after students have been advanced to candidacy. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECENGR599"
  }
]