[
  {
    "course_code": "ECON 1",
    "units": 4,
    "title": "Principles of Economics",
    "description": "Lecture, three hours; discussion, one hour. Introduction to principles of economic analysis, economic institutions, and issues of economic policy. Emphasis on allocation of resources and distribution of income through price system. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON1"
  },
  {
    "course_code": "ECON 2",
    "units": 4,
    "title": "Principles of Economics",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 1. Introduction to principles of economic analysis, economic institutions, and issues of economic policy. Emphasis on aggregative economics, including national income, monetary and fiscal policy, and international trade. P/NP or letter grading.",
    "prerequisites": [
      "ECON 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON2"
  },
  {
    "course_code": "ECON 3A",
    "units": 2,
    "title": "Introduction to Investments",
    "description": "Lecture, two hours. Broad introduction to investments. No previous financial, economic, or math background needed. Students learn organizing framework with which to understand investing landscape with highlight on key concepts and functionality related to business and personal investments. Topics include why financial markets exist and how they work, efficient market hypothesis, risk versus reward, investment styles, valuation techniques, simple quantitative analysis, power of compound interest, financial crises, and role private equity, venture capital, innovation and start-ups, and personal financial advisers. Serves as excellent introduction to career paths in finance and for those who want to increase their financial literacy. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON3A"
  },
  {
    "course_code": "ECON 3B",
    "units": 2,
    "title": "Introduction to Investments",
    "description": "Lecture, two hours. Requisite: course 3A. Broad introduction to investments. No previous financial, economic, or math background needed. Students learn organizing framework with which to understand investing landscape with highlight on key concepts and functionality related to business and personal investments. Topics include exchange rates, central banks, financial statements, value creation, interpreting financial ratios, power of compound interest and understanding present value, diversification, capital asset pricing model, Sharpe ratio, and understanding asset’s beta, hedge funds. Serves as excellent introduction to career paths in finance and for those who want to increase their financial literacy. P/NP grading.",
    "prerequisites": [
      "ECON 3A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON3B"
  },
  {
    "course_code": "ECON 4",
    "units": 4,
    "title": "Introduction to Investments",
    "description": "Lecture, two hours. Broad introduction to investments. No previous financial, economic, or math background needed. Students learn organizing framework with which to understand investing landscape with highlight on key concepts and functionality related to business and personal investments. Topics include why financial markets exist and how they work, efficient market hypothesis, risk versus reward, investment styles, valuation techniques, simple quantitative analysis, power of compound interest, financial crises, and role private equity, venture capital, innovation and start-ups, personal financial advisers, exchange rates, central banks, financial statements, value creation, interpreting financial ratios, understanding present value, diversification, capital asset pricing model, Sharpe ratio, and understanding asset’s beta, hedge funds. Serves as excellent introduction to career paths in finance and for those who want to increase their financial literacy. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON4"
  },
  {
    "course_code": "ECON 5",
    "units": 5,
    "title": "Economics for Everyone",
    "description": "Lecture, three hours; discussion, one hour. Introduction to models and tools used by economists in practical real-world context. Study of important topical issues such as inequality, health care, and environmental policies. Students learn about available data sources and become better equipped to understand current events. May not be used to fulfill entrance requirements for any Economics Department major. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON5"
  },
  {
    "course_code": "ECON 122",
    "units": 4,
    "title": "International Finance",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 102. Enforced corequisite: course 122L. Not open to students with credit for former course 120. Emphasis on interpretation of balance of payments and adjustment to national and international equilibria through changes in price levels, exchange rates, and national income. Other topics include making international payments, determination of exchange rates under various monetary standards, capital movements, exchange controls, and international monetary organization. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "corequisites": [
      "ECON 122L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON10P"
  },
  {
    "course_code": "ECON 10R",
    "units": 4,
    "title": "Economics Toolkit: Introduction to R for Economists",
    "description": "Lecture, three hours. Hands-on introduction to data analysis in economics using R. Covers essential mathematical tools and introduces mechanics of R. No prior knowledge of R, computer programming, statistics, or economics is required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON10R"
  },
  {
    "course_code": "ECON 11",
    "units": 4,
    "title": "Microeconomic Theory",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisites: course 1, Mathematics 31B, with grades of C or better. Laws of demand, supply, returns, and costs; price and output determination in different market situations. P/NP or letter grading.",
    "prerequisites": [
      "ECON 1",
      "MATH 31B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON11"
  },
  {
    "course_code": "ECON 12",
    "units": 4,
    "title": "Introduction to Personal Finance",
    "description": "Lecture, three hours; discussion, one hour. Introduction to personal finance. No previous financial, economic, or mathematics background required. Open to nonmajors. Covers wide array of topics at introductory level that are of interest to students on practical level and more broadly for students seeking to deepen their understanding of key features of financial system, financial institutions, and various aspects of personal finance encountered by typical household over their life cycle. Topics covered include interest rates, time value of money, types of loans most relevant to typical household, credit and debit cards, savings and investment, stocks and bonds, risk and diversification, personal income taxes, varieties of insurance, retirement and savings plans, macroeconomic concepts, social security, Medicare, and aspects of behavioral economics. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON12"
  },
  {
    "course_code": "ECON 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON19"
  },
  {
    "course_code": "ECON 41",
    "units": 4,
    "title": "Probability and Statistics for Economists",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisites: Mathematics 31A, 31B, with grades of C or better. Not open to students with credit for former Statistics 11. Introduction to theory and practice of mathematical statistics with emphasis on its use in economics. Introduction of basic statistical concepts such as random variables, probability distributions, estimation, confidence intervals, and hypothesis testing. Letter grading.",
    "prerequisites": [
      "MATH 31A",
      "MATH 31B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON41"
  },
  {
    "course_code": "ECON 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON89"
  },
  {
    "course_code": "ECON 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON89HC"
  },
  {
    "course_code": "ECON 97",
    "units": 4,
    "title": "Economic Toolkit",
    "description": "Lecture, three hours. Coverage of essential mathematical and programming skills needed for study of Economics. Review of calculus (first derivatives, partial derivatives, elementary integral calculus), Excel (handling data, using simple arithmetical, mathematical, and financial functions, use of Solver), and extended introduction to statistical language R and/or Stata. Consult instructor for specific software. Offered in summer only. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON97"
  },
  {
    "course_code": "ECON 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON99"
  },
  {
    "course_code": "ECON 101",
    "units": 4,
    "title": "Microeconomic Theory",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 11. Theory of factor pricing and income distribution, general equilibrium, implications of pricing process for optimum allocation of resources, game theory, and interest and capital. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON101"
  },
  {
    "course_code": "ECON 102",
    "units": 4,
    "title": "Macroeconomic Theory",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 2, 101. Theory of income, employment, and price level. Analysis of secular growth and business fluctuations; introduction to monetary and fiscal policy. P/NP or letter grading.",
    "prerequisites": [
      "ECON 2",
      "ECON 101"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON102"
  },
  {
    "course_code": "ECON 103",
    "units": 4,
    "title": "Introduction to Econometrics",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisites: courses 11, and 41 or Mathematics 170A and 170B or 170E and 170S or Statistics 100A and 100B. Enforced corequisite: 103L. Introduction to theory and practice of univariate regression analysis with emphasis on its use in economics. Introduction to method of least squares, Gauss-Markov theorem, confidence intervals and hypothesis tests in univariate regression context, and standard errors in case of heteroscedasticity and serial correlation. Emphasis on applications with real data and computer software (R programming language) to implement discussed methods. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 41",
      "MATH 170A",
      "MATH 170B",
      "MATH 170E",
      "MATH 170S",
      "STATS 100A",
      "STATS 100B"
    ],
    "corequisites": [
      "ECON 103L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON103"
  },
  {
    "course_code": "ECON 103L",
    "units": 1,
    "title": "Econometrics Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Enforced requisites: courses 11, and 41 or Mathematics 170A and 170B or 170E and 170S or Statistics 100A and 100B. Enforced corequisite: 103. Econometric analysis of case-based studies. Hands-on data collection and problem solving. Use of econometric software. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 41",
      "MATH 170A",
      "MATH 170B",
      "MATH 170E",
      "MATH 170S",
      "STATS 100A",
      "STATS 100B"
    ],
    "corequisites": [
      "ECON 103"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON103L"
  },
  {
    "course_code": "ECON 104",
    "units": 4,
    "title": "Data Science for Economists",
    "description": "Lecture, three hours; laboratory, one hour. Enforced requisites: courses 11, 103. Enforced corequisite: course 104L. In-depth discussion of multivariate regression. Introduction to estimation of multivariate regression, and confidence intervals and hypothesis tests in context of multivariate regression. Discussion of instrumental variables and binary choice models. Emphasis on hands-on experience on data analytics and real data applications. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 104L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON104"
  },
  {
    "course_code": "ECON 104L",
    "units": 1,
    "title": "Data Science for Economists Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Enforced requisites: courses 11, 103. Enforced corequisite: course 104. Econometric analysis of case-based studies. Hands-on data collection and problem solving. Use of econometric software. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 104"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON104L"
  },
  {
    "course_code": "ECON 106A",
    "units": 4,
    "title": "Economics in Practice",
    "description": "Seminar, three hours. Enforced requisites: courses 11, 101, 102. Enforced corequisite: course 106AL. Students, in groups of four, address three small problems and one large and more complex problem. Discussion of student-proposed solutions to problems in their groups, with small-group discussions to student presentations of results in class. Detailed coaching and feedback by MBA students on student analysis and presentations. Final written and oral presentations required. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "corequisites": [
      "ECON 106AL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106A"
  },
  {
    "course_code": "ECON 106AL",
    "units": 1,
    "title": "Economics in Practice Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisites: courses 11, 101, 102. Enforced corequisite: course 106A. Case-based analysis requiring students to apply material from course 106A to real-world problems regarding issues such as economic theory and empirical methods. Hands-on data collection and problem solving and presentation of student analyses both orally and in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "corequisites": [
      "ECON 106A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106AL"
  },
  {
    "course_code": "ECON 106D",
    "units": 4,
    "title": "Designed Markets",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 11, 101. Enforced corequisite: course 106DL. Discussion of markets and other institutions that were purposefully designed, mostly by economists. Choices designers face when designing such markets. Markets and their context and corresponding economic models. Topics include matching between medical residents and hospitals, matching between high school students and New York and Boston high schools, kidney transplants, course allocation in business schools, eBay auctions, and prediction markets. Examination of how to optimize one’s actions and outcomes in such markets. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106DL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106D"
  },
  {
    "course_code": "ECON 106DL",
    "units": 1,
    "title": "Designed Markets Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisites: courses 11, 101. Enforced corequisite: course 106D. Case-based analysis requiring students to apply material from course 106D to real-world problems regarding topics such as matching between medical residents and hospitals, matching between high school students and New York and Boston high schools, kidney transplants, course allocation in business schools, eBay auctions, and prediction markets. Hands-on data collection and problem solving and presentation of student analyses both orally and in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106DL"
  },
  {
    "course_code": "ECON 106E",
    "units": 4,
    "title": "Economics of Entrepreneurship",
    "description": "Lecture, three hours. Requisite: course 101. Enforced corequisite: course 106EL. Enrollment priority to Business Economics majors. Application of economic theory to practice of managing new businesses—combining elements of strategy, marketing, and entrepreneurial finance courses. Examination of both strategic decisions of entrepreneurs (pricing, advertising, deterring entry) and more practical issues (funding, business plans, patents). Letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106EL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106E"
  },
  {
    "course_code": "ECON 106EL",
    "units": 1,
    "title": "Economics of Entrepreneurship Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisite: course 101. Enforced corequisite: course 106E. Case-based analysis requiring students to apply material from course 106E to real-world problems regarding topics involving combining elements of strategy, marketing, and entrepreneurial finance courses. Examination of both strategic decisions of entrepreneurs (pricing, advertising, deterring entry) and more practical issues (funding, business plans, patents). Hands-on data collection and problem solving and presentation of student analyses both orally and in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106EL"
  },
  {
    "course_code": "ECON 106F",
    "units": 4,
    "title": "Finance",
    "description": "Lecture, three hours. Requisite: course 102. Enforced corequisite: course 106FB. Not open for credit to students with credit for Management 130A. Only one course from Economics 106F and Management 130A may be applied toward Economics and Business Economics majors. Enrollment priority to Business Economics majors. Introduction to principles of asset valuation and role of financial markets in market economy. Basic topics include time value of money, discounted cash flow analysis, CAPM model, and applications to public policy. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "corequisites": [
      "ECON 106FB"
    ],
    "credit_exclusions": [
      "MGMT 130A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106F"
  },
  {
    "course_code": "ECON 106FB",
    "units": 1,
    "title": "Finance Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisite: course 102. Enforced corequisite: course 106F. Case-based analysis requiring students to apply theory from course 106F to real-world problems regarding topics such as discounted cash flow analysis, CAPM model, applications to public policy, and more. Hands-on data collection and problem solving and presentation of student analyses both orally and in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "corequisites": [
      "ECON 106F"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106FB"
  },
  {
    "course_code": "ECON 106G",
    "units": 4,
    "title": "Introduction to Game Theory",
    "description": "Lecture, three hours; discussion, one to two hours (when scheduled). Requisite: course 101. Enforced corequisite: course 106GL. Enrollment priority to Business Economics majors. Introduction to basic ideas of game theory and strategic thinking. Discussion of ideas such as dominance, backward induction, Nash equilibrium, commitment, credibility, asymmetric information, and signaling, with application to examples from economics, politics, business, and other real-life situations. Letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106GL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106G"
  },
  {
    "course_code": "ECON 106GL",
    "units": 1,
    "title": "Introduction to Game Theory Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisite: course 101. Enforced corequisite: course 106G. Case-based analysis requiring students to apply material from course 106G to real-world problems involving game theory and strategic thinking in economics, politics, business, and other real-life situations. Hands-on data collection and problem solving and presentation of student analyses in writing with possible oral presentations. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106G"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106GL"
  },
  {
    "course_code": "ECON 106I",
    "units": 4,
    "title": "Organization of Firms",
    "description": "Lecture, three hours. Enforced requisites: courses 11, 101. Enforced corequisite: course 106IL. Enrollment priority to Business Economics majors. Role of firms in traditional economic theory and modern developments in theory of firms. Topics include relationship between employer and employee, principal-agent models and moral hazard, formal versus relational contracts, successful firms as coherent systems of mutually supporting parts, property rights and asset ownership, boundaries of firms, employment versus independent contracting, internal organization of firms, role and levels of firm hierarchy. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106IL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106I"
  },
  {
    "course_code": "ECON 106IL",
    "units": 1,
    "title": "Organization of Firms Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Enforced requisites: courses 11, 101. Enforced corequisite: course 106I. Case-based analysis requiring students to apply material from course 106I to real-world problems. Hands-on data collection and problem solving and presentation of student analyses in writing and with oral presentations. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106I"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106IL"
  },
  {
    "course_code": "ECON 106M",
    "units": 4,
    "title": "Financial Markets and Financial Institutions",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 11, 101, 102. Enforced corequisite: course 106ML. Application of analytical tools of economics and finance to real-world problems in financial markets to link models students have learned in prior courses to patterns observed in financial markets and to understand when it is that further theoretical refinements are required to better account for certain observed patterns. Development of understanding of potential effects of monetary and regulatory policies on financial markets. Topics include bond market, stock market, foreign exchange market, financial crises, and financial regulation. Analysis and discussion of lessons of subprime crisis and European sovereign debt crisis. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "corequisites": [
      "ECON 106ML"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106M"
  },
  {
    "course_code": "ECON 106ML",
    "units": 1,
    "title": "Financial Markets and Financial Institutions Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisites: courses 11, 101, 102. Enforced corequisite: course 106M. Case-based analysis requiring students to apply material from course 106M to real-world problems involving financial markets and financial institutions. Issues include potential effects of monetary and regulatory policies on financial markets. Topics include bond market, stock market, foreign exchange market, financial crises, and financial regulation. Hands-on data collection and problem solving and presentation of student analyses both orally and in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "corequisites": [
      "ECON 106M"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106ML"
  },
  {
    "course_code": "ECON 106P",
    "units": 4,
    "title": "Pricing and Strategy",
    "description": "Lecture, three hours. Requisite: course 101. Enforced corequisite: course 106PL. Enrollment priority to Business Economics majors. Advanced pricing topics typically include linear programming and shadow pricing, peak load pricing, two-part pricing, strategic pricing, and auctions and bidding. Letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106PL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106P"
  },
  {
    "course_code": "ECON 106PL",
    "units": 1,
    "title": "Pricing and Strategy Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisite: course 101. Enforced corequisite: course 106P. Case-based analysis requiring students to apply material from course 106P to real-world problems involving linear programming and shadow pricing, peak load pricing, two-part pricing, strategic pricing, and auctions and bidding. Hands-on data collection and problem solving and presentation of student analyses in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106P"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106PL"
  },
  {
    "course_code": "ECON 106S",
    "units": 4,
    "title": "Competitive Strategy",
    "description": "Lecture, three hours. Enforced requisites: courses 11, 101. Enforced corequisite: course 106SL. Examination of competitive strategy and competitive advantage using game theoretic models and case studies. Topics include economics of scale, network effects, switching costs, and platform markets. Written final project and presentation required. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106SL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106S"
  },
  {
    "course_code": "ECON 106SL",
    "units": 1,
    "title": "Competitive Strategy Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Enforced requisites: courses 11, 101. Enforced corequisite: course 106S. Case-based analysis requiring students to apply material from course 106S. Hands-on data collection and problem solving and presentation of student analyses in writing and with oral presentations. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106SL"
  },
  {
    "course_code": "ECON 106T",
    "units": 4,
    "title": "Economics of Technology and E-Commerce",
    "description": "Lecture, three hours. Requisites: courses 11, 101. Enforced corequisite: course 106TL. Use of rigorous economic tools to analyze world of technology and e-commerce. Examination of economic theory, empirical analysis, and case studies to study variety of new markets. Topics include bidding in online auctions, two-sided markets, matching markets, and reputation mechanisms. Written case on one particular firm and presentation required. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106TL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106T"
  },
  {
    "course_code": "ECON 106TL",
    "units": 1,
    "title": "Economics of Technology and E-Commerce Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisites: courses 11, 101. Enforced corequisite: course 106T. Case-based analysis requiring students to apply theory from course 106T to real-world problems regarding issues such as bidding in online auctions, two-sided markets, matching markets, reputation mechanisms, and more. Hands-on data collection and problem solving and presentation of student analyses both orally and in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "corequisites": [
      "ECON 106T"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106TL"
  },
  {
    "course_code": "ECON 106V",
    "units": 4,
    "title": "Investments",
    "description": "Lecture, three hours. Requisite: course 102. Recommended: course 106F. Enforced corequisite: course 106VL. Enrollment priority to Business Economics majors. Introduction to principles investment and portfolio theory. Topics include optimal portfolio construction, fixed income analysis, option pricing theory, and active portfolio management. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "corequisites": [
      "ECON 106VL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106V"
  },
  {
    "course_code": "ECON 106VL",
    "units": 1,
    "title": "Investments Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisite: course 102. Recommended: course 106F. Enforced corequisite: course 106V. Case-based analysis requiring students to apply theory from course 106V to real-world problems regarding issues such as portfolio management, option pricing, and other investment topics. Hands-on data collection and problem solving and presentation of student analyses both orally and in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "corequisites": [
      "ECON 106V"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON106VL"
  },
  {
    "course_code": "ECON 107",
    "units": 4,
    "title": "History of Economic Theory",
    "description": "Lecture, three hours. Enforced requisites: courses 11, 101, 102. Survey of economic analysis from Grecian antiquity to early 20th century, concentrating on 18th and 19th centuries; special attention to selected writers, including Aristotle, mercantilists, Physiocrats, Hume, Smith, Malthus, Ricardo, Marx, marginalists, and Marshall. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON107"
  },
  {
    "course_code": "ECON 111",
    "units": 4,
    "title": "Theories of Development",
    "description": "Lecture, three hours. Requisites: courses 11, 101, 103. Corequisite: course 111L. Application of theoretical and empirical tools from microeconomics to provide insights into problems confronting low-income countries today and to evaluate policies that are likely to be effective in improving well-being of poorest on globe. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 111L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON111"
  },
  {
    "course_code": "ECON 111L",
    "units": 1,
    "title": "Theories of Development Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisites: courses 11, 101, 103. Corequisite: course 111. Case-based analysis requiring students to apply material from course 111 to real-world problems involving development. Topics and analysis include measures of development, sources of economic growth and development, impediments to development, and policy prescriptions. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 111"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON111L"
  },
  {
    "course_code": "ECON 112",
    "units": 4,
    "title": "Policies for Economic Development",
    "description": "Lecture, three hours. Requisite: course 102 or 111. Suggested strategies for economic development: inflation, balanced growth, industry versus agriculture, import substitution, export-oriented expansion, foreign aid, and others. Selected case studies. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102",
      "ECON 111"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON112"
  },
  {
    "course_code": "ECON M112A",
    "units": 4,
    "title": "International Development",
    "description": "(Same as Public Policy CM171.) Lecture, three hours. Requisite: course 102 or 111. Why are some countries rich, while other countries are poor? What can policymakers do to reduce poverty? Discussion of current research on these questions. Study of both methodologies used to answer questions in development economics, like natural experiments and randomized control trials, as well as relationship between development and institutions, education, growth, culture, and gender. Reading intensive, seminar-style course. Students are expected to read academic articles in economics and actively participate in discussions. Students also learn how to use data to evaluate policies. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102",
      "ECON 111"
    ],
    "cross_listed": [
      "PUB PLC CM171"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONM112A"
  },
  {
    "course_code": "ECON 113",
    "units": 4,
    "title": "Globalization and Gender",
    "description": "Lecture, three hours. Requisite: course 11. Examination of gender dimensions of economic development and globalization from perspective of feminist economics. This perspective implies foregrounding labor, broadly defined to include paid and unpaid work; examining gender differences in work; access to resources; and well-being outcomes; and how these are affected by macroeconomic policies and how gender inequalities are relevant for societal well-being. Since early 1980s economic globalization has been achieved on basis of common set of macroeconomic policies pursued in industrial and developing countries alike. These policies frame both gender-differentiated impacts of policy and initiatives that are implemented to reduce inequalities between men and women. Examination of impact of these policies on gender inequalities in developing countries. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON113"
  },
  {
    "course_code": "ECON 121",
    "units": 4,
    "title": "International Trade Theory",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 101. Corequisite: course 121L. Not open to students with credit for former course 120. Theory of international trade: bases, direction, terms, volume, and gains of trade. Effects of tariffs, quantitative restrictions, and international integration. Effects of free and restricted trade on economic welfare and political stability. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "corequisites": [
      "ECON 121L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON121"
  },
  {
    "course_code": "ECON 121L",
    "units": 1,
    "title": "International Trade Theory Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisite: course 101. Corequisite: course 121. Case-based analysis requiring students to apply material from course 121 to real-world problems involving international trade. Topics and analysis include theory of international trade: bases, direction, terms, volume, and gains of trade; effects of tariffs, quantitative restrictions, and international integration; effects of free and restricted trade on economic welfare and political stability. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "corequisites": [
      "ECON 121"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON121L"
  },
  {
    "course_code": "ECON 122",
    "units": 4,
    "title": "International Finance",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 102. Enforced corequisite: course 122L. Not open to students with credit for former course 120. Emphasis on interpretation of balance of payments and adjustment to national and international equilibria through changes in price levels, exchange rates, and national income. Other topics include making international payments, determination of exchange rates under various monetary standards, capital movements, exchange controls, and international monetary organization. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "corequisites": [
      "ECON 122L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON122"
  },
  {
    "course_code": "ECON 122L",
    "units": 1,
    "title": "International Finance Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisite: course 102. Enforced corequisite: course 122. Case-based analysis requiring students to apply material from course 122 to real-world problems involving international finance. Topics and analysis include balance of payments, exchange rates under various monetary arrangements, capital flows, exchange controls, and international monetary organization. Hands-on data collection and problem solving and presentation of student analyses in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "corequisites": [
      "ECON 122"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON122L"
  },
  {
    "course_code": "ECON 123",
    "units": 4,
    "title": "Forecasting Exchange Rates and Constructing Currency Portfolios",
    "description": "(Formerly numbered M123.) Lecture, three hours; discussion, one hour. Requisites: courses 41, 102, 103, 103L, or consent of instructor. Enforced corequisite: course 123L. Study of main theoretical models of exchange rates and how to design computer codes to make real-time exchange rate forecasts by applying such models to real-world data. Different statistical tests to evaluate accuracy of forecasts and to assess risk-reward trade-offs of currency portfolios. Students gain applied research and presentation skills. Discussion of books and newspaper articles about financial markets and impact of economic news on exchange rates. Students expected to be familiar with use of spreadsheets, such as Excel. Coding basics is highly recommended. P/NP or letter grading.",
    "prerequisites": [
      "ECON 41",
      "ECON 102",
      "ECON 103",
      "ECON 103L"
    ],
    "corequisites": [
      "ECON 123L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON123"
  },
  {
    "course_code": "ECON 123L",
    "units": 1,
    "title": "Forecasting Exchange Rates and Constructing Currency Portfolios Laboratory",
    "description": "Lecture, one hours; laboratory, one hour. Requisites: courses 41, 102, 103, 103L, or consent of instructor. Enforced corequisite: course 123. Hands-on approach in which students write computer codes associated with concepts learned in Economics 123. Students apply these codes to real-world data in order to generate exchange rate forecasts and evaluate prediction accuracy of their forecasting models. Students use these forecasts to construct short-long portfolios of currencies and assess reward-risk trade-offs of such portfolios. To generate and evaluate forecasts, students use Tradestation software, which can be accessed in Social Sciences Computing laboratories. P/NP or letter grading.",
    "prerequisites": [
      "ECON 41",
      "ECON 102",
      "ECON 103",
      "ECON 103L"
    ],
    "corequisites": [
      "ECON 123"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON123L"
  },
  {
    "course_code": "ECON C126A",
    "units": 4,
    "title": "Seminar: International Economics",
    "description": "Seminar, three hours. Requisites: courses 11, 101, 102. Limited to seniors. Overview of most current developments in international economics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C285A. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC126A"
  },
  {
    "course_code": "ECON C126B",
    "units": 4,
    "title": "Seminar: International Economics",
    "description": "Seminar, three hours. Requisites: courses 11, 101, 102. Limited to seniors. Overview of most current developments in international economics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C285B. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC126B"
  },
  {
    "course_code": "ECON C126C",
    "units": 4,
    "title": "Seminar: International Economics",
    "description": "Seminar, three hours. Requisites: courses 11, 101, 102. Limited to seniors. Overview of most current developments in international economics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C285C. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC126C"
  },
  {
    "course_code": "ECON 130",
    "units": 4,
    "title": "Public Economics",
    "description": "Lecture, three hours. Requisites: courses 11, 101, 103. Enforced corequisite: course 130L. Role of government in market economy. Alternative justifications for government intervention. Principles and effects of spending programs (especially social insurance and health), taxation, deficit financing, and federal credit programs. Taxation in open economy. Properties of public choice mechanisms. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 130L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON130"
  },
  {
    "course_code": "ECON 130L",
    "units": 1,
    "title": "Public Economics Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisites: courses 11, 101. Enforced corequisite: course 130. Case-based analysis requiring students to apply theory from course 130 to real-world problems regarding government spending programs, taxation, deficit financing, and federal credit programs. Hands-on data collection and problem solving and presentation of student analyses both orally and in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "corequisites": [
      "ECON 130"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON130L"
  },
  {
    "course_code": "ECON 131",
    "units": 4,
    "title": "Economics of Health and Healthcare",
    "description": "Lecture, three hours. Requisites: courses 11, 101, 103. Enforced corequisite: course 131L. Economic analysis of health and healthcare. Presentation of several detailed economic models, including models of addiction, demand for healthcare, demand for insurance, nonprofit behavior, and other models. Evaluation of quantitative information from course readings and development of better understanding of econometric concepts and results. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 131L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON131"
  },
  {
    "course_code": "ECON 131L",
    "units": 1,
    "title": "Economics of Health and Healthcare Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Enforced requisites: courses 11, 101, 103. Enforced corequisite: course 131. Case-based analysis requiring students to apply theory from course 131 to real-world problems regarding economics of health and healthcare. Hands-on data collection and problem solving and presentation of student analyses both orally and in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 131"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON131L"
  },
  {
    "course_code": "ECON 132",
    "units": 4,
    "title": "Topics in Taxation and Social Insurance",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 11, 101. In-depth examination of selected topics related to current policy debates. Topics vary from year to year but typically emphasize tax policy or social insurance. Topics may include optimal taxation; tax inefficiencies and their implications for labor supply, savings, and investment; income redistribution and personal income tax; corporate taxation and implications for firms’ investment and financing decisions; Social Security and SSDI reform; and welfare programs. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON132"
  },
  {
    "course_code": "ECON 133",
    "units": 4,
    "title": "Intergenerational Poverty in America",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 11, 101, 103. Enforced corequisite: course 133L. Examination of how poverty influences child development and, ultimately, their income and well-being in adulthood. Overview of poverty and intergenerational mobility in America, looking at historical trends and placing U.S. in international context. To understand why poverty is persistent across generations in U.S., study of economic model of skill formation in childhood. Consideration of existing research exploring how number of factors explain intergenerational persistence of poverty, including parental time, pollution, infant and child health, justice system, neighborhoods, stress, and preschool/education systems. Discussion of evidence on whether various public policies can improve mobility. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 133L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON133"
  },
  {
    "course_code": "ECON 133L",
    "units": 1,
    "title": "Intergenerational Poverty in America Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Enforced requisites: courses 11, 101, 103. Enforced corequisite: course 133. Case-based analysis requiring students to apply theory and analysis from course 133 to real-world problems regarding intergenerational poverty in America. Hands-on data collection and problem solving and presentation of student analyses both orally and in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 133"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON133L"
  },
  {
    "course_code": "ECON 134",
    "units": 4,
    "title": "Environmental Economics",
    "description": "Lecture, three hours. Requisites: course 41 or Statistics 12 or 13, and course 101. Introduction to major ideas in natural resources and environmental economics, with emphasis on designing incentives to protect environment. Highlights important role of using empirical data to test hypotheses about pollution’s causes and consequences. P/NP or letter grading.",
    "prerequisites": [
      "ECON 41",
      "STATS 12",
      "STATS 13",
      "ECON 101"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON134"
  },
  {
    "course_code": "ECON M135",
    "units": 4,
    "title": "Economic Models of Public Choice",
    "description": "(Same as Political Science M105.) Lecture, three or four hours; discussion, one hour (when scheduled). Preparation: any lower-division political science course. Enforced requisite: course 11. Designed for juniors/seniors. Analysis of methods and consequences of arriving at collective decisions through political mechanisms. Topics include free-rider problem, voting and majority choice, demand revelation, and political bargaining. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11"
    ],
    "cross_listed": [
      "POL SCI M105"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONM135"
  },
  {
    "course_code": "ECON 137",
    "units": 4,
    "title": "Introduction to Urban and Regional Economics",
    "description": "Lecture, three hours. Requisite: course 11. Survey of broad range of policy and theoretical issues that are raised when economic analysis is applied in urban setting. Topics include urbanization and urban growth, housing markets, location decisions of households and firms, transportation, urban labor markets, and local public sector. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON137"
  },
  {
    "course_code": "ECON 140",
    "units": 4,
    "title": "Computational Methods for Economists",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 101, 102, 103, Mathematics 31A, 31B, 32A, 33A, 33B. Enforced corequisite: course 140L. Introduction to variety of computational methods used in economics. Use of Python and numerical techniques to solve models in macroeconomics and finance, microeconomics, and econometrics. Students should be familiar with scientific programming language such as R or MATLAB but are not required to know Python. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101",
      "ECON 102",
      "ECON 103",
      "MATH 31A",
      "MATH 31B",
      "MATH 32A",
      "MATH 33A",
      "MATH 33B"
    ],
    "corequisites": [
      "ECON 140L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON140"
  },
  {
    "course_code": "ECON 140L",
    "units": 1,
    "title": "Computational Methods for Economists Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisites: courses 101, 102, 103, Mathematics 31A, 31B, 32A, 33A, 33B. Enforced corequisite: course 140. Problem-solving and project-based laboratory requiring students to apply computational methods from course 140 to solve models in macroeconomics and finance, microeconomics, and econometrics. Students should be familiar with scientific programming language such as R or MATLAB but are not required to know Python. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101",
      "ECON 102",
      "ECON 103",
      "MATH 31A",
      "MATH 31B",
      "MATH 32A",
      "MATH 33A",
      "MATH 33B"
    ],
    "corequisites": [
      "ECON 140"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON140L"
  },
  {
    "course_code": "ECON 141",
    "units": 5,
    "title": "Topics in Microeconomics: Mathematical Finance",
    "description": "Lecture, three hours; computer laboratory, one hour. Requisites: course 11, Mathematics 32A, either Statistics 100A or Mathematics 170A. Economics of financial markets, competitive equilibrium with time and uncertainty, one period security market model, market completeness. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "MATH 32A",
      "STATS 100A",
      "MATH 170A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON141"
  },
  {
    "course_code": "ECON 142",
    "units": 4,
    "title": "Economics of Networks",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 41, 101. In today’s networked societies, everyone belongs to many social and economic networks. People and firms rely on various kinds of networks to interact with each other. As a result, the structure of networks affects and shapes behavior in a fundamental way. Study offers a framework in which to understand how agents behave and interact on networks, using tools from economics and statistics. Study of how to classify networks, what is special about social/economics networks, and how information  and misinformation can spread through networks, among others. Special emphasis on how the theory of social and economic networks informs and improves the traditional economic theory. P/NP or letter grading.",
    "prerequisites": [
      "ECON 41",
      "ECON 101"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON142"
  },
  {
    "course_code": "ECON 143",
    "units": 4,
    "title": "Advanced Econometrics",
    "description": "Lecture, three hours; discussion, one hour; laboratory, one hour. Requisite: course 103. Not open for credit to students with credit for former course 147A or 147B. Heteroskedasticity, limited dependent variable, panel data, time-series. P/NP or letter grading.",
    "prerequisites": [
      "ECON 103"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON143"
  },
  {
    "course_code": "ECON 144",
    "units": 4,
    "title": "Economic Forecasting",
    "description": "Lecture, three hours. Preparation: familiarity with data analysis software (e.g., R, Excel, MATLAB, Stata) and/or programming experience. Enforced requisites: courses 101, 103, 103L, 104, 104L. Survey of theory and application of time-series methods to forecasting in economics, business, and government. Topics include modeling and forecasting trend, seasonality, and cycles. Discussion of stochastic trends, volatility measure, and evaluation of forecasting techniques. Hands-on approach to real-world data analysis methods widely used by economists and other professionals. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101",
      "ECON 103",
      "ECON 103L",
      "ECON 104",
      "ECON 104L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON144"
  },
  {
    "course_code": "ECON 145",
    "units": 4,
    "title": "Topics in Microeconomics: Mathematical Economics",
    "description": "Lecture, three hours. Requisite: course 101. Possible topics include game theory; competitive equilibrium analysis; examination of market failure and role for market intervention. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON145"
  },
  {
    "course_code": "ECON C146A",
    "units": 4,
    "title": "Seminar: Asset Pricing",
    "description": "Seminar, three hours. Requisites: courses 11, 101, 102. Limited to seniors. Overview of most current developments in asset pricing theory for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C296A. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC146A"
  },
  {
    "course_code": "ECON C146B",
    "units": 4,
    "title": "Seminar: Asset Pricing",
    "description": "Seminar, three hours. Requisites: courses 11, 101, 102. Limited to seniors. Overview of most current developments in asset pricing theory for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C296B. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC146B"
  },
  {
    "course_code": "ECON C146C",
    "units": 4,
    "title": "Seminar: Asset Pricing",
    "description": "Seminar, three hours. Requisites: courses 11, 101, 102. Limited to seniors. Overview of most current developments in asset pricing theory for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C296C. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC146C"
  },
  {
    "course_code": "ECON 147",
    "units": 4,
    "title": "Computational Finance and Data Analysis for Financial Engineering",
    "description": "Lecture, three hours. Requisites: courses 41, 101, 103. Enforced corequisite: course 147L. Introduction to econometric modeling in empirical/computational finance. Focus on study of econometric models and methods to understand financial market dynamics. Review of essential concepts in probability/statistics and time-series econometrics. Investigation of some popular financial econometric models and estimation methods. Review of selected topics in finance, and how to apply econometric methods to analyze and understand empirical properties of financial market data. Analytical problem sets and data exercises to enhance theoretical understandings and practical skills. P/NP or letter grading.",
    "prerequisites": [
      "ECON 41",
      "ECON 101",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 147L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON147"
  },
  {
    "course_code": "ECON 147L",
    "units": 1,
    "title": "Computational Finance and Data Analysis for Financial Engineering Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisites: courses 41, 101, 103. Enforced corequisite: course 147. Project-based analysis requiring students to apply econometric modeling techniques from course 147 to real-world financial data. P/NP or letter grading.",
    "prerequisites": [
      "ECON 41",
      "ECON 101",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 147"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON147L"
  },
  {
    "course_code": "ECON 148",
    "units": 4,
    "title": "Behavioral Economics",
    "description": "Lecture, three hours. Enforced requisite: course 101. Behavioral economics is emerging subfield of economics that incorporates insights from psychology and other social sciences into economics to improve realism of economic models by incorporating realistic features such as aversion for losses, problems with self control, or concerns for others and thereby improve economic analyses. Review of some standard assumptions made in economics and examination of evidence on how human behavior systematically departs from these assumptions. Investigation of attempts to explore alternative models of human decision making and assessment to what extent these alternative models help improve economic analyses. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON148"
  },
  {
    "course_code": "ECON 149",
    "units": 4,
    "title": "Time-Series Econometrics",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 41, 103, Mathematics 31A, 31B. Enforced corequisite: course 149L. Time-series econometrics studies dynamic behaviors of economic variables using tools from probability theory and statistics. It plays important role in data analysis in macroeconomics and finance. Introduction to methods of time-series analysis in econometrics. Topics include weak dependence, autoregressive-moving-average (ARMA) processes, linear processes, economic forecasting, long-run variance and heteroskedasticity and autocorrelation consistent (HAC) estimation, unit root theory, estimation and inference of time-varying volatility models. Provides useful preparation to students who plan to take empirically oriented macroeconomics and finance courses, and solid understanding of tools required to analyze and model economic time series data and financial asset prices/returns. Emphasis throughout on link between statistical models and implementation. P/NP or letter grading.",
    "prerequisites": [
      "ECON 41",
      "ECON 103",
      "MATH 31A",
      "MATH 31B"
    ],
    "corequisites": [
      "ECON 149L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON149"
  },
  {
    "course_code": "ECON 149L",
    "units": 1,
    "title": "Time-Series Econometrics Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisites: courses 41, 103, Mathematics 31A, 31B. Enforced corequisite: course 149. Problem-solving and project-based analysis requiring students to apply time-series analysis from course 149 to real-world time-series data. Applications involve weak dependence, autoregressive-moving-average (ARMA) processes, linear processes, economic forecasting, long-run variance and heteroskedasticity and autocorrelation consistent (HAC) estimation, unit root theory, estimation and inference of time-varying volatility models. Provides useful preparation to students who plan to take empirically oriented macroeconomics and finance courses, and solid understanding of tools required to analyze and model economic time series data and financial asset prices/returns. Emphasis throughout on link between statistical models and implementation. P/NP or letter grading.",
    "prerequisites": [
      "ECON 41",
      "ECON 103",
      "MATH 31A",
      "MATH 31B"
    ],
    "corequisites": [
      "ECON 149"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON149L"
  },
  {
    "course_code": "ECON 150",
    "units": 4,
    "title": "Labor Economics",
    "description": "Lecture, three hours. Requisites: courses 11, 101, 103. Enforced corequisite: course 150L. Supply and demand for labor. Analysis of government, union, and other constraints on competitive system of wage determination. Wage level and structure. Wages and human capital theory. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 150L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON150"
  },
  {
    "course_code": "ECON 150L",
    "units": 1,
    "title": "Labor Economics Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisites: courses 11, 101, 103. Enforced corequisite: course 150. Case-based analysis requiring students to apply theoretical tools from course 150 to real-world problems involving labor economics. Topics include labor supply decisions, household production decisions, life-cycle aspects of labor supply, short-run and long-run labor demand, monophony in labor market, quasi-fixed labor costs and labor demand, human capital, and other extended topics. Hands-on data collection and problem solving and presentation of student analyses both orally and in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 150"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON150L"
  },
  {
    "course_code": "ECON 151",
    "units": 4,
    "title": "Topics in Labor Economics",
    "description": "Lecture, three hours. Requisites: courses 101, 150. Selected topics in labor theory; income distribution; business cycles and unemployment; investments in human capital and life cycles; migration; human fertility; marriage and divorce, etc. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101",
      "ECON 150"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON151"
  },
  {
    "course_code": "ECON 152",
    "units": 4,
    "title": "Women, Men, and Economy",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 11, 101, 103. Corequisite: course 152L. Introduction to using tools of economics to understand gender-related issues. Review of economic models of household, fertility, and labor supply. Discussion of how they help interpret long-term trends in marriage and divorce, fertility, and women’s labor-force participation. Review of economic models of wage determination, with focus on explanations of and policy remedies for earnings differentials between women and men. Examination of new research in economics on gender-related topics. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 152L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON152"
  },
  {
    "course_code": "ECON 152L",
    "units": 1,
    "title": "Women, Men, and Economy Laboratory",
    "description": "Lecture, three hours; laboratory, one hour. Requisites: courses 11, 101, 103. Corequisite: course 152. Empirical-based analysis requiring students to apply theoretical and empirical tools from course 152 to real-world gender-related issues, and to further discuss latest research in field. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 152"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON152L"
  },
  {
    "course_code": "ECON C156A",
    "units": 4,
    "title": "Seminar: Labor Economics",
    "description": "Seminar, three hours. Requisites: courses 11, 101, 102. Limited to seniors. Overview of most current developments in labor economics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C266A. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC156A"
  },
  {
    "course_code": "ECON C156B",
    "units": 4,
    "title": "Seminar: Labor Economics",
    "description": "Seminar, three hours. Requisites: courses 11, 101, 102. Limited to seniors. Overview of most current developments in labor economics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C266B. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC156B"
  },
  {
    "course_code": "ECON C156C",
    "units": 4,
    "title": "Seminar: Labor Economics",
    "description": "Seminar, three hours. Requisites: courses 11, 101, 102. Limited to seniors. Overview of most current developments in labor economics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C266C. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC156C"
  },
  {
    "course_code": "ECON 160",
    "units": 4,
    "title": "Money and Banking",
    "description": "Lecture, three hours. Requisite: course 102. Principles of money and banking in U.S.; legal and institutional framework; money supply process; instruments, effects, and practice of monetary policy. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON160"
  },
  {
    "course_code": "ECON 161",
    "units": 4,
    "title": "Monetary Theory",
    "description": "Lecture, three hours. Requisites: courses 101, 160. Nature of money and monetary exchange; level and term structure of interest rates; level and growth rate of money; transmission of monetary shocks; theory and practice of monetary policy. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101",
      "ECON 160"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON161"
  },
  {
    "course_code": "ECON 162",
    "units": 4,
    "title": "Monetary Policy",
    "description": "Lecture, three hours. Requisite: course 102. The early part of the 21st century was characterized by several revolutionary changes to the conduct of monetary policy. To understand these changes, review of theoretical models and historical events. Development of a series of policy recommendations for the Federal Reserve given the current state of the U.S. economy, and presentation and written documentation of these ideas. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON162"
  },
  {
    "course_code": "ECON 164",
    "units": 4,
    "title": "Advanced Topics in Macroeconomics: Theory of Economic Growth",
    "description": "Lecture, three hours. Requisite: course 102. Enforced corequisite: course 164L. Use of neoclassical growth model to address various issues, with emphasis on quantitative analysis. Development of economic theory and application to study of long-run growth, industrial revolution, and Great Depression. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "corequisites": [
      "ECON 164L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON164"
  },
  {
    "course_code": "ECON 164L",
    "units": 1,
    "title": "Advanced Topics in Macroeconomics: Theory of Economic Growth Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisite: course 102. Enforced corequisite: course 164. Case-based analysis requiring students to apply theory from course 164 to real-world macroeconomic growth problems. Hands-on data collection and problem solving and presentation of student analyses in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "corequisites": [
      "ECON 164"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON164L"
  },
  {
    "course_code": "ECON 165",
    "units": 4,
    "title": "History of Capitalism in American Economy",
    "description": "Lecture, three hours. Enforced requisite: course 102. Enforced corequisite: course 165L. How capitalism—what economists call market economy with well-defined and protected civil rights and property rights—has contributed to America’s economic growth. Quantitative course, with analysis of how different features of capitalist economies impact economic growth, investment, consumption, and technical change, using computer simulations based on prominent historical examples. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "corequisites": [
      "ECON 165L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON165"
  },
  {
    "course_code": "ECON 165L",
    "units": 1,
    "title": "History of Capitalism in American Economy Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Enforced requisite: course 102. Enforced corequisite: course 165. Case-based analysis requiring students to apply theory and historical data from course 165 to simulate and analyze how variety of macroeconomic policies impact economic activity. Hands-on data collection and problem solving and presentation of student analyses in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "corequisites": [
      "ECON 165"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON165L"
  },
  {
    "course_code": "ECON C166A",
    "units": 4,
    "title": "Seminar: Monetary Economics/Macroeconomics",
    "description": "Seminar, three hours. Requisite: course 102. Limited to seniors. Overview of most current developments in monetary economics and macroeconomics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C226A. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC166A"
  },
  {
    "course_code": "ECON C166B",
    "units": 4,
    "title": "Seminar: Monetary Economics/Macroeconomics",
    "description": "Seminar, three hours. Requisite: course 102. Limited to seniors. Overview of most current developments in monetary economics and macroeconomics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C226B. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC166B"
  },
  {
    "course_code": "ECON C166C",
    "units": 4,
    "title": "Seminar: Monetary Economics/Macroeconomics",
    "description": "Seminar, three hours. Requisite: course 102. Limited to seniors. Overview of most current developments in monetary economics and macroeconomics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C226C. P/NP or letter grading.",
    "prerequisites": [
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC166C"
  },
  {
    "course_code": "ECON 167",
    "units": 4,
    "title": "Victims and Villains; Panics and Bubbles",
    "description": "Lecture, three hours. Requisites: course 101, Management 1A, 1B. Focus on phenomena of panics, bubbles, and manias in financial history. In-depth analysis and discussion of underlying causes, private and public policy responses, similarities, and contemporary issues in today’s financial landscape. Focus on study of financial meltdown of 2008 with comprehensive treatment of financial and banking panics, with discussion of underlying housing and stock market bubbles. Also covers five other financial crises: panic of 1907, Great Depression, Japanese real estate and stock market bubbles of 1980s, American banking crises of 1980s, and Asian Contagion of late 1990s. Highlights various components of financial crises with case and discussion on each component. Students read case studies relating to each, and more general related readings including speeches, papers, and articles. Letter grading.",
    "prerequisites": [
      "ECON 101",
      "MGMT 1A",
      "MGMT 1B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON167"
  },
  {
    "course_code": "ECON 168",
    "units": 4,
    "title": "Introduction to Principles of Value Investing",
    "description": "Lecture, three hours. Requisites: course 101, Management 1A, 1B. Introduction to fundamental principles of value investing. Discussion of fundamental themes relating to value investing, and demonstration of how these ideas compare favorably with other investment approaches. Topics include differences between investment and speculation, how to search for inefficiencies in marketplace, and importance of incorporating margin of safety in any analysis. Introduction of standard accounting and valuation tools, including liquidation value. Prepares students to analyze and interpret financial statements. Designed for students considering careers in security analysis, investment banking, consulting, and corporate finance. Letter grading.",
    "prerequisites": [
      "ECON 101",
      "MGMT 1A",
      "MGMT 1B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON168"
  },
  {
    "course_code": "ECON 169",
    "units": 4,
    "title": "Applied Value Investing",
    "description": "Lecture, three hours. Requisites: courses 101, 168, Management 1A, 1B. Enrollment by application only. Extends principles of introductory value investing class to more advanced and wider variety of applications. Makes use of multiple case studies to enhance comprehension with real-world examples and to highlight necessary valuation skills that students are expected to master. Also covers market dynamics that can create opportunities to find structurally mispriced securities such as rights offerings, spin-offs, restructurings, and liquidations. Designed for students considering careers in security analysis, investment banking, consulting, and corporate finance. Letter grading.",
    "prerequisites": [
      "ECON 101",
      "ECON 168",
      "MGMT 1A",
      "MGMT 1B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON169"
  },
  {
    "course_code": "ECON 170",
    "units": 4,
    "title": "Industrial Organization: Theory and Tactics",
    "description": "Lecture, three hours. Requisite: course 101. Enforced corequisite: course 170L. Not open for credit to students with credit for former course 170 or 171. Monopoly, collusion and competition, strategic firm behavior, nonprice competition with and without entry, pricing practices, antitrust. Comparison of economic and legal treatments of competitive process. Monopoly competition, and collusion as economic theory, as antitrust doctrine, and as fact. Source of monopoly. Predatory behavior. Misleading practices in theory and policy. General problem of relationship between private rights of action and competitive entry. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "corequisites": [
      "ECON 170L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON170"
  },
  {
    "course_code": "ECON 170L",
    "units": 1,
    "title": "Industrial Organization: Theory and Tactics Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisite: course 101. Enforced corequisite: course 170. Case-based analysis requiring students to apply material from course 170 to real-world problems involving monopoly, collusion, strategic firm behavior, pricing practices, antitrust and other topics. Hands-on data collection and problem solving and presentation of student analyses both orally and in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "corequisites": [
      "ECON 170"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON170L"
  },
  {
    "course_code": "ECON 171",
    "units": 4,
    "title": "Industrial Organization: Policy and Regulation",
    "description": "Lecture, three hours. Requisite: course 101. Enforced corequisite: course 171L. Recommended requisite: course 103. Preparation: calculus. Designed to give foundation in topics within field of industrial organization relating to regulation of monopoly power within economy and different way that that manifests across firm conduct and industrial settings. Particular attention to topics in antitrust policy, with some exploration of intersection between economics and law. Topics include in-depth analysis of cartels and mergers, including abstract theory and specifics of analytical approaches deployed in enforcement by Department of Justice and Federal Trade Commission. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "corequisites": [
      "ECON 171L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON171"
  },
  {
    "course_code": "ECON 171L",
    "units": 1,
    "title": "Industrial Organization: Policy and Regulation Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisite: course 101. Enforced corequisite: course 171. Recommended requisite: course 103. Preparation: calculus. Empirically-based analysis requiring students to provide empirical analysis to material covered in course 171, with emphasis on antitrust issues and policies. In particular, use of standard empirical toolkit to critically evaluate public policy and regulation with special emphasis on antitrust policy. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101"
    ],
    "corequisites": [
      "ECON 171"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON171L"
  },
  {
    "course_code": "ECON 173AX",
    "units": 4,
    "title": "Introduction to Social Entrepreneurship",
    "description": "(Formerly numbered 173A.) Lecture, one hour; research group meeting, two hours. Course 173AX is requisite to 173BX. Full-scale immersion into world of social entrepreneurship. Introduction to basics of business planning for social enterprises. Students are assigned in teams to work with participating social enterprises in Los Angeles area to implement new revenue-generating business plan for social enterprises to which they are assigned. Teams receive support from MBA student volunteers as advisers on how to work effectively together and how to resolve issues that arise with staff of assigned social enterprise. Courses 173AX and 173BX must be taken in consecutive terms. In Progress grading (credit to be given only on completion of course 173BX).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON173AX"
  },
  {
    "course_code": "ECON 173BX",
    "units": 4,
    "title": "Introduction to Social Entrepreneurship",
    "description": "(Formerly numbered 173B.) Lecture, one hour; research group meeting, two hours. Requisite: course 173AX. Full-scale immersion into world of social entrepreneurship. Introduction to basics of business planning for social enterprises. Students are assigned in teams to work with participating social enterprises in Los Angeles area to implement new revenue-generating business plan for social enterprises to which they are assigned. Teams receive support from MBA student volunteers as advisers on how to work effectively together and how to resolve issues that arise with staff of assigned social enterprise. Courses 173AX and 173BX must be taken in consecutive terms. P/NP or letter grading.",
    "prerequisites": [
      "ECON 173AX"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON173BX"
  },
  {
    "course_code": "ECON 174",
    "units": 4,
    "title": "Economics of Sports",
    "description": "Lecture, three hours. Enforced requisites: courses 11, 41, 101. Recommended: courses 103/103L. Course in applied microeconomics that employs both theoretical and empirical tools to analyze wide range of topics related to sports industry. Topics include history of labor relations in professional sports, history and analysis of player salaries in professional sports, market for professional sports franchises and sports broadcast rights, league expansion and relocation decisions, understanding of role of economic impact studies (cost-benefit analysis) and public/private partnerships in facility financing, relationship between academics and athletics in collegiate sports, racial discrimination in sports, exploration of behavioral issues such as strategic effort, measuring return on investment from sport sponsorships, and calculation of economic damages in legal cases involving athletes. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 41",
      "ECON 101"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON174"
  },
  {
    "course_code": "ECON C176A",
    "units": 4,
    "title": "Seminar: Industrial Organization",
    "description": "Seminar, three hours. Requisites: courses 11, 101, 102. Limited to seniors. Overview of most current developments in industrial organization for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C276A. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC176A"
  },
  {
    "course_code": "ECON C176B",
    "units": 4,
    "title": "Seminar: Industrial Organization",
    "description": "Seminar, three hours. Requisites: courses 11, 101, 102. Limited to seniors. Overview of most current developments in industrial organization for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C276B. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC176B"
  },
  {
    "course_code": "ECON C176C",
    "units": 4,
    "title": "Seminar: Industrial Organization",
    "description": "Seminar, three hours. Requisites: courses 11, 101, 102. Limited to seniors. Overview of most current developments in industrial organization for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with courses C276C. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC176C"
  },
  {
    "course_code": "ECON 177",
    "units": 4,
    "title": "Field Projects in Investing",
    "description": "Seminar, three hours. Enforced requisites: courses 167, 168, 169. Enrollment by application only. Experiential learning tool and seminar course where students complete significant research on investment-related topic. Participating students are paired with asset management firm and engage regularly to complete research project. Designed to expose students to real-world practice of asset valuation, including applications of tools and inputs (including economics, accounting, and quantitative techniques) in asset valuation. Letter grading.",
    "prerequisites": [
      "ECON 167",
      "ECON 168",
      "ECON 169"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON177"
  },
  {
    "course_code": "ECON 181",
    "units": 4,
    "title": "Development of Economic Institutions in Western Europe",
    "description": "Lecture, three hours. Requisite: courses 11, 103. Corequisite: course 181L. Application of economic theory and quantitative reasoning to study economic history of Western Europe from 18th to 20th century. Topics include Malthusian theory, Industrial Revolution, demographic transition, formation and persistence of institutions and organizations, World Wars, and development of Europe during 1950s and 1960s. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 181L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON181"
  },
  {
    "course_code": "ECON 181L",
    "units": 1,
    "title": "Development of Economic Institutions in Western Europe Laboratory",
    "description": "Lecture, three hours; laboratory, one hour. Requisite: courses 11, 103. Corequisite: course 181. Empirical analysis requiring application of material from corresponding lecture course to selected historical issues, such as Malthusian theory, Industrial Revolution, demographic transition, formation and persistence of institutions and organizations, World Wars, and development of Europe during 1950s and 1960s. Hands-on data collection and problem solving and presentation of student analyses in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 181"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON181L"
  },
  {
    "course_code": "ECON 182A",
    "units": 4,
    "title": "U.S. Economic History: From Colonial Times to the Civil War",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 11, 41 (or equivalent). Enforced corequisite: course 182AL. Examination of the development of the U.S. economy up to and including the Civil War. Focus on using economic models and numbers to understand what drove the evolution of the economy, why structural changes occurred, and why there was persistence. While the past persists for a long time in the form of people and institutions, there are periods of dramatic change brought on by technological change and by war. Study of the past, with its very different institutions, to inform the present. For example, there was no U.S. currency until the Civil War. Each bank printed its own notes and each state had different banking regulations. Investigation of how the system worked, whether it was effective in allocating capital, and how stability depended on banking regulations. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 41"
    ],
    "corequisites": [
      "ECON 182AL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON182A"
  },
  {
    "course_code": "ECON 182AL",
    "units": 1,
    "title": "U.S. Economic History: From Colonial Times to the Civil War Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisites: courses 11, 41 (or equivalent). Enforced corequisite: course 182A. Empirical analysis requiring application of material from course 182A to the development of the U.S. Economy up to and including the Civil War. Focus on application of economic models and empirical analysis to understand what drove the evolution of the economy, why structural changes occurred, and why there was persistence. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 41"
    ],
    "corequisites": [
      "ECON 182A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON182AL"
  },
  {
    "course_code": "ECON 182B",
    "units": 4,
    "title": "U.S. Economic History: From the Civil War to World War I",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 11, 41 (or equivalent). Enforced corequisite: course 182BL. Examination of the development of the U.S. economy from the Civil War to World War I. Focus on using economic models and numbers to understand what drove the evolution of the economy, why structural changes occurred, and why there was persistence. While the past persists for a long time in the form of people and institutions, there are periods of dramatic change brought on by technological change and by war. Study of the past, with its very different institutions, to inform the present. For example, the time period from the Civil War to World War I witnessed the rise of large corporations and complaints of monopoly power. There was anti-trust law. Investigation of degree to which collusion and monopoly was a problem, and whether anti-trust law solved the problem or if the regulators were captured. Consideration also that there was no Federal Reserve until December 1914, and examination of the problems created by not having a Federal Reserve. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 41"
    ],
    "corequisites": [
      "ECON 182BL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON182B"
  },
  {
    "course_code": "ECON 182BL",
    "units": 1,
    "title": "U.S. Economic History: From the Civil War to World War I Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisites: courses 11, 41 (or equivalent). Enforced corequisite: course 182B. Empirical analysis requiring application of material from course 182B to the development of the U.S. Economy from the Civil War to World War I. Focus on application of economic models and empirical analysis to understand what drove the evolution of the economy, why structural changes occurred, and why there was persistence. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 41"
    ],
    "corequisites": [
      "ECON 182B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON182BL"
  },
  {
    "course_code": "ECON 182C",
    "units": 4,
    "title": "U.S. Economic History: From World War I to 1980s",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 11, 41 (or equivalent). Enforced corequisite: course 182CL. Examination of the development of the U.S. economy from the World War I to 1980s. Focus on using economic models and numbers to understand what drove the evolution of the economy, why structural changes occurred, and why there was persistence. While the past persists for a long time in the form of people and institutions, there are periods of dramatic change brought on by technological change and by war. Study of the past, with its very different institutions, to inform the present. For example, during the 2007-2008 financial crisis, economists looked to the Great Depression, a topic on which then Federal Reserve chairman Ben Bernanke published. Economists also look to the past to understand the role of government deficits in inflation and in economic growth. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 41"
    ],
    "corequisites": [
      "ECON 182CL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON182C"
  },
  {
    "course_code": "ECON 182CL",
    "units": 1,
    "title": "U.S. Economic History: From World War I to 1980s Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisites: courses 11, 41 (or equivalent). Enforced corequisite: course 182C. Empirical analysis requiring application of material from course 182C to the development of the U.S. Economy from World War I to 1980s. Focus on application of economic models and empirical analysis to understand what drove the evolution of the economy, why structural changes occurred, and why there was persistence. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 41"
    ],
    "corequisites": [
      "ECON 182C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON182CL"
  },
  {
    "course_code": "ECON 183",
    "units": 4,
    "title": "Development of Economic Institutions in U.S.",
    "description": "Lecture, three hours. Requisites: courses 11, 103. Enforced corequisite: course 183L. Study of changing economic conditions in U.S. from Colonial times to early 20th century and effects of these changes on American society. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "prerequisites": [
      "ECON 11",
      "ECON 103"
    ],
    "corequisites": [
      "ECON 183L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON183"
  },
  {
    "course_code": "ECON 183L",
    "units": 1,
    "title": "Development of Economic Institutions in U.S. Laboratory",
    "description": "Lecture, one hour; laboratory, one hour. Requisite: course 11. Enforced corequisite: course 183. Empirical analysis requiring students to apply material from course 183 to selected historical issues such as migration, slavery, industrialization, capital formation, Great Depression, human capital formation, and California development and relate them to current real-world issues. Hands-on data collection and problem solving and presentation of student analyses in writing. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11"
    ],
    "corequisites": [
      "ECON 183"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON183L"
  },
  {
    "course_code": "ECON 185",
    "units": 1,
    "title": "Career Development",
    "description": "Lecture, one hour. Enrollment priority to departmental majors. Designed to provide Business Economics majors with key knowledge and practical skills used in real world that compliment traditional academics to maximize interview, communication, and presentation skills and strengthen résumé building. Coverage of career paths in business profession in various aspects to broaden students’ knowledge of career opportunities. Review of current business environment, financial markets, economy, unemployment, banking crises, market updates, and all related business topics. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON185"
  },
  {
    "course_code": "ECON C186A",
    "units": 4,
    "title": "Seminar: Economic History",
    "description": "Seminar, three hours. Limited to seniors. Overview of most current developments in economic history for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C246A. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC186A"
  },
  {
    "course_code": "ECON C186B",
    "units": 4,
    "title": "Seminar: Economic History",
    "description": "Seminar, three hours. Limited to seniors. Overview of most current developments in economic history for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C246B. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC186B"
  },
  {
    "course_code": "ECON C186C",
    "units": 4,
    "title": "Seminar: Economic History",
    "description": "Seminar, three hours. Limited to seniors. Overview of most current developments in economic history for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C246C. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC186C"
  },
  {
    "course_code": "ECON 187",
    "units": 4,
    "title": "Upper-Division Research Seminar: Applications of Economic Theory",
    "description": "Seminar, three hours. Requisites: courses 11, 101. Limited enrollment seminars in which students usually write research paper on topic selected in consultation with instructor. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON187"
  },
  {
    "course_code": "ECON 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON188SA"
  },
  {
    "course_code": "ECON 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "ECON 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON188SB"
  },
  {
    "course_code": "ECON 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "ECON 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON188SC"
  },
  {
    "course_code": "ECON M188XP",
    "units": 4,
    "title": "Practicum in Social Entrepreneurship",
    "description": "(Formerly numbered M188.) (Same as Community Engagement and Social Change M188XP.) Seminar, three hours. Enrollment by consent of instructor. Offers students full-scale immersion into challenges of launching social enterprise. Students work in teams alongside staff of local nonprofit organizations in 10-week social enterprise accelerator program aimed at helping participating organizations secure financial and operational resources they need to implement social enterprise for which viable business plan has already been constructed. Students meet assigned organization, study its business plan, and work with instructors of course and staff of nonprofit organization to develop tailored plan of work for 10-week accelerator program. Students carry out work in conjunction with staff of organization under supervision of instructors and with assistance of experienced entrepreneur volunteer mentors. P/NP or letter grading.",
    "cross_listed": [
      "CESC M188XP"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONM188XP"
  },
  {
    "course_code": "ECON 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON189"
  },
  {
    "course_code": "ECON 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON189HC"
  },
  {
    "course_code": "ECON 191",
    "units": 4,
    "title": "Variable Topics Research Seminars: Economics",
    "description": "Seminar, three hours. Enforced requisites: courses 101, 102, 103. Research seminars on selected topics in economics. Reading, discussion, and development of culminating project. Consult Schedule of Classes for topics and instructors. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "ECON 101",
      "ECON 102",
      "ECON 103"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON191"
  },
  {
    "course_code": "ECON 192",
    "units": 3,
    "title": "Undergraduate Practicum in Economics",
    "description": "Seminar, two hours. Limited to juniors/seniors. Training and supervised practicum for advanced undergraduate students. Students assist in preparation of course materials and development of innovative programs with guidance of faculty members. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON192"
  },
  {
    "course_code": "ECON 195A",
    "units": 2,
    "title": "Community or Corporate Internships in Economics I",
    "description": "Tutorial, to be arranged. Requisites: courses 11, 101. Limited to junior/senior Economics, Business Economics, Economics/International Area Studies, and Mathematics/Economics majors. Internship to be supervised by Economics Department. Further supervision to be provided by business or entity for which student is doing internship. Students meet on regular basis with instructor and provide periodic reports of their experience. May not be applied toward major requirements. Only 8 units from courses 195A and 195B may be applied toward undergraduate degree. Individual contract with supervising faculty member required. P/NP grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON195A"
  },
  {
    "course_code": "ECON 195B",
    "units": 4,
    "title": "Community or Corporate Internships in Economics II",
    "description": "Tutorial, to be arranged. Requisites: courses 11, 101. Limited to junior/senior Economics, Business Economics, Economics/International Area Studies, and Mathematics/Economics majors. Internship to be supervised by Economics Department. Further supervision to be provided by business or entity for which student is doing internship. Students meet on regular basis with instructor and provide periodic reports of their experience. May not be applied toward major requirements. Only 8 units from courses 195A and 195B may be applied toward undergraduate degree. Individual contract with supervising faculty member required. P/NP grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON195B"
  },
  {
    "course_code": "ECON 195C",
    "units": 4,
    "title": "Community and Corporate Internships in Economics",
    "description": "Tutorial, to be arranged; fieldwork, eight to 10 hours. Requisites: courses 11, 101. Limited to juniors/seniors. Internship in corporate, governmental, or nonprofit setting coordinated by Economics Department. Students complete weekly written assignments, attend biweekly meetings with graduate student coordinator, and write final research paper. Faculty sponsor and graduate student coordinator construct series of reading assignments that examine issues related to internship site. May not be applied toward major requirements. May be repeated for credit with consent of department. Individual contract with supervising faculty member required. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON195C"
  },
  {
    "course_code": "ECON 198A",
    "units": 4,
    "title": "Honors Research in Economics I",
    "description": "Tutorial, three hours. Requisites: courses 11, 101, 102. Limited to senior departmental honors program students. First term of two-term sequence in which students develop honors thesis or comprehensive research project under direct supervision of faculty member. Individual contract required. In Progress grading (credit to be given only on completion of course 198B).",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON198A"
  },
  {
    "course_code": "ECON 198B",
    "units": 4,
    "title": "Honors Research in Economics II",
    "description": "Tutorial, three hours. Requisite: course 198A. Limited to senior departmental honors program students. Second term of two-term sequence in which students complete honors thesis or comprehensive research project under direct supervision of faculty member. Individual contract required. Letter grading.",
    "prerequisites": [
      "ECON 198A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON198B"
  },
  {
    "course_code": "ECON 199A",
    "units": 4,
    "title": "Directed Research in Economics",
    "description": "Tutorial, three hours. Requisites: courses 11, 101, 102. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated twice but may be applied only once toward major requirements. Individual contract required. P/NP or letter grading.",
    "prerequisites": [
      "ECON 11",
      "ECON 101",
      "ECON 102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON199A"
  },
  {
    "course_code": "ECON 199B",
    "units": 4,
    "title": "Directed Research in Economics/International Area Studies",
    "description": "Tutorial, three hours. Students prepare research papers under guidance of faculty mentor on economy of country or region of specialization. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON199B"
  },
  {
    "course_code": "ECON 200",
    "units": 4,
    "title": "Mathematical Methods in Economics",
    "description": "Lecture, three hours. Should be taken prior to enrollment in course 201A. Examination of mathematical methods used in graduate-level courses in microeconomics, macroeconomics, and quantitative methods. Topics include real analysis, linear algebra and matrices, calculus of many variables, static optimization, convex analysis, and dynamics and dynamic optimization. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON200"
  },
  {
    "course_code": "ECON 200B",
    "units": 4,
    "title": "Mathematical Methods in Economics II",
    "description": "Lecture, three hours; laboratory, two hours. Should be taken prior to or concurrent with course 201B. Linear algebra and its application to linear difference equations. Basic real analysis, normed vector space/Banach space, Hahn/Banach theorem, Schauder fixed point theorem, and theory of correspondences. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON200B"
  },
  {
    "course_code": "ECON 201A",
    "units": 4,
    "title": "Microeconomics: Theory of Firm and Consumer",
    "description": "Lecture, three hours. Two input/two output model. Walrasian equilibrium and Pareto efficiency. Choice over time—consumer savings and firm investment decisions. Choice under uncertainty—state claims model, asset pricing. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON201A"
  },
  {
    "course_code": "ECON 201B",
    "units": 4,
    "title": "Microeconomics: Basic Concepts and Techniques of Noncooperative Game Theory and Information Economics",
    "description": "Lecture, three hours. Nash equilibrium and subgame perfection. Games with incomplete information. Models of strategic market behavior. Screening and signaling. Bargaining models. Theory of firm. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON201B"
  },
  {
    "course_code": "ECON 201C",
    "units": 4,
    "title": "Microeconomics: Game Theory with Asymmetric Information and Applications",
    "description": "Lecture, three hours. Perfect Bayesian equilibrium and refinements, mechanism design. Applied topics such as adverse selection, signaling, moral hazard, bidding, price discrimination, and public good provision. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON201C"
  },
  {
    "course_code": "ECON 202A",
    "units": 4,
    "title": "Macroeconomics: Dynamics and Growth Theory",
    "description": "Lecture, three hours. Essential techniques and concepts from dynamical mathematics and neoclassical growth theory. Linear and nonlinear dynamical systems. Dynamic programming and control theory. Stochastic dynamics. Determinacy of equilibrium. Descriptive, optimal, and overlapping generations models of accumulation. Stochastic growth theory. Increasing returns and applications to economic development. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON202A"
  },
  {
    "course_code": "ECON 202B",
    "units": 4,
    "title": "Macroeconomics: Business Cycles",
    "description": "Lecture, three hours. Survey of representative agent and complete market models of short-run fluctuations. Facts about fluctuations and long-term growth. Real business cycle theory. Calibrating and simulating dynamic models. Asset prices, money, and inflation. Taxation of factor incomes. Cyclical aspects of employment. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON202B"
  },
  {
    "course_code": "ECON 202C",
    "units": 4,
    "title": "Macroeconomics: Topics in Macroeconomics",
    "description": "Lecture, three hours. Heterogeneous-agent models of endogenous fluctuations and growth. General equilibrium techniques in macroeconomics. Overlapping fluctuations model with national debt. Fiscal policy. Externalities, indeterminacy, and growth. Expectations and business cycles. Money and monetary policy. Historical overview of mainstream macroeconomics. Wicksell and Keynes. Monetarist controversy. New classical and new Keynesian macroeconomics. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON202C"
  },
  {
    "course_code": "ECON 203A",
    "units": 4,
    "title": "Introduction to Econometrics I",
    "description": "Lecture, three hours; discussion, one hour. Probability and statistical tools for econometric models. Topics include random variables, distribution and density functions, transformations, identification, sampling, estimators, asymptotic properties. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON203A"
  },
  {
    "course_code": "ECON 203B",
    "units": 4,
    "title": "Introduction to Econometrics II",
    "description": "Lecture, three hours; discussion, one hour. Estimation and testing. Basic linear regression model, tests of hypotheses, generalized least squares, heteroskedasticity, multicollinearity, error-in-variables, and qualitative dependent variables. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON203B"
  },
  {
    "course_code": "ECON 203C",
    "units": 4,
    "title": "Introduction to Econometrics III",
    "description": "Lecture, three hours; discussion, one hour. Econometrics methods for time-series econometrics, including theory and applications. Topics include detrending techniques, unit root theory, cointegrated system approaches, autocorrelation robust inference, Wold and Beveridge and Nelson (BN) decompositions, model selection, nonlinear nonstationary models, spatial density asymptotics and semi-nonparametric time-series models. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON203C"
  },
  {
    "course_code": "ECON M204A",
    "units": 4,
    "title": "Applications of Economic Theory: California Population Research Topical Seminar Series",
    "description": "(Same as Sociology M225A.) Seminar, three hours. Limited to California Center for Population Research (CCPR) affiliates. Examination of issues such as demography, health, aging, labor, and broad array of topics concerned with effects of economic, social, and political transformations on human behavior both in U.S. and abroad. S/U grading.",
    "cross_listed": [
      "SOCIOL M225A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONM204A"
  },
  {
    "course_code": "ECON 204B",
    "units": 4,
    "title": "Applications of Economic Theory: California Population Research Topical Seminar Series",
    "description": "Seminar, three hours. Examination of issues such as demography, health, aging, labor, and broad array of topics concerned with effects of economic, social, and political transformations on human behavior both in U.S. and abroad. May be taken independently for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON204B"
  },
  {
    "course_code": "ECON 204C",
    "units": 4,
    "title": "Applications of Economic Theory: California Population Research Topical Seminar Series",
    "description": "Seminar, three hours. Examination of issues such as demography, health, aging, labor, and broad array of topics concerned with effects of economic, social, and political transformations on human behavior both in U.S. and abroad. May be taken independently for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON204C"
  },
  {
    "course_code": "ECON 204D",
    "units": 4,
    "title": "Applications of Economic Theory",
    "description": "Lecture, three hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON204D"
  },
  {
    "course_code": "ECON 204E",
    "units": 4,
    "title": "Applications of Economic Theory",
    "description": "Lecture, three hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON204E"
  },
  {
    "course_code": "ECON 204F",
    "units": 4,
    "title": "Applications of Economic Theory",
    "description": "Lecture, three hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON204F"
  },
  {
    "course_code": "ECON 204G",
    "units": 4,
    "title": "Applications of Economic Theory",
    "description": "Lecture, three hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON204G"
  },
  {
    "course_code": "ECON 204H",
    "units": 4,
    "title": "Applications of Economic Theory",
    "description": "Lecture, three hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON204H"
  },
  {
    "course_code": "ECON 204I",
    "units": 4,
    "title": "Applications of Economic Theory",
    "description": "Lecture, three hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON204I"
  },
  {
    "course_code": "ECON 204J",
    "units": 4,
    "title": "Applications of Economic Theory",
    "description": "Lecture, three hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON204J"
  },
  {
    "course_code": "ECON 204K",
    "units": 4,
    "title": "Applications of Economic Theory",
    "description": "Lecture, three hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON204K"
  },
  {
    "course_code": "ECON M204L",
    "units": 1,
    "title": "Seminar: Pharmaceutical Economics and Policy",
    "description": "(Same as Health Policy M204A.) Seminar, three hours every other week. Requisite: Health Policy M236. Limited to graduate public health and economics students. Various topics in economics of pharmaceutical industry, including rates of innovation, drug regulation, and economic impact of pharmaceuticals. In Progress grading (credit to be given only on completion of courses M204M and M204N).",
    "prerequisites": [
      "HLT POL M236"
    ],
    "cross_listed": [
      "HLT POL M204A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONM204L"
  },
  {
    "course_code": "ECON M204M",
    "units": 1,
    "title": "Seminar: Pharmaceutical Economics and Policy",
    "description": "(Same as Health Policy M204B.) Seminar, three hours every other week. Requisite: Health Policy M236. Limited to graduate public health and economics students. Various topics in economics of pharmaceutical industry, including rates of innovation, drug regulation, and economic impact of pharmaceuticals. In Progress grading (credit to be given only on completion of course M204N).",
    "prerequisites": [
      "HLT POL M236"
    ],
    "cross_listed": [
      "HLT POL M204B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONM204M"
  },
  {
    "course_code": "ECON M204N",
    "units": 2,
    "title": "Seminar: Pharmaceutical Economics and Policy",
    "description": "(Same as Health Policy M204C.) Seminar, three hours every other week. Requisite: Health Policy M236. Limited to graduate public health and economics students. Various topics in economics of pharmaceutical industry, including rates of innovation, drug regulation, and economic impact of pharmaceuticals. Letter grading.",
    "prerequisites": [
      "HLT POL M236"
    ],
    "cross_listed": [
      "HLT POL M204C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONM204N"
  },
  {
    "course_code": "ECON 204R",
    "units": 4,
    "title": "Applications of Economic Theory",
    "description": "Lecture, three hours. Preparation: completion of first-year microeconomics and graduate econometrics courses. In past decade economists have learned remarkable amount about how society works. Increased understanding has come about through application of distinctively economic methods of research—explicit mathematical models and eclectic statistical techniques—to topics such as healthcare, crime, education, and immigration. Taken together this work has led to increased understanding of inequality, how to measure it, how inequality has increased in U.S., how America differs from other rich countries and, most important, what causes inequality. Study of this work, with focus on two important influences on inequality—education and health—which are two areas in which knowledge is accumulating most rapidly. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON204R"
  },
  {
    "course_code": "ECON 205",
    "units": 4,
    "title": "Economic Modeling",
    "description": "Lecture, three hours. Development of modeling skills by considering sequence of economic issues (e.g., peak load pricing, regulation, monopoly, capital asset pricing, Pareto efficiency). Emphasis on multivariate constrained optimization. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON205"
  },
  {
    "course_code": "ECON 206",
    "units": 2,
    "title": "Law and Economics Workshop",
    "description": "Seminar, two hours. Requisite: course 201A or Management 405. Knowledge of empirical methods and basic calculus required. Interdisciplinary speakers series bringing together outside speakers with scholars and students from UCLA Law School and academic departments. Topics include contracts, torts, intellectual property, and business law. Students write graded reaction papers. May be repeated for credit. Concurrently scheduled with Law 648 and Management 294. S/U or letter grading.",
    "prerequisites": [
      "ECON 201A",
      "MGMT 405"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON206"
  },
  {
    "course_code": "ECON 207",
    "units": 4,
    "title": "History of Economic Thought",
    "description": "Lecture, three hours. Topics from classical economics, including work of Smith, Ricardo, and Mill, and developments from 1870s, including contributions of major figures of marginalistic revolution, socialist controversy, and history of welfare economics. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON207"
  },
  {
    "course_code": "ECON M208",
    "units": 4,
    "title": "Introduction to Demographic Methods",
    "description": "(Same as Biostatistics M208, Community Health Sciences M208, and Sociology M213A.) Lecture, four hours. Preparation: one introductory statistics course. Introduction to methods of demographic analysis. Topics include demographic rates, standardization, decomposition of differences, life tables, survival analysis, cohort analysis, birth interval analysis, models of population growth, stable populations, population projection, and demographic data sources. Letter grading.",
    "cross_listed": [
      "SOCIOL M213A",
      "COM HLT M208",
      "BIOSTAT M208"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONM208"
  },
  {
    "course_code": "ECON 209A",
    "units": 4,
    "title": "PhD Research Seminar",
    "description": "Seminar, three hours. Designed to help PhD students transition from standard learning (attending lecture, taking examinations) into creating independent research. Students are supported in developing their dissertation and professional skills in all aspects of process of creating their own research, including writing and presentation. Covered topics include finding research ideas, writing introductions, building narratives, writing models, presenting empirical analysis, writing referee reports, responding to referees, presentation, elevator pitch, etc. For each topic, students study canonical examples and work on their own papers. Faculty provide feedback and build supportive environment in which students can learn and experiment. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON209A"
  },
  {
    "course_code": "ECON 209B",
    "units": 4,
    "title": "PhD Research Seminar",
    "description": "Seminar, three hours. Designed to help PhD students transition from standard learning (attending lecture, taking examinations) into creating independent research. Students are supported in developing their dissertation and professional skills in all aspects of process of creating their own research, including writing and presentation. Covered topics include finding research ideas, writing introductions, building narratives, writing models, presenting empirical analysis, writing referee reports, responding to referees, presentation, elevator pitch, etc. For each topic, students study canonical examples and work on their own papers. Faculty provide feedback and build supportive environment in which students can learn and experiment. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON209B"
  },
  {
    "course_code": "ECON 209C",
    "units": 4,
    "title": "PhD Research Seminar",
    "description": "Seminar, three hours. Designed to help PhD students transition from standard learning (attending lecture, taking examinations) into creating independent research. Students are supported in developing their dissertation and professional skills in all aspects of process of creating their own research, including writing and presentation. Covered topics include finding research ideas, writing introductions, building narratives, writing models, presenting empirical analysis, writing referee reports, responding to referees, presentation, elevator pitch, etc. For each topic, students study canonical examples and work on their own papers. Faculty provide feedback and build supportive environment in which students can learn and experiment. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON209C"
  },
  {
    "course_code": "ECON 211A",
    "units": 4,
    "title": "Contract Theory",
    "description": "Lecture, three hours. Preparation: introductory probability. Enforced requisite: course 201C. Study of trading relationships between small number of agents. Coverage of many tools and techniques used in models of moral hazard, adverse selection, and incomplete contracting, starting with static models of moral hazard and mechanism design and development of their dynamic counterparts. Consideration of environments where agents cannot use formal contracts, studying relational contracts and trading relationships with no contracts, Analysis of wide variety of applications from industrial organization, corporate finance, personnel economics, and public economics. S/U or letter grading.",
    "prerequisites": [
      "ECON 201C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON211A"
  },
  {
    "course_code": "ECON 211B",
    "units": 4,
    "title": "Economics of Uncertainty, Information, and Games",
    "description": "Lecture, three hours. Preparation: introductory probability. Requisite: course 201C. Theory of individual decision making under uncertainty, applied to topics such as asset pricing models, adverse selection, moral hazard, bargaining, signaling, auctions, and search. S/U or letter grading.",
    "prerequisites": [
      "ECON 201C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON211B"
  },
  {
    "course_code": "ECON 211C",
    "units": 4,
    "title": "Game Theory and Economic Applications",
    "description": "Lecture, three hours. Preparation: introductory probability. Enforced requisite: course 201C. Intended for students who are interested in doing research in microeconomic theory and for students who want to acquire good theory background to do applied work. Coverage of combination of standard results in field and topics of current research, including notions of equilibrium in static and dynamic games, reasoning in games, repeated games, games of incomplete information, and experiments. S/U or letter grading.",
    "prerequisites": [
      "ECON 201C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON211C"
  },
  {
    "course_code": "ECON 212A",
    "units": 4,
    "title": "Topics in Advanced Theory: Search Theory",
    "description": "Lecture, three hours. Preparation: calculus, introductory probability. Price searching, queueing, Brownian motion, martingales, and applications to theory of firm. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON212A"
  },
  {
    "course_code": "ECON 212B",
    "units": 4,
    "title": "Topics in Advanced Theory: Applied Game Theory",
    "description": "Lecture, three hours. Preparation: calculus, introductory probability. Use of theory of Bayesian games to study bargaining, monetary theory, and oligopoly. Use of theory of mechanisms to study auction design and imperfectly competitive markets. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON212B"
  },
  {
    "course_code": "ECON 213A",
    "units": 4,
    "title": "General Equilibrium and Game Theory",
    "description": "Lecture, three hours. Requisite: course 201C. Selected advanced theoretical topics of current interest and introduction to modern mathematical economics, including general equilibrium theory and game theory. S/U or letter grading.",
    "prerequisites": [
      "ECON 201C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON213A"
  },
  {
    "course_code": "ECON 213B",
    "units": 4,
    "title": "General Equilibrium and Game Theory",
    "description": "Lecture, three hours. Requisite: course 201C. Selected advanced theoretical topics of current interest and introduction to modern mathematical economics, including general equilibrium theory and game theory. S/U or letter grading.",
    "prerequisites": [
      "ECON 201C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON213B"
  },
  {
    "course_code": "ECON 214A",
    "units": 4,
    "title": "Topics in Mathematical Economics: General Equilibrium Theory",
    "description": "Lecture, three hours. Requisite: course 201C. Core convergence theorem, cooperative and noncooperative approach to competitive equilibrium theory, perfectly competitive equilibria, no-surplus condition, and applications to mechanism theory and incomplete market models. May be repeated for credit. S/U or letter grading.",
    "prerequisites": [
      "ECON 201C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON214A"
  },
  {
    "course_code": "ECON M215",
    "units": 4,
    "title": "Topics in Applied Game Theory",
    "description": "(Same as Political Science M208B.) Lecture, three hours. Preparation: calculus or introductory probability. Designed for graduate economics and political science students. Survey and applications of major solution concepts to models of bargaining, oligopoly, cost allocation, and voting power. S/U or letter grading.",
    "cross_listed": [
      "POL SCI M208B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONM215"
  },
  {
    "course_code": "ECON 218A",
    "units": 4,
    "title": "Proseminar: Economic Theory",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers. Discussion of advanced topics and recent developments in game theory, information and uncertainty, and general equilibrium theory. Presentation of recent papers published and unpublished in economic theory as well as research of instructor and students. In-class presentation expected. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON218A"
  },
  {
    "course_code": "ECON 218B",
    "units": 4,
    "title": "Proseminar: Economic Theory",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers. Discussion of advanced topics and recent developments in game theory, information and uncertainty, and general equilibrium theory. Presentation of recent papers published and unpublished in economic theory as well as research of instructor and students. In-class presentation expected. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON218B"
  },
  {
    "course_code": "ECON 218C",
    "units": 4,
    "title": "Proseminar: Economic Theory",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers. Discussion of advanced topics and recent developments in game theory, information and uncertainty, and general equilibrium theory. Presentation of recent papers published and unpublished in economic theory as well as research of instructor and students. In-class presentation expected. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON218C"
  },
  {
    "course_code": "ECON 219A",
    "units": 4,
    "title": "Workshop: Economic Theory and Mathematical Economics",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON219A"
  },
  {
    "course_code": "ECON 219B",
    "units": 4,
    "title": "Workshop: Economic Theory and Mathematical Economics",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON219B"
  },
  {
    "course_code": "ECON 219C",
    "units": 4,
    "title": "Workshop: Economic Theory and Mathematical Economics",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON219C"
  },
  {
    "course_code": "ECON 221A",
    "units": 4,
    "title": "Monetary Economics I",
    "description": "Lecture, three hours. Requisites: courses 202A, 202B, 202C. Dynamic methods in business cycles and economic growth. Multiperiod life-cycle models. Sustainable public deficits. Money and inflationary finance. Human capital. Endogenous fluctuations and regime switching. Econometrics of multiple equilibrium models. Political economy of government deficits and inflation. S/U or letter grading.",
    "prerequisites": [
      "ECON 202A",
      "ECON 202B",
      "ECON 202C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON221A"
  },
  {
    "course_code": "ECON 221B",
    "units": 4,
    "title": "Monetary Economics II",
    "description": "Lecture, three hours. Emphasis on theoretical, historical, and policy aspects of monetary economics. Financial intermediation, bank panics, asset price volatility, game theoretic models of policy, inflation, implication of monopolistic competition, search and coordination failures, central bank operations, and evolution of monetary institutions. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON221B"
  },
  {
    "course_code": "ECON 221C",
    "units": 4,
    "title": "Monetary Economics III",
    "description": "Lecture, three hours. Requisites: courses 202A, 202B, 202C. Emphasis on quantitative dynamic models useful in study of equilibrium business cycles and public finance. Recursive competitive equilibria in representative agent overlapping-generation models, including models with money, taxes, liquidity constraints, and other distortions. S/U or letter grading.",
    "prerequisites": [
      "ECON 202A",
      "ECON 202B",
      "ECON 202C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON221C"
  },
  {
    "course_code": "ECON 221D",
    "units": 4,
    "title": "Monetary Economics IV",
    "description": "Lecture, three hours. Requisites: courses 202A, 202B, 202C. Emphasis on applied macroeconomics, with topic change each year. Students select one particular data set to study. Each week class studies article from recent work in applied macroeconomics or applied econometrics that teaches one technique or suggests one theoretical restriction on data. Subgroups of students report back to class using technique on their selected data set. S/U or letter grading.",
    "prerequisites": [
      "ECON 202A",
      "ECON 202B",
      "ECON 202C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON221D"
  },
  {
    "course_code": "ECON 222B",
    "units": 4,
    "title": "Topics in Monetary Economics",
    "description": "Lecture, three hours. Current research in monetary economics. Content varies. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON222B"
  },
  {
    "course_code": "ECON 222C",
    "units": 4,
    "title": "Topics in Monetary Economics",
    "description": "Lecture, three hours. Current research in monetary economics. Content varies. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON222C"
  },
  {
    "course_code": "ECON 222D",
    "units": 4,
    "title": "Topics in Monetary Economics",
    "description": "Lecture, three hours. Current research in monetary economics. Content varies. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON222D"
  },
  {
    "course_code": "ECON C226A",
    "units": 4,
    "title": "Seminar: Monetary Economics/Macroeconomics",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in monetary economics and macroeconomics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C166A. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC226A"
  },
  {
    "course_code": "ECON C226B",
    "units": 4,
    "title": "Seminar: Monetary Economics/Macroeconomics",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in monetary economics and macroeconomics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C166B. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC226B"
  },
  {
    "course_code": "ECON C226C",
    "units": 4,
    "title": "Seminar: Monetary Economics/Macroeconomics",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in monetary economics and macroeconomics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C166C. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC226C"
  },
  {
    "course_code": "ECON 228A",
    "units": 4,
    "title": "Proseminar: Monetary Economics",
    "description": "Seminar, three hours. Workshops for predissertation and dissertation writers. Literature surveys or research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper or presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON228A"
  },
  {
    "course_code": "ECON 228B",
    "units": 4,
    "title": "Proseminar: Monetary Economics",
    "description": "Seminar, three hours. Workshops for predissertation and dissertation writers. Literature surveys or research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper or presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON228B"
  },
  {
    "course_code": "ECON 228C",
    "units": 4,
    "title": "Proseminar: Monetary Economics",
    "description": "Seminar, three hours. Workshops for predissertation and dissertation writers. Literature surveys or research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper or presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON228C"
  },
  {
    "course_code": "ECON 229A",
    "units": 4,
    "title": "Workshop: Monetary Economics",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON229A"
  },
  {
    "course_code": "ECON 229B",
    "units": 4,
    "title": "Workshop: Monetary Economics",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON229B"
  },
  {
    "course_code": "ECON 229C",
    "units": 4,
    "title": "Workshop: Monetary Economics",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON229C"
  },
  {
    "course_code": "ECON 231A",
    "units": 4,
    "title": "Advanced Econometrics I",
    "description": "Lecture, three hours. Econometric methods for microeconometric models. Topics include identification, nonparametric estimation, limited dependent variable models, duration, panel data, tests of hypotheses. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON231A"
  },
  {
    "course_code": "ECON 231B",
    "units": 4,
    "title": "Advanced Econometrics II",
    "description": "Lecture, three hours. Econometric methods for empirical research in economics. Topics include simultaneous equations, instrumental variables, panel data, treatment effects, and point and partial identification, with applications in static and dynamic games, social interactions, matching, and network formation. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON231B"
  },
  {
    "course_code": "ECON 231C",
    "units": 4,
    "title": "Advanced Econometrics III",
    "description": "Lecture, three hours. Advanced topics in econometrics that may vary year to year. Current topics include empirical process methods with applications to quantile regression and general M-estimation, estimation and inference methods in high-dimensional models, including LASSO and Dantzig Selector techniques, and bootstrap. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON231C"
  },
  {
    "course_code": "ECON M232A",
    "units": 4,
    "title": "Topics in Econometrics: Bayesian Econometrics",
    "description": "(Same as Political Science M208E.) Lecture, three hours. Requisites: courses 231A, 231B. Subjective probability, introduction to decision theory, Bayesian analysis of regression, sensitivity analysis, simplification of models, criticism. May be repeated for credit. S/U or letter grading.",
    "prerequisites": [
      "ECON 231A",
      "ECON 231B"
    ],
    "cross_listed": [
      "POL SCI M208E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONM232A"
  },
  {
    "course_code": "ECON 232B",
    "units": 4,
    "title": "Topics in Econometrics: Time Series",
    "description": "Lecture, three hours. Requisites: courses 231A, 231B. Stationary stochastic processes, Box/Jenkins methods, spectral analysis, forecasting, rational expectation models, analysis of macroeconomic data. May be repeated for credit. S/U or letter grading.",
    "prerequisites": [
      "ECON 231A",
      "ECON 231B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON232B"
  },
  {
    "course_code": "ECON 232D",
    "units": 4,
    "title": "Topics in Econometrics",
    "description": "Lecture, three hours. Requisites: courses 231A, 231B. Current research in econometrics. Content varies. Courses in this sequence not ordinarily given every year. May be repeated for credit. S/U or letter grading.",
    "prerequisites": [
      "ECON 231A",
      "ECON 231B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON232D"
  },
  {
    "course_code": "ECON 232E",
    "units": 4,
    "title": "Topics in Econometrics",
    "description": "Lecture, three hours. Requisites: courses 231A, 231B. Current research in econometrics. Content varies. Courses in this sequence not ordinarily given every year. May be repeated for credit. S/U or letter grading.",
    "prerequisites": [
      "ECON 231A",
      "ECON 231B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON232E"
  },
  {
    "course_code": "ECON 232F",
    "units": 4,
    "title": "Topics in Econometrics",
    "description": "Lecture, three hours. Requisites: courses 231A, 231B. Current research in econometrics. Content varies. Courses in this sequence not ordinarily given every year. May be repeated for credit. S/U or letter grading.",
    "prerequisites": [
      "ECON 231A",
      "ECON 231B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON232F"
  },
  {
    "course_code": "ECON 232M",
    "units": 4,
    "title": "Topics in Econometrics",
    "description": "Lecture, three hours. Requisites: courses 231A, 231B. Current research in econometrics. Content varies. Courses in this sequence not ordinarily given every year. May be repeated for credit. S/U or letter grading.",
    "prerequisites": [
      "ECON 231A",
      "ECON 231B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON232M"
  },
  {
    "course_code": "ECON 238A",
    "units": 4,
    "title": "Proseminar: Econometrics",
    "description": "Seminar, three hours. Quarterly seminar for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Research paper or presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON238A"
  },
  {
    "course_code": "ECON 238B",
    "units": 4,
    "title": "Proseminar: Econometrics",
    "description": "Seminar, three hours. Quarterly seminar for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Research paper or presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON238B"
  },
  {
    "course_code": "ECON 238C",
    "units": 4,
    "title": "Proseminar: Econometrics",
    "description": "Seminar, three hours. Quarterly seminar for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Research paper or presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON238C"
  },
  {
    "course_code": "ECON 239A",
    "units": 4,
    "title": "Workshop: Econometrics",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON239A"
  },
  {
    "course_code": "ECON 239B",
    "units": 4,
    "title": "Workshop: Econometrics",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON239B"
  },
  {
    "course_code": "ECON 239C",
    "units": 4,
    "title": "Workshop: Econometrics",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON239C"
  },
  {
    "course_code": "ECON 241",
    "units": 4,
    "title": "Economic History of Western Europe",
    "description": "Lecture, three hours. Designed for graduate students. Seminar on European economic history, with emphasis on evolution of institutions and growth. Serfdom, medieval agriculture and agricultural revolution, demographics, industrial revolution, imperial expansion, and decline of Britain. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON241"
  },
  {
    "course_code": "ECON 242",
    "units": 4,
    "title": "Economic History of U.S.",
    "description": "Lecture, three hours. Seminar on American economic history. Onset of industrialization, relative economic backwardness of South, slavery, technological change, rise in industrial concentration, women in labor force, development of financial markets. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON242"
  },
  {
    "course_code": "ECON 243A",
    "units": 4,
    "title": "Topics in Economic History",
    "description": "Lecture, three hours. Current research in economic history. Content varies. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON243A"
  },
  {
    "course_code": "ECON 244",
    "units": 4,
    "title": "U.S. Labor Markets and Public Programs since 1940",
    "description": "Lecture, three hours. Designed for PhD students. Introduction to current research at intersection of labor economics, public economics, and U.S. economic history, focusing on period after 1940. Topics include economic and wage inequality; intergenerational mobility; increasing (and stalling) educational attainment; changes in health and health care; Great Migration; gender gap in pay and rise of married women’s market work; baby boom and bust; racial inequality from slavery to Civil Rights era; and war on poverty. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON244"
  },
  {
    "course_code": "ECON C246A",
    "units": 4,
    "title": "Seminar: Economic History",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in economic history for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C186A. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC246A"
  },
  {
    "course_code": "ECON C246B",
    "units": 4,
    "title": "Seminar: Economic History",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in economic history for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C186B. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC246B"
  },
  {
    "course_code": "ECON C246C",
    "units": 4,
    "title": "Seminar: Economic History",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in economic history for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C186C. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC246C"
  },
  {
    "course_code": "ECON 248A",
    "units": 4,
    "title": "Proseminar: Economic History",
    "description": "Seminar, three hours. Quarterly seminar for predissertation and dissertation writers. Discussion of advanced topics and recent developments in economic history. Presentation of work-in-progress. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON248A"
  },
  {
    "course_code": "ECON 248B",
    "units": 4,
    "title": "Proseminar: Economic History",
    "description": "Seminar, three hours. Quarterly seminar for predissertation and dissertation writers. Discussion of advanced topics and recent developments in economic history. Presentation of work-in-progress. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON248B"
  },
  {
    "course_code": "ECON 248C",
    "units": 4,
    "title": "Proseminar: Economic History",
    "description": "Seminar, three hours. Quarterly seminar for predissertation and dissertation writers. Discussion of advanced topics and recent developments in economic history. Presentation of work-in-progress. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON248C"
  },
  {
    "course_code": "ECON 249A",
    "units": 4,
    "title": "Von Gremp Workshop: History of Entrepreneurship in U.S. Economy",
    "description": "Lecture, three hours. Designed for graduate students. Workshops for advanced graduate students. Research in progress discussed by visiting experts, UCLA faculty members, graduate students. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON249A"
  },
  {
    "course_code": "ECON 249B",
    "units": 4,
    "title": "Von Gremp Workshop: History of Entrepreneurship in U.S. Economy",
    "description": "Lecture, three hours. Designed for graduate students. Workshops for advanced graduate students. Research in progress discussed by visiting experts, UCLA faculty members, graduate students. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON249B"
  },
  {
    "course_code": "ECON 249C",
    "units": 4,
    "title": "Von Gremp Workshop: History of Entrepreneurship in U.S. Economy",
    "description": "Lecture, three hours. Designed for graduate students. Workshops for advanced graduate students. Research in progress discussed by visiting experts, UCLA faculty members, graduate students. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON249C"
  },
  {
    "course_code": "ECON 251A",
    "units": 4,
    "title": "Theory and Policy of Taxation",
    "description": "Lecture, three hours. Examination of influence of taxation on economic efficiency and incidence of taxation in first part of course. Topics include tax equivalences, Ramsey rules, and alternative forms of taxation. Special tax provisions, tax incentives, and progressivity in taxation in second part of course. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON251A"
  },
  {
    "course_code": "ECON 251B",
    "units": 4,
    "title": "Cost-Benefit Analysis of Public Projects and Programs",
    "description": "Lecture, three hours. Requisite: course 251A. Presentation of those aspects of applied capital theory that are relevant in decisions concerning investment projects in first part of course. Differences between social and private benefits and costs (shadow prices) for foreign exchange, capital, and labor, with applications to public investment decisions, in second part of course. S/U or letter grading.",
    "prerequisites": [
      "ECON 251A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON251B"
  },
  {
    "course_code": "ECON 252",
    "units": 4,
    "title": "Economics of Federalism",
    "description": "Lecture, three hours. Theories of perfect games and social organization. Role of government, collective goods, collective defense, local public goods, spillovers, and intergovernmental relations. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON252"
  },
  {
    "course_code": "ECON 253A",
    "units": 4,
    "title": "Topics in Public Finance",
    "description": "Lecture, three hours. Current research in public finance. Content varies. Topics include Social Security taxes and programs, unemployment insurance, public provision of medical care, theory of public goods, and theory of public choice. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON253A"
  },
  {
    "course_code": "ECON 253B",
    "units": 4,
    "title": "Topics in Public Finance",
    "description": "Lecture, three hours. Current research in public finance. Content varies. Topics include Social Security taxes and programs, unemployment insurance, public provision of medical care, theory of public goods, and theory of public choice. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON253B"
  },
  {
    "course_code": "ECON 254A",
    "units": 4,
    "title": "Workshop: Public Economics",
    "description": "Lecture, three hours. Designed for graduate students. Workshops for advanced graduate students. Research in progress discussed by graduate students, UCLA faculty members, visiting experts. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON254A"
  },
  {
    "course_code": "ECON 254B",
    "units": 4,
    "title": "Workshop: Public Economics",
    "description": "Lecture, three hours. Designed for graduate students. Workshops for advanced graduate students. Research in progress discussed by graduate students, UCLA faculty members, visiting experts. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON254B"
  },
  {
    "course_code": "ECON 254C",
    "units": 4,
    "title": "Workshop: Public Economics",
    "description": "Lecture, three hours. Designed for graduate students. Workshops for advanced graduate students. Research in progress discussed by graduate students, UCLA faculty members, visiting experts. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON254C"
  },
  {
    "course_code": "ECON 261A",
    "units": 4,
    "title": "Labor Economics I",
    "description": "Lecture, three hours. Wage determination in competitive labor markets. Extension of wage determination to schooling and occupational choice, life-cycle earnings profiles, discrimination, minimum wage legislation, and unionism. Emphasis on empirical literature. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON261A"
  },
  {
    "course_code": "ECON 261B",
    "units": 4,
    "title": "Labor Economics II",
    "description": "Lecture, three hours. Requisite: course 261A. Models of life-cycle learning and work behavior, with particular emphasis on recent literature examining labor force behavior and experience of women. S/U or letter grading.",
    "prerequisites": [
      "ECON 261A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON261B"
  },
  {
    "course_code": "ECON 262A",
    "units": 4,
    "title": "Topics in Labor Economics",
    "description": "Lecture, three hours. Current research in labor economics. Content varies. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON262A"
  },
  {
    "course_code": "ECON 262D",
    "units": 4,
    "title": "Development Economics",
    "description": "Lecture, three hours. Preparation: completion of first-year graduate microeconomics and econometrics courses. Focus on issues in development economics with emphasis on issues in micro-development. Covers both theoretical and empirical contributions, with particular emphasis on most recent research advances in field. Covers topics from development perspective related to gender and family economics, history, institutions, culture, education, health, agriculture, and risk-sharing. Emphasis on developing skills to implement commonly-used research methods. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON262D"
  },
  {
    "course_code": "ECON 262F",
    "units": 4,
    "title": "Topics in Labor Economics: Public Sector Microeconomics",
    "description": "Lecture, three hours. Preparation: completion of first-year graduate microeconomics and econometrics courses. Coverage of topics related to tax incidence, deadweight loss, public expenditure, income taxation and transfer programs, with emphasis on impacts of such programs on labor supply and savings, social security, unemployment insurance, and other insurance programs. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON262F"
  },
  {
    "course_code": "ECON 262P",
    "units": 4,
    "title": "Topics in Labor Economics",
    "description": "Lecture, three hours. Current research in labor economics. Content varies. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON262P"
  },
  {
    "course_code": "ECON 263",
    "units": 4,
    "title": "Topics in Urban Economics",
    "description": "Lecture, three hours. Current research in urban and regional economics. Content varies. Serves as forum for presentation of papers on urban economics by students, UCLA faculty members, and visitors. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON263"
  },
  {
    "course_code": "ECON 264A",
    "units": 4,
    "title": "General Equilibrium and Finance",
    "description": "Lecture, three hours. Designed for graduate students. Introduction to mathematical finance from general equilibrium viewpoint. CAPM and static equilibrium models. Intertemporal models in discrete and continuous time. Spanning, option prices, and derivatives. Martingales, random walks, and market efficiency. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON264A"
  },
  {
    "course_code": "ECON 264B",
    "units": 4,
    "title": "Fundamentals and Bubbles in Asset Prices",
    "description": "Lecture, three hours. Requisite: course 264A. Designed for graduate students. Applications of dynamic general equilibrium to asset pricing in economies with exchange and production. Basic empirical puzzles in U.S. and international asset prices, 1880 to 2000: excess volatility, equity premium and risk-free rate puzzle, predictability. Models of habit formation, asset price bubbles, and limited arbitrage asset pricing theories. Market imperfections and bounded rationality. S/U or letter grading.",
    "prerequisites": [
      "ECON 264A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON264B"
  },
  {
    "course_code": "ECON 264C",
    "units": 4,
    "title": "Asset Prices, Forecasting, and Learning",
    "description": "Lecture, three hours. Requisite: course 264A. Designed for graduate students. Introduction to forecasting methods and applications to asset pricing. Signal-extraction under different uncertainty specifications. Kalman filtering and forecasting. Robust filtering and forecasting. Models of behavioral finance. Stylized facts on forecasts and asset pricing anomalies: short-term momentum and long-term reversals of returns. Option pricing anomalies. S/U or letter grading.",
    "prerequisites": [
      "ECON 264A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON264C"
  },
  {
    "course_code": "ECON 264D",
    "units": 4,
    "title": "Econometrics of Asset Prices",
    "description": "Lecture, three hours. Requisite: course 264A. Designed for graduate students. Applications of time-series methods to analysis of asset prices: general method of moments, vector autoregressions, and maximum likelihood estimation. Restrictions imposed by no-arbitrage on time series of returns. Empirical implications of macroeconomic models for asset prices. Response of asset prices to shocks. Incomplete markets. S/U or letter grading.",
    "prerequisites": [
      "ECON 264A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON264D"
  },
  {
    "course_code": "ECON C266A",
    "units": 4,
    "title": "Seminar: Labor Economics",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in labor economics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C156A. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC266A"
  },
  {
    "course_code": "ECON C266B",
    "units": 4,
    "title": "Seminar: Labor Economics",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in labor economics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C156B. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC266B"
  },
  {
    "course_code": "ECON C266C",
    "units": 4,
    "title": "Seminar: Labor Economics",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in labor economics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C156C. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC266C"
  },
  {
    "course_code": "ECON 268A",
    "units": 4,
    "title": "Proseminar: Labor and Population",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers working on empirical issues in areas of labor and population, broadly defined. Presentation of work-in-progress or background material for proposed thesis topics, to be discussed and criticized by faculty and fellow students. Presentation or research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON268A"
  },
  {
    "course_code": "ECON 268B",
    "units": 4,
    "title": "Proseminar: Labor and Population",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers working on empirical issues in areas of labor and population, broadly defined. Presentation of work-in-progress or background material for proposed thesis topics, to be discussed and criticized by faculty and fellow students. Presentation or research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON268B"
  },
  {
    "course_code": "ECON 268C",
    "units": 4,
    "title": "Proseminar: Labor and Population",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers working on empirical issues in areas of labor and population, broadly defined. Presentation of work-in-progress or background material for proposed thesis topics, to be discussed and criticized by faculty and fellow students. Presentation or research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON268C"
  },
  {
    "course_code": "ECON 269A",
    "units": 4,
    "title": "Workshop: Labor Economics",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON269A"
  },
  {
    "course_code": "ECON 269B",
    "units": 4,
    "title": "Workshop: Labor Economics",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON269B"
  },
  {
    "course_code": "ECON 269C",
    "units": 4,
    "title": "Workshop: Labor Economics",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON269C"
  },
  {
    "course_code": "ECON 271A",
    "units": 4,
    "title": "Industrial Organization, Price Policies, and Regulation I",
    "description": "Lecture, three hours. Major economic aspects of property rights system. Firm and market compared from perspective of alternative arrangements for allocating resources. Traditional problems of competition, monopoly, and industrial concentration. Brief analysis of those portions of antitrust policy bearing on industrial structure. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON271A"
  },
  {
    "course_code": "ECON 271B",
    "units": 4,
    "title": "Industrial Organization, Price Policies, and Regulation II",
    "description": "Lecture, three hours. Requisite: course 271A. Study of firm organization and pricing under conditions of less than perfect competition; information costs and advertising; economic and legal analysis of marketing practices such as discrimination, tie-in selling, resale price maintenance, exclusive dealing, and territorial arrangements. S/U or letter grading.",
    "prerequisites": [
      "ECON 271A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON271B"
  },
  {
    "course_code": "ECON 271C",
    "units": 4,
    "title": "Mathematical Theory in Industrial Organization",
    "description": "Lecture, three hours. Requisites: courses 201A, 201B, 201C. Formal modeling of theory of industrial organization: principal-agent problem, entry deterrence, endogenous price discrimination, monopolistic competition, new approaches to rationality. S/U or letter grading.",
    "prerequisites": [
      "ECON 201A",
      "ECON 201B",
      "ECON 201C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON271C"
  },
  {
    "course_code": "ECON 272A",
    "units": 4,
    "title": "Topics in Industrial Organization",
    "description": "Lecture, three hours. Current research in industrial organization. Content varies. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON272A"
  },
  {
    "course_code": "ECON 273A",
    "units": 4,
    "title": "Public Utility Regulation",
    "description": "Lecture, three hours. Theory, practice, and consequences of regulation in electric power, gas, water, telecommunications, broadcasting, and other regulated experiences of unregulated monopoly and public enterprises by way of contrast. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON273A"
  },
  {
    "course_code": "ECON C276A",
    "units": 4,
    "title": "Seminar: Industrial Organization",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in industrial organization for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C176A. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC276A"
  },
  {
    "course_code": "ECON C276B",
    "units": 4,
    "title": "Seminar: Industrial Organization",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in industrial organization for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C176B. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC276B"
  },
  {
    "course_code": "ECON C276C",
    "units": 4,
    "title": "Seminar: Industrial Organization",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in industrial organization for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C176C. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC276C"
  },
  {
    "course_code": "ECON 278A",
    "units": 4,
    "title": "Proseminar: Industrial Organization and Regulation",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers to discuss advanced topics and recent developments in industrial organization and regulation. Presentation of work-in-progress for feedback from faculty and fellow students. Presentation or research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON278A"
  },
  {
    "course_code": "ECON 278B",
    "units": 4,
    "title": "Proseminar: Industrial Organization and Regulation",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers to discuss advanced topics and recent developments in industrial organization and regulation. Presentation of work-in-progress for feedback from faculty and fellow students. Presentation or research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON278B"
  },
  {
    "course_code": "ECON 278C",
    "units": 4,
    "title": "Proseminar: Industrial Organization and Regulation",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers to discuss advanced topics and recent developments in industrial organization and regulation. Presentation of work-in-progress for feedback from faculty and fellow students. Presentation or research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON278C"
  },
  {
    "course_code": "ECON 279A",
    "units": 4,
    "title": "Workshop: Business Organization",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON279A"
  },
  {
    "course_code": "ECON 279B",
    "units": 4,
    "title": "Workshop: Business Organization",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON279B"
  },
  {
    "course_code": "ECON 279C",
    "units": 4,
    "title": "Workshop: Business Organization",
    "description": "Lecture, three hours. Workshops for predissertation and dissertation writers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, advanced graduate students. Research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON279C"
  },
  {
    "course_code": "ECON 281A",
    "units": 4,
    "title": "International Trade Theory",
    "description": "Lecture, three hours. Theoretical and empirical analysis of microeconomic relationships among countries. Determinants of commodity and factor flows, prices, and factor rewards. Effects of trade barriers. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON281A"
  },
  {
    "course_code": "ECON 281B",
    "units": 4,
    "title": "International Finance",
    "description": "Lecture, three hours. Theory and evidence on balance of payments, exchange rate determination, international transmission of inflation and business cycles, macroeconomic policy in open economies, alternative monetary systems. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON281B"
  },
  {
    "course_code": "ECON 281C",
    "units": 4,
    "title": "International Economics",
    "description": "Lecture, three hours. Theoretical and empirical analysis of interrelation between flows of capital, people, and goods. Applications to current policy. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON281C"
  },
  {
    "course_code": "ECON 282A",
    "units": 4,
    "title": "Topics in International Economics",
    "description": "Lecture, three hours. Current research in international economics. Content varies. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON282A"
  },
  {
    "course_code": "ECON 282B",
    "units": 4,
    "title": "Topics in International Economics",
    "description": "Lecture, three hours. Current research in international economics. Content varies. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON282B"
  },
  {
    "course_code": "ECON 282C",
    "units": 4,
    "title": "Topics in International Economics",
    "description": "Lecture, three hours. Current research in international economics. Content varies. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON282C"
  },
  {
    "course_code": "ECON 282D",
    "units": 4,
    "title": "Topics in International Economics",
    "description": "Lecture, three hours. Current research in international economics. Content varies. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON282D"
  },
  {
    "course_code": "ECON 284",
    "units": 4,
    "title": "Soviet Economic Theory and Organization",
    "description": "Lecture, three hours. Overall strategy of planning used by USSR planners and specific planning methods, interpreted broadly to cover not only instructions and objectives but also institutional arrangements. Intended and unintended outcomes of methods. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON284"
  },
  {
    "course_code": "ECON C285A",
    "units": 4,
    "title": "Seminar: International Economics",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in international economics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C126A. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC285A"
  },
  {
    "course_code": "ECON C285B",
    "units": 4,
    "title": "Seminar: International Economics",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in international economics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C126B. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC285B"
  },
  {
    "course_code": "ECON C285C",
    "units": 4,
    "title": "Seminar: International Economics",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in international economics for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C126C. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC285C"
  },
  {
    "course_code": "ECON 286A",
    "units": 4,
    "title": "Economic Development",
    "description": "Lecture, three hours. Requisites: courses 201C, 202C. Study of theoretical and empirical problems related to developing countries. Emphasis on relation between international trade and economic development, dynamic aspects of commercial policies, inflation, stabilization, structural adjustment, growth and migration. S/U or letter grading.",
    "prerequisites": [
      "ECON 201C",
      "ECON 202C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON286A"
  },
  {
    "course_code": "ECON 286B",
    "units": 4,
    "title": "Cost-Benefit Analysis of Development Projects",
    "description": "Lecture, three hours. Requisite: course 286A. Methodology for evaluating investment projects, with special attention to types of issues that arise in developing countries. Discussion of social versus private evaluation criteria; applications to highway, electricity, and irrigation projects. S/U or letter grading.",
    "prerequisites": [
      "ECON 286A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON286B"
  },
  {
    "course_code": "ECON 287A",
    "units": 4,
    "title": "Topics in Development Economics: Economic Problems of Latin America",
    "description": "Lecture, three hours. Economic history of Latin America. Great depression, import substitution and industrialization, inflation and growth, free market experiments, and economic integration. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON287A"
  },
  {
    "course_code": "ECON 287B",
    "units": 4,
    "title": "Topics in Development Economics: Economic Development in East Asia",
    "description": "Lecture, three hours. Recent economic history of East Asia, focusing on postwar development of Japan, Korea, and China. Emphasis on role of international investment and trade, especially with U.S., in area’s economic development. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON287B"
  },
  {
    "course_code": "ECON 287C",
    "units": 4,
    "title": "Topics in Development Economics: Economic Development",
    "description": "Lecture, three hours. Designed for graduate students. Topics in monetary and exchange rate policy in developing countries. Students expected to develop analytical tools and underlying policy issues. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON287C"
  },
  {
    "course_code": "ECON 287D",
    "units": 4,
    "title": "Topics in Development Economics",
    "description": "Lecture, three hours. Current research in development economics. Content varies. Courses in this sequence not ordinarily given every year. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON287D"
  },
  {
    "course_code": "ECON 288A",
    "units": 4,
    "title": "Proseminar: International and Development Economics",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers on current issues in international trade and finance and development economics. Presentation of work-in-progress for feedback from faculty and other graduate students. Presentation or research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON288A"
  },
  {
    "course_code": "ECON 288B",
    "units": 4,
    "title": "Proseminar: International and Development Economics",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers on current issues in international trade and finance and development economics. Presentation of work-in-progress for feedback from faculty and other graduate students. Presentation or research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON288B"
  },
  {
    "course_code": "ECON 288C",
    "units": 4,
    "title": "Proseminar: International and Development Economics",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers on current issues in international trade and finance and development economics. Presentation of work-in-progress for feedback from faculty and other graduate students. Presentation or research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON288C"
  },
  {
    "course_code": "ECON 291A",
    "units": 4,
    "title": "Asset Pricing",
    "description": "Lecture, three hours. Introduction to models of firm dynamics, their use in modeling valuation of firms, and embedding of these models in general equilibrium for purposes of understanding market valuation of corporate sector as whole. Introduction also to continuous-time search-and-matching models and their applications to financial economics. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON291A"
  },
  {
    "course_code": "ECON 291B",
    "units": 4,
    "title": "Asset Pricing",
    "description": "Lecture, three hours. Recent theoretical and empirical research on monetary policy. Includes issues such as how monetary policy is implemented in practice. What are effects of different monetary policy tools, what restrictions on government does monetary policy impose, transmission mechanisms of monetary policy, welfare costs of inflation, how does monetary policy interact with credit markets and how does it affect asset prices. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON291B"
  },
  {
    "course_code": "ECON C296A",
    "units": 4,
    "title": "Seminar: Asset Pricing",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in asset pricing theory for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C146A. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC296A"
  },
  {
    "course_code": "ECON C296B",
    "units": 4,
    "title": "Seminar: Asset Pricing",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in asset pricing theory for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C146B. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC296B"
  },
  {
    "course_code": "ECON C296C",
    "units": 4,
    "title": "Seminar: Asset Pricing",
    "description": "Seminar, three hours. Designed for predissertation and dissertation writers. Overview of most current developments in asset pricing theory for advanced undergraduate and graduate students. Introduction to graduate-level research in this field. Different topic each week, with presentation and discussion of new papers. Research in progress presented, discussed, and criticized by visiting experts, UCLA faculty members, and advanced graduate students. Concurrently scheduled with course C146C. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECONC296C"
  },
  {
    "course_code": "ECON 298A",
    "units": 4,
    "title": "Proseminar: Asset Pricing",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers on empirical issues in area of asset pricing, broadly defined. Presentation of work-in-progress or background material for proposed dissertation topics that are discussed and criticized by faculty members and fellow students. Presentation or research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON298A"
  },
  {
    "course_code": "ECON 298B",
    "units": 4,
    "title": "Proseminar: Asset Pricing",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers on empirical issues in area of asset pricing, broadly defined. Presentation of work-in-progress or background material for proposed dissertation topics that are discussed and criticized by faculty members and fellow students. Presentation or research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON298B"
  },
  {
    "course_code": "ECON 298C",
    "units": 4,
    "title": "Proseminar: Asset Pricing",
    "description": "Seminar, three hours. Quarterly seminars for predissertation and dissertation writers on empirical issues in area of asset pricing, broadly defined. Presentation of work-in-progress or background material for proposed dissertation topics that are discussed and criticized by faculty members and fellow students. Presentation or research paper required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON298C"
  },
  {
    "course_code": "ECON 401A",
    "units": 4,
    "title": "Microeconomic Theory",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Coverage of fundamentals of optimization, choices by price-taking agents, consumer and producer surplus, monopoly and competition, Walrasian equilibrium and two welfare theorems, constant returns to scale economy, choice over time, uncertainty, and information and market design. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON401A"
  },
  {
    "course_code": "ECON 401B",
    "units": 4,
    "title": "Applied Economics",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. How to be sophisticated users and producers of research on issues and policies in several core areas of labor, public, and health economics. Rigorous analyses of core policy questions with cutting-edge empirical analysis. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON401B"
  },
  {
    "course_code": "ECON 402A",
    "units": 4,
    "title": "Macroeconomic Theory",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Introduction to main topics of graduate macroeconomics, including macroeconomic data, models of economic growth, supply and demand of factors of production, business cycle models, unemployment, monetary policy and inflation, and fiscal policy and deficits. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON402A"
  },
  {
    "course_code": "ECON 402B",
    "units": 4,
    "title": "Applied Macroeconomics",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Study of alternative theories of causes of unemployment and inflation, with focus on Keynesian approach to monetary and fiscal policy and modifications and extensions of Keynesian ideas designed to explain financial crises. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON402B"
  },
  {
    "course_code": "ECON 403A",
    "units": 4,
    "title": "Introduction to Statistical Methods and Econometrics",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Introduction to probability, statistics, econometrics, and time-series methods used in economics, business, and government. Topics include random variables, hypothesis testing, estimation, distribution functions, simple and multiple regression, and estimation with stationary/nonstationary processes. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON403A"
  },
  {
    "course_code": "ECON 403B",
    "units": 4,
    "title": "Applied Econometrics",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Basic tools necessary for high-level cutting-edge empirical research. Coverage of variety of methods suited for empirical studies that apply to experimental data, quasi-experimental data, panel data, and cross-sectional data. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON403B"
  },
  {
    "course_code": "ECON 404A",
    "units": 4,
    "title": "Writing and Presentation Skills for Economists I",
    "description": "Seminar, three hours. Limited to Master of Applied Economics students. Designed to help students develop communication and presentation skills essential for success in any aspect of business. Practice in writing economics documents for variety of professional audiences. Writing taught as process—brainstorming, collaborating, continually revising, and challenging ideas. Presentation skills to focus on presenting information clearly and organizing ideas, with emphasis on role of audience when presenting, because audience determines diction, style, tone, organization, research, and ideas. Grammar incorporated as needed, especially in regard to writing. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON404A"
  },
  {
    "course_code": "ECON 404B",
    "units": 4,
    "title": "Writing and Presentation Skills for Economists II",
    "description": "Seminar, three hours. Limited to Master of Applied Economics students. Builds on skills learned in course 404A. Writing component to focus on summarizing, critiquing, and report writing. Process writing used and self-editing skills stressed. Presentations include summary/critique, opinion piece, and final group presentation that includes proposals. Grammar incorporated as needed, especially in regard to writing. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON404B"
  },
  {
    "course_code": "ECON 405",
    "units": 4,
    "title": "Macroeconomic Implications of Globalization",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Development of understanding of some main macroeconomic implications of increasing integration of world economy through trade linkages, multinational production, and financial markets. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON405"
  },
  {
    "course_code": "ECON 406",
    "units": 4,
    "title": "Money and Banking",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Introduction to models and data used to understand connection between asset prices, health of financial sector, and macroeconomy, including review of recent papers to gain introduction to questions being addressed on research frontier. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON406"
  },
  {
    "course_code": "ECON 407",
    "units": 1,
    "title": "Economics of Entrepreneurship",
    "description": "Lecture, three hours. Limited to Master of Quantitative Economics students. Examination of role of entrepreneurship and entrepreneurial strategies—source of ideas, value creation, market development, scaling, exit strategies. Group practice of entrepreneurship. Development of original ideas into business plans. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON407"
  },
  {
    "course_code": "ECON 408",
    "units": 4,
    "title": "Environmental Economics",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Introduction to major ideas in environmental economics by studying causes and consequences of pollution, with special emphasis on understanding China’s environmental challenges and policy options. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON408"
  },
  {
    "course_code": "ECON 409",
    "units": 1,
    "title": "Forecasting Asset Prices",
    "description": "Lecture, three hours. Limited to Master of Quantitative Economics students. Introduction to recent developments in international finance. Coverage of lending booms and financial crises both theoretically and empirically, as well as foreign exchange market anomalies and different approaches to forecasting exchange rates. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON409"
  },
  {
    "course_code": "ECON 410",
    "units": 1,
    "title": "Economists in Action",
    "description": "Seminar, three hours. Limited to Master of Applied Economics students. How theory maps into policymaking. Renowned policymakers from Central Banks, Economics Ministries, and International Organizations to lecture on policy-relevant topics. Completion of assignments linking lectures with economic theory and real-world events. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON410"
  },
  {
    "course_code": "ECON 411",
    "units": 4,
    "title": "Inequality and Macroeconomy",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Introduction to analysis of economic inequalities and interplay between inequality and macroeconomy. What are relative roles of market forces and institutions in shaping dynamics of economic inequality? What are consequences of globalization on distribution of income within and between countries? Does inequality hamper economic growth and macroeconomic stability? How do macroeconomic policies and structural reforms affect distribution of income and wealth? Use of simple models and empirical analysis by taking global and historical perspective. Discussions about inequality in U.S. and Europe over last two centuries, as well as challenges raised by recent inequality trends in China, India, and Latin America. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON411"
  },
  {
    "course_code": "ECON 412",
    "units": 4,
    "title": "Fundamentals of Big Data",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Introduction to basic concepts, uses, and challenges of big data, with emphasis on pragmatic hands-on applications using real-world data for current and future big data practitioners—consumers of big data insights for economic applications. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON412"
  },
  {
    "course_code": "ECON 413",
    "units": 4,
    "title": "Data Analytics and Big Data",
    "description": "Lecture, three hours. Recommended corequisite: course 412. Limited to Master of Applied Economics students. Designed for end users of big data, those who translate analytic results into business applications, with guest lecturers from wide spectrum of industrial and corporate big data users. Presentations of their business models for leveraging big data, sharing of data sets, and guiding students to extract actionable business insights for those industries. Letter grading.",
    "prerequisites": [
      "ECON 412"
    ],
    "corequisites": [
      "ECON 412"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON413"
  },
  {
    "course_code": "ECON 414",
    "units": 4,
    "title": "Asset Pricing and Portfolio Theory in Practice",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Study covers asset pricing and portfolio theory, critical areas for deeper understanding of financial markets and investments. Building from theory, incorporation of empirical analysis and real-world issues to bridge theory with practice through case studies. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON414"
  },
  {
    "course_code": "ECON 415",
    "units": 4,
    "title": "Evidence-Based Policy Analysis in Labor, Public, and Health Economics",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Introduction to key policy questions in labor, public, and health economics, including health care, education, unemployment, training programs, and welfare. Economic principles at heart of these topics and main approaches to scientifically evaluate policies that affect them, including data, current case evidence, cutting-edge empirical methods, and their relation to microeconomic theory. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON415"
  },
  {
    "course_code": "ECON 421",
    "units": 4,
    "title": "Incentives, Information, and Markets",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Introduction to concepts of information economics that lie at heart of modern economics and application of them to understand incentives within firms, as well as competition between them. Study of theoretical models and functioning of real-life markets, such as insurance, labor, and consumer markets. Consideration of whether we can design policies that improve market outcomes. Role of models in economics, and how to tie data and theory together. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON421"
  },
  {
    "course_code": "ECON 422",
    "units": 4,
    "title": "International Economics",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Investigation of several theoretical frameworks in international economics followed by applications to empirical questions. Neoclassical trade models, analysis of firms and heterogeneous producers, and economic geography topics. Case studies and empirical papers focus on understanding determinants of trade patterns and on measurement of aggregate and distributional effects of international trade. Discussion of recent research on effects of NAFTA and Brexit, effect of trade on inequality in developed and developing countries, and impact of infrastructure investments on trade and development. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON422"
  },
  {
    "course_code": "ECON 423",
    "units": 4,
    "title": "Introduction to Applied Data Science",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Designed to build strong bases in tools and methods of data science and analytics. Introduction of tools for capture, transformation, imputation, visualization, and mapping of data for downstream processing in analytics pipeline. Introduction of analytics subsystems and scalable storage and processing of very large and complex datasets. Information theory, computational analysis, and behavioral economics with specific emphasis on data science in economics. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON423"
  },
  {
    "course_code": "ECON 424",
    "units": 4,
    "title": "Income Inequality",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Investigation of rise of earning inequality (with emphasis on U.S.), focusing on learning how to use models and data to quantify impact of range of forces on inequality. Overview of broad empirical trends, with emphasis on understanding how to document these facts ourselves. Consideration of three classes of potential explanations for these patterns: international connections (e.g., trade and immigration), institutional change (e.g., minimum wage and unionization), and technical change (e.g., computerization and spread of robots). Focus on quantifying these forces ourselves. Study of top income inequality: why have extremely rich become much richer than very rich? Focus on CEO compensation. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON424"
  },
  {
    "course_code": "ECON 425T",
    "units": 4,
    "title": "Machine Learning for Economists",
    "description": "(Formerly numbered 425.) Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Covers set of fundamental machine learning algorithms, models, and theories, and introduces advanced engineering practices for implementing data-intensive intelligent systems. Topics involve both supervised methods (e.g., support vector machine, neural network, etc.) and unsupervised methods (e.g., clustering, dimensionality reduction, etc.), and their applications in classification, regression, data analysis, and visualization. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON425T"
  },
  {
    "course_code": "ECON 426",
    "units": 4,
    "title": "Knowledge Discovery and Data Mining",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Study of theoretical and practical techniques in field of data mining and knowledge discovery. Topics include data processing, association rules, supervised learning, clustering, etc., and their applications in visualization, social network analysis, sentiment mining, and opinion analysis. Focus on making sense of large-scale or web-scale dataset, and providing students with first-hand project experiences. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON426"
  },
  {
    "course_code": "ECON 427",
    "units": 4,
    "title": "Applied Machine Learning",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Preparation: basic understanding of technology principles, basic programming skills, sufficient mathematical background in probability, statistics, and matrix analysis. Foundational course with primary application to data analytics. Intended to be accessible to students from backgrounds such as economics or mathematics, and to students from less technical backgrounds. Covers some fundamental topics in machine learning such as Bayesian learning, optimization for learning, metric learning, and various classification, regression, clustering techniques, and other advanced topics. Real-world data-intensive problems. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON427"
  },
  {
    "course_code": "ECON 428",
    "units": 4,
    "title": "Health Care Analytics: Methods and Applications",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Introduction to basic concepts of health economics. Development of skills in economic modeling and real-world data analysis. Written policy briefs and business cases evaluating pros and cons of different approaches to improving health care markets. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON428"
  },
  {
    "course_code": "ECON 429A",
    "units": 1,
    "title": "Professional Development for Emerging Economists I",
    "description": "Seminar, two hours. Limited to Master of Applied Economics students. Designed to help students develop professional skills essential for success in professional business settings. Aids students in translating topics covered in other courses into language and format that is accessible to industry/non-academic settings. Students conduct labor market research, identify and analyze industry trends, and develop targeted plan to achieve professional success. Exploration of skills identification, goal setting, researching employment market, and résumé writing. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON429A"
  },
  {
    "course_code": "ECON 429B",
    "units": 1,
    "title": "Professional Development for Emerging Economists II",
    "description": "Seminar, two hours. Enforced requisite: course 429A. Limited to Master of Applied Economics students. Designed to help students develop professional, communication, and presentation skills essential for success in professional business settings. Aids students in translating topics covered in other courses into language and format that is accessible to industry/non-academic settings. Students practice presenting for variety of professional audiences. Exploration of presentation skills, personal branding, salary negotiation, and interviewing techniques. Letter grading.",
    "prerequisites": [
      "ECON 429A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON429B"
  },
  {
    "course_code": "ECON 430",
    "units": 3,
    "title": "Applied Econometrics with Python",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Quantitative Economics students. Introduction to econometrics and its applications to economics, business, and government using Python. Topics include simple and multiple regression, cross-sectional and panel data, instrumental variables, and binary choice models. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON430"
  },
  {
    "course_code": "ECON 431",
    "units": 4,
    "title": "Introduction to Econometrics, Cross-Sectional and Panel Data, and Time Series",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Introduction to econometrics, cross-sectional and panel data, and time series methods used in economics, business, and government. Topics include estimation, simple and multiple regression, cross-sectional and panel data, instrumental variables, and estimation with stationary/non-stationary processes. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON431"
  },
  {
    "course_code": "ECON 432",
    "units": 4,
    "title": "Data Science for Financial Time Series",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Quantitative Economics students. Data science provides many useful tools for modeling financial data and testing hypotheses on how markets work, and prices are formed. Study of these important tools. Focus on econometric models and methods to understand financial market dynamics. Topics include returns of financial assets, statistical tests on financial market efficiency, linear time series models, time-varying expected return models, heteroscedastic volatility models, optimal portfolio choice problem, capital asset pricing models, factor models, portfolio allocation, tracking and risk management. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON432"
  },
  {
    "course_code": "ECON 433",
    "units": 4,
    "title": "Core Finance",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Introduction to core principles of asset valuations. Emphasis on common economic reasoning used in valuation problems. Derivations and study of valuation formulas for three broad asset classes: fixed income securities, equity, and derivatives. Practical applications to investment problems, and relation to current financial news. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON433"
  },
  {
    "course_code": "ECON 434",
    "units": 4,
    "title": "Machine Learning and Big Data for Economists",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Discussion of some machine learning techniques including lasso, regression trees, random forests, and neural networks. Covers most recent developments at intersection of machine learning and econometrics, now commonly referred to as double machine learning. Study of double machine learning in detail, and discussion of how to apply it to enhance analysis of classical econometric problems, such as program evaluation and demand estimation. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON434"
  },
  {
    "course_code": "ECON 435",
    "units": 4,
    "title": "Principles of Big Data Management Systems",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Focus on modern data management systems that are used in data analytics. Students are exposed to cutting-edge data management concepts and systems and provided with working knowledge needed to manage large-scale data. Covers modern data management techniques of cloud storage systems, NoSQL databases, and map-reduce computing paradigm. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON435"
  },
  {
    "course_code": "ECON 436",
    "units": 4,
    "title": "Introduction to Financial Accounting",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Financial accounting is concerned with preparation and public dissemination of financial reports designed to reflect corporate performance and financial condition. By providing timely, relevant, and reliable information, these reports facilitate decision-making of investors, creditors, and other interested parties. Financial markets depend on information contained in these reports to evaluate executives, estimate future stock returns, assess firms’ riskiness, and allocate society’s resources to their most productive uses. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON436"
  },
  {
    "course_code": "ECON 437",
    "units": 4,
    "title": "Health Economics: Understanding Roles of Regulation, Public Policy, and Demographic Change",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Applied Economics students. Applied microeconomics study of economics of health care sector. Examination of trends in health care costs, functioning of health care sector, structure of insurance markets, and current public health issues. Study of how underlying economic concepts such as adverse selection and moral hazard lead to market failures. Examination of impact of policy and demographic change on future costs. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON437"
  },
  {
    "course_code": "ECON 441A",
    "units": 1,
    "title": "Applied Data Management for Economists",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Introduction to modern practices in data gathering, cleaning, and warehousing. Topics include web scraping using application programming interfaces, engineering of R packages, and data manipulation in Structured Query Language (SQL). Emphasis on applications of data pipeline expected of entry-level analyst. Supplements Master of Applied Economics coursework by offering solutions to expedite R coding techniques and dissemination of analytic findings. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON441A"
  },
  {
    "course_code": "ECON 441B",
    "units": 1,
    "title": "Applied Data Management for Economists",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Development of student data visualization toolkit using Tableau and Python packages. Focus on techniques to simplistically communicate data, Excel functions/dashboards, Tableau dashboards, Matplot library, and interactive visualizations with Plotly. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON441B"
  },
  {
    "course_code": "ECON 441C",
    "units": 1,
    "title": "Applied Data Management for Economists",
    "description": "Lecture, three hours. Limited to Master of Applied Economics students. Introduction to business intelligence software relevant for big data and financial services companies. Survey of Amazon Web Services, Microsoft Power BI, and Apache Hadoop, and deployment of automated solutions on these platforms. Development of presentation skills necessary for industry. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON441C"
  },
  {
    "course_code": "ECON 442A",
    "units": 1,
    "title": "Econometric Python Laboratory",
    "description": "Laboratory, three hours. Limited to Master of Quantitative Economics students. Simulates tasks of financial researcher by encouraging creative approaches to interest rate monitoring, finding leading indicators, and portfolio construction. Students locate and clean financial datasets, then conduct experiments running significance tests throughout data pipeline. Coursework includes many open questions that offer students opportunities to take novel approaches and investigate forecasting with basket of procedures. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON442A"
  },
  {
    "course_code": "ECON 442B",
    "units": 1,
    "title": "Master of Quantitative Economics Finance Laboratory",
    "description": "Laboratory, three hours. Limited to Master of Quantitative Economics students. Broadens exposure to tasks seen in financial analyst role. Coding tasks are centered around options order book, depth chart, volume profile, cointegrated assets, and commodities data. Theory covered consists of behavioral finance relating to technical analysis, applications of portfolio optimization and hedging techniques. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON442B"
  },
  {
    "course_code": "ECON 442C",
    "units": 1,
    "title": "Master of Quantitative Economics Finance Laboratory",
    "description": "Lecture, three hours. Limited to Master of Quantitative Economics students. Offers hands-on experience in forecasting of assets in capital markets. Using python students pull social media data to create leading indicators of market fundamentals. Forecasting of asset of choice using neural networks and ensemble-weighted machine learning models with fundamental indicators as inputs. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON442C"
  },
  {
    "course_code": "ECON 443",
    "units": 2,
    "title": "SQL and Data Management",
    "description": "Lecture, three hours. Limited to Master of Quantitative Economics students. Introduction to most requested data management tools in industry. Students gain hands-on experience with SQL database queries and database management through integrations with database management systems, query editors, and Python and R programming languages. Students practice saving advanced commands as stored procedures on collective database, simulating tasks seen in real world. Use of Excel and Visual Basic for Applications to make data cleaning, visualization, and data management processes more efficient. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON443"
  },
  {
    "course_code": "ECON 444",
    "units": 1,
    "title": "Stock Market and Fundamental Equity Research Analysis",
    "description": "Lecture, three hours. Limited to Master of Quantitative Economics students. Preparation: basic understanding of finance and financial markets concepts and theories. Exploration of fundamental analysis, method of measuring security’s value by assessing economic and financial factors. Through lectures, readings, and interactive discussions, exploration of macroeconomic and microeconomic factors that affect intrinsic value of security. Study is designed to deepen student exposure to world of fundamental equity research through research and development of investment memorandum. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON444"
  },
  {
    "course_code": "ECON 445",
    "units": 2,
    "title": "Applied Machine Learning for Economists I",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Quantitative Economics students. Exploration of how machine learning can be used to find underpriced real estate opportunities—representative of types of problems frequently faced in industry by analysts, computer scientists, economists, and data scientists. Use of machine learning algorithms and tools to find undervalued assets through applied approach. Exploration, cleaning, wrangling, and analysis of property listings dataset. Use of trees and forests to improve ability to find good deals. Incorporation of additional datasets—demographic and census data—and use of principal component analysis and support vector machines to better identify properties. Use of Python, Pandas, SciKit Learn, Apache Spark, Apache Sedona, and other technologies. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON445"
  },
  {
    "course_code": "ECON 446",
    "units": 2,
    "title": "Applications of Cloud Computing and Blockchain",
    "description": "Lecture, three hours. Limited to Master of Quantitative Economics students. Introduction to cloud services software relevant for big data analytics and data scientists. Survey of Amazon Web Services. Study of automated solutions to data gathering, storage, and machine learning. Students acquire specific skill sets in application programming interfaces and web scraping with Python through hands-on problem solving. Use of blockchain and smart contracts to make business processes more efficient through technical and theoretical application. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON446"
  },
  {
    "course_code": "ECON 447",
    "units": 2,
    "title": "Applied Financial Forecasting and Machine Learning",
    "description": "Lecture, three hours. Requisites: courses 430, 431. Limited to Master of Quantitative Economics students. Outlook of economy is of vital importance for many key decisions. Introduction to theory and application of cutting-edge tools used by economists and business leaders to inform their views of economy. These tools are applied to forecast or nowcast key economic indicators such as inflation, unemployment, and gross domestic product. Examination of how forecasts of fundamentals can be used to inform our views on asset prices. Letter grading.",
    "prerequisites": [
      "ECON 430",
      "ECON 431"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON447"
  },
  {
    "course_code": "ECON 448",
    "units": 2,
    "title": "Teamwork and Leadership in Data Science",
    "description": "Lecture, three hours. Limited to Master of Quantitative Economics students. Teamwork and leadership skills are essential to excelling in virtually any role in any field. Understanding of how teams work and whether, why, and how one can obtain and thrive in leadership role is critical. Students learn how to lead, manage, negotiate, and effectively participate in teams of data scientists, learning from, interacting with, and presenting to data science leaders and other distinguished experts. Students gain practical insights and skills that can be applied in field of data of science, in related fields, and more broadly, in their lives and careers. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON448"
  },
  {
    "course_code": "ECON 449",
    "units": 1,
    "title": "Collaboration and Team Management for Emerging Economists",
    "description": "Seminar, three hours. Limited to Master of Quantitative Economics students. Designed to help students develop social-emotional learning skills through interactive activities and lessons to improve their abilities to succeed in variety of team settings. Lessons and activities are designed to be highly interactive, expressive, and creative and aid students in stress reduction, emotion management, and team building. Students are aided in translating topics covered in other courses into language and format that is accessible to industry/non-academic settings. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON449"
  },
  {
    "course_code": "ECON 450",
    "units": 1,
    "title": "Master of Quantitative Economics Capstone Project",
    "description": "Tutorial, three hours. Limited to Master of Quantitative Economics students. Semi-independent or directed-study in which students complete their capstone project. Capstone project is final element of Master of Quantitative Economics program, and is intended to help students transition from academic studies to professional world. Includes analysis of quantitative and/or qualitative data, research techniques, and writing strategies. Students submit drafts of project components throughout quarter to adviser. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON450"
  },
  {
    "course_code": "ECON 451",
    "units": 4,
    "title": "Financial Institutions and Monetary Policy",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Quantitative Economics students. Study of complex financial architecture that has emerged in last several years, and its evolution over time. Covers institutional detail, and theoretical and empirical research on monetary policy. Development of some basic models and production of Python code to produce plots regarding relevant data. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON451"
  },
  {
    "course_code": "ECON 452",
    "units": 4,
    "title": "Empirical Industrial Organization",
    "description": "Lecture, three hours; discussion, one hour. Limited to Master of Quantitative Economics students. Introduction to empirical methods and applications in industrial organization (IO). Development of empirical toolkit to estimate industry models of demand and supply and apply it to analysis of emerging in issues in IO from regulator, consumer, and firm perspective. Underlying theme is that most real-world markets are neither perfectly competitive, nor strict monopolies, but rather involve strategic interactions among firms and consumers. To capture these interactions empirically, development of empirical models of consumer demand and firm competition, and use of these models to analyze interactions of firm strategies (including pricing, product quality choices, and advertising) and market structure across range of industries. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON452"
  },
  {
    "course_code": "ECON 453",
    "units": 1,
    "title": "Fundamentals of Blockchain and Web 3.0",
    "description": "Lecture, three hours. Limited to Master of Quantitative Economics students. Requisite: course 409 or 432. Designed for students seeking to understand the implementation of blockchain technology in various industries and its transformative potential in the realm of financial services and the global economy. In today's competitive landscape, major financial institutions, digital asset investment firms, data analytic companies, venture capital funds, government agencies, and Web3 companies among others entities are actively exploring blockchain and digital assets, leading to a growing demand for blockchain experts, data analysts, researchers, and executives. These institutions are leveraging blockchain to streamline financial transactions including cross-border payments, over-the-counter transactions, bond issuances, tokenized real-world assets, and other financial instruments. Provides a comprehensive exploration of blockchain technology and its applications in finance and economics. Letter grading.",
    "prerequisites": [
      "ECON 409",
      "ECON 432"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON453"
  },
  {
    "course_code": "ECON 454",
    "units": 1,
    "title": "Introduction to Cryptocurrency Finance",
    "description": "Lecture, three hours. Limited to Master of Quantitative Economics students. Requisite: course 409 or 432. Introduction to financial concepts in cryptocurrency industry. Addresses regulatory issues around crypto currencies with institutional infrastructure that is starting to be built around this space. In-depth exploration of the historical performance and valuation of cryptocurrencies, with analysis of risk associated with the price. Examination of the development of the crypto derivatives market, both with futures and options. Discussion of centralized finance, staking, and decentralized finance space. Introduction of concept of security tokens and tokenization of hard assets and digital assets. Covers emerging field of non-fungible tokens (NFT). Introduction of both asset and wealth management in the blockchain and cryptocurrency space relative to materials covered, including the instructor's field experience. Letter grading.",
    "prerequisites": [
      "ECON 409",
      "ECON 432"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON454"
  },
  {
    "course_code": "ECON 480",
    "units": 1,
    "title": "Fundamentals of Project Management",
    "description": "Seminar, three hours. Limited to Master of Quantitative Economics students. Covers fundamentals of project management and applications to variety of business settings. Examination of key project management terms and applications; project management tools and processes; how to analyze needs and expectations of key stakeholders; project documentation and reporting. Special attention paid to translating technical findings into business terminology along with developing and delivering insightful business presentations for leadership. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON480"
  },
  {
    "course_code": "ECON 495",
    "units": 2,
    "title": "Teaching College Economics",
    "description": "Seminar, one hour; laboratory, three hours. Designed for graduate students. Required of all new teaching assistants. Classroom practice in teaching, with individual and group instruction on related educational methods, materials, and evaluation. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON495"
  },
  {
    "course_code": "ECON 501",
    "units": 2,
    "title": "Cooperative Program",
    "description": "Tutorial, to be arranged. Preparation: consent of UCLA graduate adviser and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON501"
  },
  {
    "course_code": "ECON 596",
    "units": 2,
    "title": "Individual Study",
    "description": "Tutorial, to be arranged. Directed individual study or research. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON596"
  },
  {
    "course_code": "ECON 597",
    "units": 2,
    "title": "Individual Study: Graduate Examinations",
    "description": "Tutorial, to be arranged. Directed individual study in preparation for MA comprehensive examination or PhD qualifying examinations. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON597"
  },
  {
    "course_code": "ECON 599",
    "units": 2,
    "title": "Individual Research: PhD Dissertation",
    "description": "Tutorial, to be arranged. Preparation: advancement to PhD candidacy. Directed individual research in preparation of PhD dissertation. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ECON599"
  }
]