[
  {
    "course_code": "EDUC 10",
    "units": 5,
    "title": "Introduction to Educational Issues and Scholarship",
    "description": "Lecture, two hours; discussion, two hours. Introduction to broad landscape of public education in U.S. Intended for those interested in educational research, policy, or teaching in both formal and informal educational contexts. Readings highlight work of educational researchers from UCLA’s Department of Education, especially ways their scholarship intersects with policy and practice. Students work in groups to identify real-life problem affecting public education in Los Angeles. Study of this problem from multiple perspectives. Conceptualization of socially-just solution. Letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC10"
  },
  {
    "course_code": "EDUC 11",
    "units": 5,
    "title": "Education, Equality, and Future of American Society: Problems, Prospects, and Policies",
    "description": "Lecture, four hours; discussion, one hour. Schools are primary institutions charged with responsibility of preparing young people for their roles as citizens so that they can participate in our democracy. Public schools also serve as key sites where two essential, and at times conflicting, functions are carried out: students are sorted based on measures (and perceptions) of their ability to fill occupations and roles that are essential to economy; and students are educated in hopes that next generation will acquire knowledge, creativity, and problem-solving skills to solve problems created by previous generations. Focus on understanding challenges, contradictions, and complexities associated with carrying out these functions. Letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC11"
  },
  {
    "course_code": "EDUC 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC19"
  },
  {
    "course_code": "EDUC 35",
    "units": 5,
    "title": "Introduction to Inquiry and Research in Education",
    "description": "Lecture, two hours; discussion, two hours. Introduction to empirical and analytical educational research. Intended for undergraduates interested in learning how to find, interpret, and evaluate research that investigates important questions around education and education systems. Overview of multiple methods of conceptualizing inquiry and gathering evidence, including qualitative (e.g., ethnographic, semi-structured interviews, case study), quantitative (e.g., surveys, experimental, descriptive), and mixed methods approaches. Introduction to software processing and analysis of data. Highlights ethics of conducting research in social sciences, and norms of conducting and reporting research in the field of education. Letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC35"
  },
  {
    "course_code": "EDUC 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC89"
  },
  {
    "course_code": "EDUC 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors and departmental honors programs. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC89HC"
  },
  {
    "course_code": "EDUC 92F",
    "units": 2,
    "title": "Academic Success in Undergraduate Experience",
    "description": "Lecture, one hour; discussion, one hour. Designed for first-year or transitioning students to promote understanding of factors involved in making adjustments to college experience, both academic and social. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC92F"
  },
  {
    "course_code": "EDUC 98",
    "units": 4,
    "title": "Critical Issues in Education",
    "description": "Seminar, 30 minutes; laboratory, 30 minutes. Introduction to critical educational issues and approaches taken by researchers, policymakers, and education advocates as they respond to these issues. Laboratory portion of course engages students in small research groups where they acquire background on particular issue of interest, learn about social sciences research, and conduct mini-research projects. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC98"
  },
  {
    "course_code": "EDUC 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC99"
  },
  {
    "course_code": "EDUC 100",
    "units": 4,
    "title": "Foundations: Histories and Philosophies of Education",
    "description": "Lecture, four hours. Requisites: courses 10, 35. Limited to Education and Social Transformation majors. Introduction to central concepts underlaying the study of education in the U.S. In alignment with the major, focus on analyzing how education is studied, and assumption of the vital importance of education in promoting social transformation. Study focuses on the questions of the purpose of education for social transformation and of social transformation. Letter grading.",
    "prerequisites": [
      "EDUC 10",
      "EDUC 35"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC100"
  },
  {
    "course_code": "EDUC 101B",
    "units": 4,
    "title": "History of Schools in U.S.",
    "description": "Lecture, four hours. Intensive consideration of American society, including its racial and cultural diversity as well as how settler colonial projects influence our present conditions. Consideration of historical development of schools in U.S., examining issues of racism, ethnic and gender differences, perspectives of cultural diversity, and impact on classroom instruction. Critical analysis of contexts and structure of public education in California, focusing on state, district, and school governance and finance. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC101B"
  },
  {
    "course_code": "EDUC 101C",
    "units": 5,
    "title": "History of Higher Education",
    "description": "(Formerly numbered C101.) Lecture, three hours; discussion, one hour. Exploration of major eras in history of higher education. Topics include issues concerning access, diversity, parental choice, cultural literacy, teacher empowerment, and role of popular media. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC101C"
  },
  {
    "course_code": "EDUC M102",
    "units": 4,
    "title": "Mexican Americans and Schools",
    "description": "(Same as Chicana/o and Central American Studies M102.) Seminar, two hours; discussion, two hours. Theoretical and empirical overview of Chicana/Chicano educational issues in U.S., with special emphasis on disentangling effects of race, gender, class, and immigrant status on Chicana/Chicano educational attainment and achievement. Examination of how historical, social, political, and economic forces impact Chicana/Chicano educational experience. P/NP or letter grading.",
    "cross_listed": [
      "CCAS M102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM102"
  },
  {
    "course_code": "EDUC M103",
    "units": 4,
    "title": "Asian American Education and Schooling",
    "description": "(Same as Asian American Studies M114.) Seminar, four hours. Examination of existing body of research from various disciplines on Asian/Pacific American educational experiences. Letter grading.",
    "cross_listed": [
      "ASIA AM M114"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM103"
  },
  {
    "course_code": "EDUC 104A",
    "units": 4,
    "title": "Introduction to Exceptional Learners",
    "description": "(Formerly numbered 134.) Lecture, two hours; discussion, one hour. Survey of characteristics and related educational needs of students (preschool through high school) who vary in mental, physical, psychological, and social characteristics. Focus on disabilities, with exploration in area of gift/talented education. Emphasis on inclusion, and legal, social, and philosophical issues associated with it. Students learn perspectives from disability studies and engage in class activities designed to challenge students to put inclusion into practice. Students develop understanding of various areas and exceptionalities of special education with emphasis on role of student special needs in context of general education settings. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC104A"
  },
  {
    "course_code": "EDUC 105A",
    "units": 5,
    "title": "Early Childhood Education and Policy",
    "description": "(Formerly numbered 105.) Seminar, four hours. Overview of early care and education (ECE) landscape in U.S. and variety of policy systems used to provide care for young children. Consideration of possibilities and pitfalls of ECE as much hailed solution for educational inequality. Critical thought about how to use policy to provide young children with what they need to thrive. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC105A"
  },
  {
    "course_code": "EDUC 105B",
    "units": 5,
    "title": "Topics in Child Development and Social Policies",
    "description": "(Formerly numbered 133.) Seminar, four hours. Research seminar designed to enable students to gain basic understanding of ways in which public policies are established and implemented, learn about policy landscape in several major domains of child and family life in U.S. and other countries, and use scientific research on children’s cognitive and social development to evaluate and understand effects of social and economic policies. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC105B"
  },
  {
    "course_code": "EDUC 105C",
    "units": 5,
    "title": "Comparative Educational Policies and Practices",
    "description": "(Formerly numbered 109C.) Seminar, four hours. Cross-national survey of educational policies and practices in delivery of education services. Comparative perspective on national context defining institutional differences in policy and practices in delivery and access, types (within tier and sector diversity), and funding mechanism for education services in both developing and developed country contexts. Focus on examination of state of education and socio-political, economic, and cultural factors that contribute to similarities and differences in institutional structures, organizational, and management functions, and on agenda for consideration of equality and equity in deployment of resources for realization of inclusive quality education for all. Early childhood education, foundational education, post-secondary education (including university and non-university systems), and lifelong learning (and adult education) as themes informing cross-national comparison of policies and practices in delivery of education services. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC105C"
  },
  {
    "course_code": "EDUC 105D",
    "units": 5,
    "title": "Policy Analysis and Real Politics of Education",
    "description": "(Formerly numbered 110.) Lecture, two hours; discussion, two hours. Exploration of relationship between scholarly policy analysis and actual workings of policy systems. Selected topics include achievement standards and assessment, school finance, equal access to education, and school reform. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC105D"
  },
  {
    "course_code": "EDUC 105E",
    "units": 5,
    "title": "Organization for Economic Cooperation and Development and Education",
    "description": "Seminar, three hours. Introduction to education policy analysis at international level with focus on Organization for Economic Cooperation and Development (OECD) program of work and outputs related to field of education. Overview of history of OECD and model of governance related to education, criticisms of OECD's power and influence on education, as well as coverage of range of OECD comparative data, comparative studies, and thematic and policy reviews related to education. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC105E"
  },
  {
    "course_code": "EDUC 106A",
    "units": 5,
    "title": "Education and Law",
    "description": "(Formerly numbered 129.) Seminar, four hours. Research seminar providing overview of high-profile legal controversies that shape so many policy debates at both K-12 and higher education levels. Major areas of focus include campus safety, religion and schools, educational quality and law, broadbased right to equal educational opportunity, and Internet-related issues and concerns. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC106A"
  },
  {
    "course_code": "EDUC 106B",
    "units": 4,
    "title": "Lesbian, Gay, Bisexual, and Transgender Issues in Education and Law",
    "description": "(Formerly numbered 147.) Lecture, four hours. Lesbian, gay, bisexual, and transgender-related controversies that arise in schools, colleges, and universities today and how they are being addressed by legal and education communities. In particular, examination of real-life consequences of current laws and exploration of what might be done to make things better for all persons. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC106B"
  },
  {
    "course_code": "EDUC 106C",
    "units": 4,
    "title": "Diversity, Democracy, and Law",
    "description": "Lecture, four hours. Introductory overview of high-profile legal controversies that shape so many of policy debates regarding access to higher education and equity for underrepresented students, free speech and expression, academic freedom and other First Amendment-related controversies and legal issues. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC106C"
  },
  {
    "course_code": "EDUC 107A",
    "units": 5,
    "title": "Race, Class, and Education Inequality in U.S.",
    "description": "(Formerly numbered 130.) Lecture, two hours; discussion, two hours. Focus extensively on understanding educational experiences of following groups in U.S.: African Americans, Asian Americans and Pacific Islanders, Chicanas/Chicanos/Latinas/Latinos, and low-income white Americans. Examination of how historical development of public education in U.S. has influenced its present form. Critical look at some current issues and policy debates in education, including debate over school reform, bilingual education, and affirmative action. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC107A"
  },
  {
    "course_code": "EDUC 107B",
    "units": 5,
    "title": "Race and Education: Access, Equity, and Achievement",
    "description": "(Formerly numbered 164.) Seminar, four hours. Social/psychological perspective on education, with particular attention to race, ethnicity, and inequality. Study of structural, social, and personal determinants of educational outcomes. Consideration of relationship of schools to social context and other societal institutions. Examination of how education sets life trajectory in America and effects of race/ethnicity on access to educational opportunity in our society. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC107B"
  },
  {
    "course_code": "EDUC M108",
    "units": 5,
    "title": "Sociology of Education",
    "description": "(Same as Sociology M175.) Lecture, four hours; discussion, one hour. Study of how U.S. educational system both promotes socioeconomic opportunities and maintains socioeconomic inequalities: historical and theoretical perspectives on role of education in U.S. society; trends in educational attainment; ways in which family background, class, race, and gender affect educational achievement and attainment; stratification between and within schools; effects of education on socioeconomic attainment, family, health, attitudes, and social participation; educational policies to improve school quality and address socioeconomic inequalities. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "SOCIOL M175"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM108"
  },
  {
    "course_code": "EDUC 109A",
    "units": 4,
    "title": "Globalization and Learning",
    "description": "(Formerly numbered 152A.) Lecture, two hours; discussion, two hours. Introduction to different conceptualizations of globalization and their relationship to educational processes and learning in contemporary societies. Discussion of several concepts and theoretical lenses as basis for approaching and understanding how dialectics of global and local are affecting educational systems and learning over lifespans. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC109A"
  },
  {
    "course_code": "EDUC 109B",
    "units": 4,
    "title": "Global Citizenship Education",
    "description": "(Formerly numbered 152B.) Lecture, four hours. Exploration of issues of global citizenship in education and society as whole by analyzing critical challenges and envisioning possible solutions to multiple layers of theoretical, empirical, and practical implementation of global citizenship education. Examination of how global citizenship education and education for sustainable development are beginning to impact life, actions, policies, and practices of educators, students, non-government organizations, governments, multinational organizations, and other key players in local and global contexts. Examination of how global citizenship education impacts our worldview, teaching, and learning as we strive to envision and work toward more just and sustainable society. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC109B"
  },
  {
    "course_code": "EDUC 111",
    "units": 5,
    "title": "Politics of Education",
    "description": "(Formerly numbered C111.) Lecture, two hours; discussion, two hours. Political dimensions of education institutions as organizations. Relationships between education institutions and political institutions in society. Political theory as foundation for public policy analysis; interest groups in education policy formation and implementation; and focus on Freirean pedagogy. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC111"
  },
  {
    "course_code": "EDUC 112",
    "units": 4,
    "title": "Black Student Activism: History of Resistance on Campus",
    "description": "Lecture, three hours; discussion, one hour. Activism is long-standing component of student life on U.S. college and university campuses. Focus on Black student activism. As higher education became more accessible to Black Americans, new wave of activisms entered college campuses, with Black Lives Matter movement being one of most recent examples. Examination of philosophical, intellectual, social, economic, and political elements that have shaped and propelled Black student activism over past two centuries. Exploration of earliest activist activities among Black students, ranging from abolitionist movement in early 1800s to fight for Black and African studies programs during 1960s and 1970s. Interrogation of what past teaches about Black student activism today. Study includes discussions, mock debates, case studies, and primary source analyses. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC112"
  },
  {
    "course_code": "EDUC 113",
    "units": 5,
    "title": "Democracy, Justice, and Education",
    "description": "Lecture, three hours. Democracy, justice, and education are core ideals that define public discourse and scholarship about schooling. Exploration of these ideals from philosophical and practical perspective in context of century-old community schools movement. Global pandemic has renewed public interest in community schools framed as equity-focused anti-poverty reform to provide integrated social supports such as health, nutrition, and after-school programs. Movement also has strong democratic roots tied to local control, collective problem solving, and community-based learning—challenging ideas about who has power, how young people learn, and how teachers teach. Inquiry grounded in experience of two UCLA community schools as well as five other community school sites chosen by students. Examination of whether and how these schools are sites of social transformation by investigating contexts, theories, and practices that define their work. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC113"
  },
  {
    "course_code": "EDUC 116",
    "units": 4,
    "title": "Indigenous Presence: Land, Place, and Space in Higher Education",
    "description": "Lecture, four hours. Exploration of what it means to talk about lands/waters, place, and space. Exploration of how histories of place are both present and absent on college campuses and higher education settings. Students reflect on personal mobilities and relationships to Indigenous landscapes and geographies. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC116"
  },
  {
    "course_code": "EDUC 117",
    "units": 5,
    "title": "Road Trip: Exploring College Campus Cultures across U.S.",
    "description": "Seminar, four hours. Study of what other college campuses beside UCLA have to offer. Intended for students interested in understanding prominent aspects of non-mainstream U.S. colleges and universities. Exploration of institutional missions of special mission colleges and universities, how these institutions provide services to students, and unique strengths and challenges on these campuses through discussions, mock debates, case studies, and assignments that delve deeper into experiences of attending these special mission colleges and universities. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC117"
  },
  {
    "course_code": "EDUC 118",
    "units": 5,
    "title": "Sociology of Community Colleges",
    "description": "Seminar, four hours. Application of existing research, and sociological and economic theories to analysis of community colleges. Scholars have employed diverse set of concepts, theoretical frameworks and methods to understand these educational institutions. Examination of this sector of higher education in U.S. through range of qualitative, quantitative, historical, and case studies. Covers economic and sociological foundations of research on community colleges and their missions (transfer, remediation/developmental, adult basic education, English as second language, workforce development, etc.), institutional dynamics and organizational culture, government and business impact, for-profit colleges, social media use among students and administrators, student support and community-building, and effective reform efforts. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC118"
  },
  {
    "course_code": "EDUC 119",
    "units": 4,
    "title": "Variable Topics in Histories and Philosophies of Education",
    "description": "Seminar, four hours. Variable topics course organized around courses that introduce students to landscape of education within historical, disciplinary, and policy contexts. Consult Schedule of Classes for topics and instructors. May not be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC119"
  },
  {
    "course_code": "EDUC 120",
    "units": 4,
    "title": "Foundations: Contexts for Teaching, Learning, and Development",
    "description": "Lecture, four hours. Requisites: courses 10, 35. Limited to Education and Social Transformation majors. Introduction to basics of learning sciences and learning theory, acknowledging that learning takes place in multiple contexts both inside and outside of the classroom. Discussion of promising practices to meet the needs of students at each stage of development. Letter grading.",
    "prerequisites": [
      "EDUC 10",
      "EDUC 35"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC120"
  },
  {
    "course_code": "EDUC M121",
    "units": 5,
    "title": "Introduction to Media Literacies",
    "description": "(Same as Information Studies M121.) Seminar, four hours. Exploration of relationships between media, technology, and popular culture. Students guided to analyze media representations, question process of normalizing dominant ideologies, and create counter-hegemonic media messages. Through application of critical media literacy framework, students expand notions of literacy to be more inclusive of all types of texts; and deepen their abilities to question power of word, image, and sound-bite to represent social and environmental injustice. Letter grading.",
    "cross_listed": [
      "INF STD M121"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM121"
  },
  {
    "course_code": "EDUC 122",
    "units": 4,
    "title": "Indigenous Pedagogies",
    "description": "Lecture, four hours. Introduction to the diversity of Indigenous voices in education, Indigenous epistemologies, and Indigenous pedagogical approaches. Indigenous pedagogies have been developed and maintained across multiple generations. Oftentimes, these pedagogical approaches stand in contrast to common practices of schooling in the U.S. Exploration of writings of Indigenous scholars who are articulating the theoretical, ethical, and practical dimensions of Indigenous approaches to teaching and learning. Consideration of what theories about human life and relations organize Indigenous approaches to education; role of stories and storywork within Indigenous pedagogies; and role of lands and water within Indigenous pedagogies. Draws heavily from Indigenous scholarship in what is now the U.S. and Canada, although much of the ideas are applicable to or have resonances with many Indigenous peoples and pedagogies around world. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC122"
  },
  {
    "course_code": "EDUC 123",
    "units": 5,
    "title": "Teaching Profession",
    "description": "Seminar, four hours. Exploration of traditional and alternative teaching practices and public responses to teachers teaching and students learning. Examination of education in socioeconomic context and discussion of some philosophical questions that challenge teaching profession. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC123"
  },
  {
    "course_code": "EDUC C124",
    "units": 4,
    "title": "Theory and Practice of Intergroup Dialogue: Building Facilitation Skills",
    "description": "(Formerly numbered C160.) Seminar, four hours. Topics include social psychology of intergroup relations, intercultural and dialogic communication theories, methods for reconciling and bridging differences in schools and communities, research and evaluation of intergroup dialogues and other educational methods for improving intergroup relations, and core competencies for planning, delivering, and evaluating intergroup dialogues in multicultural settings. While providing foundational grounding in theory and pedagogy of intergroup dialogue, particular attention to relationships between intergroup dynamics, structural inequalities, systems of privilege and oppression, and mental health outcomes and disparities among populations. Concurrently scheduled with course C244. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCC124"
  },
  {
    "course_code": "EDUC CM125XP",
    "units": 4,
    "title": "Narratives of Justice: Disrupting School-to-Prison Pipeline—Arts, Activism, and Agency",
    "description": "(Formerly numbered CM163.) (Same as African American Studies CM113XP.) Lecture, four hours; discussion, one hour. Exploration of policies and practices, art and activism, and other forms of agency engaging school-to-prison pipeline. Concurrently scheduled with course CM229B. P/NP or letter grading.",
    "cross_listed": [
      "AF AMER CM113XP"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCCM125XP"
  },
  {
    "course_code": "EDUC 126",
    "units": 5,
    "title": "Language, Literacy, and Academic Development: Educational Considerations for School-Age Multilingual and English Language Learner Students",
    "description": "(Formerly numbered 166.) Seminar, five hours. Use of child-centered approach to examine instructional strategies and assessment practices with preK-12 multilingual and English learner (EL) students who are learning academic content at same time they are acquiring English (and possibly additional languages) in school. Critical comparison of effectiveness of English-only programming with dual-language approaches (e.g., two-way immersion, transitional bilingual education) and roles of summative and formative assessments in educational decision making with multilingual and EL students. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC126"
  },
  {
    "course_code": "EDUC 127",
    "units": 5,
    "title": "Educational Psychology: Contexts for Teaching and Learning",
    "description": "Lecture, two hours; discussion, two hours. Not open for credit to students with credit for course 128. Broad overview of educational psychology, with examination of relationship of teaching and learning; various perspectives as to how children learn; issues of teaching and learning that arise based on child’s social class, ethnic background, gender, age, and level of ability. Letter grading.",
    "credit_exclusions": [
      "EDUC 128"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC127"
  },
  {
    "course_code": "EDUC 128",
    "units": 4,
    "title": "Educational Psychology: Contexts for Learning and Development",
    "description": "Lecture, four hours. Not open for credit to students with credit for course 127. Overview of theories, methods, and research in educational psychology. Education psychology involves study of how students learn and contexts that support this learning. Learning is complex process. Study of research and theory related to different aspects of learning including cognition, motivation, and self-regulation. Discussion of ways in which educators can support these processes in students. Letter grading.",
    "credit_exclusions": [
      "EDUC 127"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC128"
  },
  {
    "course_code": "EDUC M129",
    "units": 4,
    "title": "Arts Education Undergraduate Practicum: Preparation, Observation, and Practice",
    "description": "(Formerly numbered M190.) (Same as Arts Education M192.) Seminar, three hours. Enforced requisite: course M142. Limited to juniors/seniors. Training and supervised practicum for advanced undergraduate students participating in Visual and Performing Arts Education minor. Students implement and evaluate original arts education programs under guidance of faculty members in small course settings. P/NP or letter grading.",
    "prerequisites": [
      "EDUC M142"
    ],
    "cross_listed": [
      "ARTS ED M192"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM129"
  },
  {
    "course_code": "EDUC M129XP",
    "units": 4,
    "title": "Arts Education Undergraduate Practicum and Capstone Project",
    "description": "(Formerly numbered M190SL.) (Same as Arts Education M192XP.) Seminar, three hours; practicum, three hours; outside study, six hours. Enforced requisites: courses M129, M142. Limited to juniors/seniors. Continuation of arts education training and supervised practicum for advanced undergraduate students participating in Visual and Performing Arts Education minor. Students continue to implement and evaluate original arts education programs under guidance of faculty members and designated guiding teachers in K-12 public school settings. May be repeated for credit with consent of instructor. P/NP or letter grading.",
    "prerequisites": [
      "EDUC M129",
      "EDUC M142"
    ],
    "cross_listed": [
      "ARTS ED M192XP"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM129XP"
  },
  {
    "course_code": "EDUC 130AX",
    "units": 4,
    "title": "Instructional Apprenticeship in Teaching and Learning at UCLA Lab School",
    "description": "(Formerly numbered 196C.) Tutorial, 10 hours. Requisite: course 180. Limited to juniors/seniors. Not open for credit to students with credit for course 130BX or 130CX. Training and supervised apprenticeship for advanced undergraduate students at UCLA Lab School (Corinne A. Seeds campus), K-6 elementary school on UCLA campus. Students gain understanding of innovative educational work that goes into teaching and learning at UCLA Lab School through seminars, readings, observations, and discussions. Individual meetings with faculty mentor throughout term. Letter grading.",
    "prerequisites": [
      "EDUC 180"
    ],
    "credit_exclusions": [
      "EDUC 130CX",
      "EDUC 130BX"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC130AX"
  },
  {
    "course_code": "EDUC 130BX",
    "units": 4,
    "title": "Instructional Apprenticeship in Teaching and Learning at UCLA Partner Schools",
    "description": "(Formerly numbered 196D.) Tutorial, 10 hours. Requisite: course 180. Limited to juniors/seniors. Not open for credit to students with credit for course 130AX or 130CX. Introduction to K-12 teaching profession through training and supervised off-campus experiences at UCLA partner schools. Students gain grounded understanding of social issues in education through readings, observations, direct support in classrooms, and tutoring activities. Individual meetings with faculty mentor throughout term. Letter grading.",
    "prerequisites": [
      "EDUC 180"
    ],
    "credit_exclusions": [
      "EDUC 130CX",
      "EDUC 130AX"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC130BX"
  },
  {
    "course_code": "EDUC 130CX",
    "units": 4,
    "title": "Instructional Apprenticeship in Teaching and Learning at UCLA Community Schools",
    "description": "Tutorial, 10 hours. Requisite: course 180. Not open for credit to students with credit for course 130AX or 130BX. Examination of how UCLA partners with Los Angeles Unified School District (LAUSD) to educate, engage, empower, and serve students and families through community schooling model. Through readings, discussions, guest speakers, and course assignments, students are offered varied opportunities to examine case studies on how two institutions, UCLA and UCLA Community Schools, partner together to ensure greater engagement and democratic development to transform neighborhood school, as well as link school day and after-school curricula to solve locally identified, real-world, and community problems to uplift entire school community. Students gain grounded understanding of social issues in education through readings, observations, direct support in classrooms, and tutoring activities. Letter grading.",
    "prerequisites": [
      "EDUC 180"
    ],
    "credit_exclusions": [
      "EDUC 130AX",
      "EDUC 130BX"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC130CX"
  },
  {
    "course_code": "EDUC M131A",
    "units": 5,
    "title": "Language, Literacy, and Human Development Research Group Seminars",
    "description": "(Formerly numbered M194A.) (Same as African American Studies M194A.) Seminar, three hours; laboratory, two hours (when scheduled). Requisite: course 180. Research seminar designed to provide opportunity to combine theory and practice in study of human development in educational contexts. Focus on relationship between theories of development, culture, and language. Letter grading.",
    "prerequisites": [
      "EDUC 180"
    ],
    "cross_listed": [
      "AF AMER M194A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM131A"
  },
  {
    "course_code": "EDUC M131B",
    "units": 5,
    "title": "Culture, Gender, and Human Development Research Group Seminars",
    "description": "(Formerly numbered M194B.) (Same as African American Studies M194B.) Seminar, three hours; laboratory, two hours (when scheduled). Requisite: course 180. Research seminar designed to provide opportunity to combine theory and practice in study of human development in educational contexts. Focus on relationship between theories of development, culture, and gender. Letter grading.",
    "prerequisites": [
      "EDUC 180"
    ],
    "cross_listed": [
      "AF AMER M194B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM131B"
  },
  {
    "course_code": "EDUC M131C",
    "units": 5,
    "title": "Culture, Communications, and Human Development Research Group Seminars",
    "description": "(Formerly numbered M194C.) (Same as African American Studies M194C.) Seminar, three hours; laboratory, two hours (when scheduled). Requisite: course 180. Research seminar designed to provide opportunity to combine theory and practice in study of human development in educational contexts. Focus on relationship between theories of development, culture, and technologies. Letter grading.",
    "prerequisites": [
      "EDUC 180"
    ],
    "cross_listed": [
      "AF AMER M194C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM131C"
  },
  {
    "course_code": "EDUC 132",
    "units": 5,
    "title": "Autism: Mind, Brain, and Education",
    "description": "Lecture, two hours; discussion, two hours. Study of autism spectrum disorders (ASD) and related disabilities. Discussion of characteristics of disorder, effective interventions, and exploration of impact of children with ASD on families. Limited number of independent observations of individuals in community required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC132"
  },
  {
    "course_code": "EDUC 133",
    "units": 5,
    "title": "Literacy in Society",
    "description": "(Formerly numbered 122.) Lecture, four hours. Literacy plays significant role in cognition and language, political governance and law, and economic, social, and personal well-being. Exploration of these aspects of literacy and their implications for teaching and learning. Examination of literacy in workplace, healthcare, and community. Consideration of new literacies, interrelationship between literacy and technology, and impact of illiteracy on income and opportunity. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC133"
  },
  {
    "course_code": "EDUC 134",
    "units": 5,
    "title": "Early Childhood Mathematics Education",
    "description": "Seminar, two hours; fieldwork, two hours. Focus on how research in early childhood mathematics can be used to engage young people in learning mathematics. Study addresses research on how young children learn mathematics, teaching preschool mathematics, and policy context that shapes student opportunities in early childhood education. Particular attention paid to equity issues. Includes fieldwork at local preschool site working with students in mathematics. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC134"
  },
  {
    "course_code": "EDUC M135",
    "units": 5,
    "title": "Environmental Justice through Lens of Media and Education",
    "description": "(Same as Information Studies M135.) Seminar, four hours. Exploration of human relationships with natural world, historically and today. Students take critical look at ways information has been shaped, audiences positioned, and movements manipulated to promote commercial interests over public good. Exploration of progressive movements that have in past challenged—and currently challenge—neoliberal agendas, extractive policies, and unsustainable practices. Letter grading.",
    "cross_listed": [
      "INF STD M135"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM135"
  },
  {
    "course_code": "EDUC M136",
    "units": 4,
    "title": "Working Families and Educational Inequalities in Urban Schools",
    "description": "(Same as Labor Studies M136.) Seminar, three hours; fieldwork, five hours. Exploration of complex relationship between working-class and poor communities and inequalities in American urban schools. Drawing on multiple disciplinary frameworks that address issues of race, ethnicity, and immigration, schools viewed as sites where inequalities are produced and resisted. Review of history of exclusionary treatment and divergent conceptual frames that educational researchers have used to understand notion of inequality, access to quality public education, and how race, ethnicity, and class affect school experiences for working-class and poor communities. Look inside schools through community service learning opportunity to examine systems, structures, and everyday practices that sustain and reproduce inequality and policies that intend to remedy educational inequalities in urban schools. Opportunity to investigate issues of working-class families and inequalities as they relate to students’ own communities and experiences. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "LBR STD M136"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM136"
  },
  {
    "course_code": "EDUC M137",
    "units": 4,
    "title": "Critical Digital Media Literacies",
    "description": "(Formerly numbered 137.) (Same as Information Studies M137.) Lecture, four hours. Students question relationships with digital media and information society and explore how media and information communication technologies are improving society, strengthening democracy, and opening up opportunities for challenging hegemony and promoting social transformation. Problematization of social media and questioning of ways it is being used to surveil, capture data, spread hate, mislead, distract, and destabilize democracies. Students analyze media representations, question process of normalizing dominant ideologies, and create counter-hegemonic media messages. Combines theoretical foundations of cultural studies and critical pedagogy with practical applications of new digital media and technology, as well as traditional print-based means of communication. Exploration of media representations of race, class, gender, sexual orientation, and other identity markers. Students analyze and create media projects related to education. Letter grading.",
    "cross_listed": [
      "INF STD M137"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM137"
  },
  {
    "course_code": "EDUC 138",
    "units": 5,
    "title": "Cognitive Development and Schooling",
    "description": "Lecture, four hours; discussion, one hour. Overview of theories, methods, and research on children’s cognitive development and implications of this work for educational practice. Covers range of research from different perspectives, drawing from domains such as developmental psychology, cognitive psychology, developmental cognitive neuroscience, and education. Students learn about basic cognitive processes. Exploration of ways in which contexts—including those at home, early-care settings, and school—impact children’s development. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC138"
  },
  {
    "course_code": "EDUC 139",
    "units": 4,
    "title": "Culture and Cognition",
    "description": "Lecture, four hours. Introduction to theoretical foundations of research on culture and cognition. Drawing from insights of cultural psychology and anthropology, study of various definitions of community spaces, etc.; and consideration of social, political, and educational implications of ways these terms are conceptualized. Study address questions of relationship between culture and development of mind; how this relationship might be studied; what insight research on culture and cognition offers for the organization of learning environments; and for understandings of diversity and equity. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC139"
  },
  {
    "course_code": "EDUC 140",
    "units": 5,
    "title": "Educational Perspectives of Relational Practices in Modern Medicine",
    "description": "Seminar, four hours. Systematic discussion of personhood and body concepts, in context of asymmetric person-to-person relationships in high-tech modern medical training and practice. Exploration of diverse implications for building theories of relational practice. Students learn to use phenomenological approach, to make sense of lived experience of making sense of world we inhabit; and stance on who we are and activities at hand in everyday practices. Phenomenological approach maintains focus on how things show up; what affordances emerge in activities and practices; and how we comport toward them making sense of them, others, and ourselves. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC140"
  },
  {
    "course_code": "EDUC 141",
    "units": 5,
    "title": "Adolescent Development",
    "description": "Lecture, four hours. Introduction to adolescence—period of tremendous change and growth across all domains of development, including physical, social, cognitive, and emotional during second decade of life. Topics may include pubertal development, adolescent brain development, family, friend, peer, and intimate relationships, social identity and intergroup relations, school, work, and civic engagement. Draws on developmental science research on adolescence and applies that knowledge to examination of practices and policies. Contemporary and global conceptualizations of adolescence and more complex understandings of developing self in relation to significant others (i.e., family, friends, peers) and bounded in socio-historical time and place (i.e., school, work, media). Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC141"
  },
  {
    "course_code": "EDUC M142",
    "units": 4,
    "title": "Introduction to Arts Education for Multiple Publics: Theory and Practice",
    "description": "(Formerly numbered M104.) (Same as Arts Education M102.) Seminar, three hours; outside study, nine hours. Introductory course with focus on arts education for multiple publics in inner-city settings. Study of core issues in arts education, creativity, and social justice as students develop, implement, and assess original syllabi, lesson plans, and community learning projects for multiple publics in inner-city schools and arts organizations. Collaboration with partner schools in planning, teaching, and evaluation of arts education programs in dance, music, theater, and visual arts. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "ARTS ED M102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM142"
  },
  {
    "course_code": "EDUC 143",
    "units": 4,
    "title": "Understanding Pathways to College",
    "description": "Lecture, two hours; discussion, two hours. Examination of inequality across K-12 and higher education to understand how college admissions are stratified across racial and class lines. Roles of school personnel, higher education admissions, families, and students in promoting equal educational opportunity. Course is good preparation for students interested in working in UCLA programs such as Early Academic Outreach Programs that serve students in Los Angeles area schools. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC143"
  },
  {
    "course_code": "EDUC 144",
    "units": 4,
    "title": "Pedagogies of Global Citizenship Education",
    "description": "(Formerly numbered 152C.) Lecture, four hours. Not open for credit to students with credit for course 144XP. Questions regarding nature and possibility of education that can foster global citizenship necessary to understand and resolve world’s most pressing issues. Focus on curriculum and instruction of global citizenship education. Using local and global research, exploration and analysis of various perspectives, curricula, and pedagogies pertaining to teaching and implementation of global citizenship education at different levels of education. Letter grading.",
    "equivalent_courses": [
      "EDUC 144XP"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC144"
  },
  {
    "course_code": "EDUC 144XP",
    "units": 5,
    "title": "Pedagogies of Global Citizenship Education",
    "description": "Lecture, three hours; field work, one hour. Requisite: course 180. Not open for credit to students with credit for course 144. Questions regarding nature and possibility of education that can foster global citizenship necessary to understand and resolve world's most pressing issues. Focus on curriculum and instruction of global citizenship education. Using local and global research, exploration and analysis of various perspectives, curricula, and pedagogies pertaining to teaching and implementation of global citizenship education at different levels of education. Letter grading.",
    "prerequisites": [
      "EDUC 180"
    ],
    "equivalent_courses": [
      "EDUC 144"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC144XP"
  },
  {
    "course_code": "EDUC 145",
    "units": 4,
    "title": "Children, Immigration, and Education",
    "description": "Lecture, four hours. Exploration of diverse experiences of young people across globe whose lives have been shaped by movement across geopolitical, social, cultural, and linguistic borders from sociological, anthropological, psychological, public policy, and educational perspectives. Bringing together these multiple epistemological lenses, study addresses issues of identity, citizenship, belonging, growing up in multi- and bilingual communities, learning in and out schools, educational processes and policies, school-family connections, and more. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC145"
  },
  {
    "course_code": "EDUC 146",
    "units": 4,
    "title": "Critical Perspectives on Educational Assessment Approaches: Pre-Kindergarten to College",
    "description": "Seminar, three hours. Introduction of fundamental concepts and approaches in large-scale and classroom assessment. Brings critical perspectives to assessment design, uses, and interpretations, looking weekly at specific use cases in diverse learning contexts. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC146"
  },
  {
    "course_code": "EDUC 147",
    "units": 5,
    "title": "Social Context of Learners in K-12: Diversity, Residential Mobility, Immigration, and Food Security Conditions in California",
    "description": "(Formerly numbered 139.) Seminar, four hours. Examination of K-12 student experience in California schools. Comparison of geographic disparity in shared experiences, and prevalence of special and difficulty circumstances that have implications for learning and learning outcomes. Key areas identified include race and ethnic diversity in schools; geographic and residential mobility (including homelessness and temporary/transitional housing placement conditions); migration-schooling nexus (migrant education); and food insecurity conditions in student population. Data-driven, school-level analysis relying on statistics from California Department of Education and Los Angeles Unified School District. Data from other states offers points of comparison with respect to student demographic and geospatial experience across categories explored. Examination of potential impact of differential burden of inequality and disparity in resource opportunity on student learning and learning outcomes. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC147"
  },
  {
    "course_code": "EDUC 148",
    "units": 5,
    "title": "Early Childhood Development",
    "description": "(Formerly numbered 120.) Seminar, four hours. Broad overview of children’s psychological development, with emphasis on personal, social, and emotional attributes of preschool and elementary school children. Review and evaluation of contemporary educational programs for promoting positive social behaviors in elementary schools. Methodological aspects of child development. Overview of early childhood education and issues related to role of family, school, and media in child development. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC148"
  },
  {
    "course_code": "EDUC 149",
    "units": 4,
    "title": "Variable Topics in Contexts of Teaching and Learning",
    "description": "Seminar, four hours. Variable topics course organized around topics that teach students about theory and research on how people learn as well as sociocultural contexts that shape teaching and learning. Consult Schedule of Classes for topics and instructors. May not be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC149"
  },
  {
    "course_code": "EDUC 150",
    "units": 5,
    "title": "Quantitative Research in Education: Claims and Evidence",
    "description": "Lecture, two hours; discussion, two hours. Requisite: course 35. Limited to Education and Social Transformation majors. Introduction to four conceptual tools used to evaluate soundness of conclusions drawn from research evidence: notions of internal validity, statistical validity, construct validity, and external validity. Statistical validity requires basic fluency with quantitative data analysis, which students learn using statistical software R. Analysis of how values and beliefs shape quantitative education research and how research findings get translated when they are reported for popular media audiences. Quantitative background is not required. Letter grading.",
    "prerequisites": [
      "EDUC 35"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC150"
  },
  {
    "course_code": "EDUC 151",
    "units": 5,
    "title": "Quantitative Research in Education: Measurement and Assessment",
    "description": "Lecture, four hours; discussion, one hour. Enforced requisite: course 35, with grade of C or better. Intended for students who are interested in better understanding what makes good tests and how to critically interpret and evaluate tests and test scores in educational contexts. Introduction to measurement, testing, and assessment in educational settings. Overview of foundational concepts, methods, issues, and practices of educational measurement and assessment. Overview of basic statistical concepts and methods. Highlighting and evaluation of three core concepts of assessment: reliability, validity, and fairness. Students develop ability to critically interpret assessment data and apply both classical and modern theories of measurement and validly measure constructs of interest such as knowledge, attitude, and motivation. Students demonstrate understanding of equity and social justice issues related to fair use of educational measurement and assessment. Letter grading.",
    "prerequisites": [
      "EDUC 35"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC151"
  },
  {
    "course_code": "EDUC 152",
    "units": 5,
    "title": "Quantitative Research in Education: Regression Analysis",
    "description": "Lecture, two hours; discussion, two hours. Requisite: course 150 or 151. Preparation: basic familiarity with programming language R. Introduction to regression as tool to answer questions about education. Regression is commonly used to answer questions about association claims—relationship between variables—and causal claims—causal effect of one variable on another. Using regression appropriately requires thoughtfulness about what kinds of questions regression can answer, about assumptions regression relies on, about limitations of our data, and about how particular variables (e.g., race and gender) are incorporated into analyses in order to avoid regression results that may be biased and may reify rather than interrogate problematic ideas. Emphasis on learning fundamental concepts of regression analysis and how these concepts can be thoughtfully applied to address different kinds of questions about education. Students are trained how to read and critically assess research and applications using R programming language. Letter grading.",
    "prerequisites": [
      "EDUC 150",
      "EDUC 151"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC152"
  },
  {
    "course_code": "EDUC 156",
    "units": 5,
    "title": "Introduction to Qualitative Research in Education for Social Transformation",
    "description": "Lecture, two hours; discussion, two hours. Requisite: course 35. Limited to Education and Social Transformation majors. Qualitative researchers who focus on education and social transformation often examine social roots of educational inequalities and injustices, and organization of teaching and learning across diverse settings in order to understand educational possibilities. Introduction to epistemological, theoretical, ethical, and political foundations of conducting qualitative research in education. Students become familiar with breadth and scope of qualitative research. Theoretically-grounded, practical orientation that teaches students how qualitative researchers work individually and in teams to design studies that may ultimately support movement toward educational and social change. Assignments guide students through iterative research design process, which includes conducting needs assessment using qualitative data collection tools, making sense of pilot data, and negotiating research plans with stakeholders. Letter grading.",
    "prerequisites": [
      "EDUC 35"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC156"
  },
  {
    "course_code": "EDUC 157",
    "units": 5,
    "title": "Qualitative Research in Education: Ethnography",
    "description": "Seminar, four hours. Requisite: course 35. Examination of debates and dilemmas of conducting ethnography research in educational settings. Survey of research methodologies and methods (observations and interviews) in ethnography of education research. With consideration to issues of race/ethnicity, gender, sexual orientation, class, language, and immigration status, study guided by central question of how ethnography can inform efforts to create more socially-just educational systems and spaces of learning. Designed to help students develop skills important for senior capstone project. Letter grading.",
    "prerequisites": [
      "EDUC 35"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC157"
  },
  {
    "course_code": "EDUC 159",
    "units": 5,
    "title": "Educational Research and Equity in Informal Learning: Collaboration between Hammer Museum and UCLA Education",
    "description": "Seminar, three hours. Requisites: courses 35, 180. Through collaboration with Hammer Museum, introduction to importance of informal learning contexts, specifically in art museums, and value of conducting educational research within such contexts, while keeping equity at center of inquiry and exploration. Study of art museum pedagogies and philosophies. Reflection on art museum responsibility to support positive learning experiences for diverse audiences and local communities. Exploration of Research-Practice Partnerships education research approach that can support art museums in understanding problems of practice and questions of interest to their communities through mutually beneficial collaboration between researchers and practitioners. This approach challenges more traditional research-practitioner power dynamics by creating opportunities for both to jointly negotiate research questions, methods, and data analysis. Letter grading.",
    "prerequisites": [
      "EDUC 35",
      "EDUC 180"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC159"
  },
  {
    "course_code": "EDUC 160",
    "units": 5,
    "title": "Transformative Research in Community-Based Settings",
    "description": "(Formerly numbered 188A.) Lecture, four hours. Requisites: courses 35, 180. Introduction to the broad tradition of transformative research in education—engaged scholarship that aims to disrupt long-standing educational inequities in partnership with local communities. This tradition includes youth participatory action research (YPAR), participatory design research (PDR), community-based participatory research (CBPR), and other collaborative approaches to inquiry that value diverse forms of expertise and knowledge. By examining the principles and practices that underscore community-engaged scholarship, students are supported in developing the ability to analyze education in social and political context; develop skills for effecting change; and demonstrate understanding of multiple perspectives, diversity, pluralism, and social justice. Letter grading.",
    "prerequisites": [
      "EDUC 35",
      "EDUC 180"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC160"
  },
  {
    "course_code": "EDUC 165",
    "units": 5,
    "title": "Educational Program Evaluation",
    "description": "(Formerly numbered 139.) Seminar, four hours. Requisite: course 35. Stages and methods for conducting evaluations of educational and social programs, with emphasis on evaluation approaches that are theoretically grounded, methodologically rigorous, practical, and useful. Letter grading.",
    "prerequisites": [
      "EDUC 35"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC165"
  },
  {
    "course_code": "EDUC 166",
    "units": 5,
    "title": "Program Evaluation Theories and Practice",
    "description": "Seminar, four hours. Requisites: courses 10, 35. Introduction to various theories concerning evaluation of educational and social programs. Examination of how these theories differ with respect to goals, priorities, and associated procedures. Development of evaluation plan for specific program. In developing this plan, students consider core features of program, engage program stakeholders to understand needs and priorities, and connect their proposed approach to specific evaluation theories. Through parallel development of multiple plans to evaluate single program, students observe extent and manner in which differences in theory are manifested in evaluation design. Letter grading.",
    "prerequisites": [
      "EDUC 10",
      "EDUC 35"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC166"
  },
  {
    "course_code": "EDUC 169",
    "units": 4,
    "title": "Variable Topics in Inquiry and Design",
    "description": "Seminar, four hours. Requisite: course 35. Variable topics course organized around courses that teach students how to read and communicate about research. Consult Schedule of Classes for topics and instructors. May not be repeated for credit. Letter grading.",
    "prerequisites": [
      "EDUC 35"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC169"
  },
  {
    "course_code": "EDUC 170",
    "units": 2,
    "title": "Exploration of Topics in Education",
    "description": "(Formerly numbered 184.) Lecture, one hour. Variable topics course, with emphasis on theories of teaching and learning, connecting them to instructional activities for students in various learning settings, including libraries and schools. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC170"
  },
  {
    "course_code": "EDUC 171",
    "units": 4,
    "title": "Community Service Learning for Academic Achievement",
    "description": "(Formerly numbered 185.) Lecture, two hours; discussion, two hours. Emphasis on cognitive learning and motivation theories and their relevance to strategies for developing curricular instructional techniques and training that contribute to tutoring, counseling, and other instructional assistance in various school settings. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC171"
  },
  {
    "course_code": "EDUC 172",
    "units": 5,
    "title": "Activism through Community Service",
    "description": "Seminar, four hours. Exploration of impact and importance of activism in addressing health, educational, and social disparities that have led to discrimination, segregation, and marginalization of people of color. Students acquire methodology to combat these issues through participating in activism and community service at UCLA to further address issues that minoritized populations experience. Students apply their experiential knowledge from their respective projects in Community Programs Office Student Association, Student Initiated Outreach Center, Community Service Commission, or other UCLA community service organization to provide critiques and solutions to issues they are combating in their respective projects. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC172"
  },
  {
    "course_code": "EDUC 173",
    "units": 4,
    "title": "Dialog across Difference",
    "description": "Seminar, three hours. Offers safe and inviting space to engage in open, constructive discourse on issues related to social identities, such as race/ethnicity, socio-economic class, and sexual orientation identities. Students learn from one another’s perspectives, participate in experiential learning exercises, read and discuss relevant materials, and explore their own and other groups’ experiences in various social and institutional contexts. Offers opportunities to appreciate and learn to bridge differences, discover and maximize commonalities, interact with others around controversial issues pertaining to various forms of privilege and oppression, and work to help create social change. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC173"
  },
  {
    "course_code": "EDUC 174A",
    "units": 4,
    "title": "Experiential Learning in Secondary Classrooms: Health",
    "description": "(Formerly numbered 170C.) Lecture, one hour; fieldwork, four hours. Training and supervised practicum for undergraduate mathematics students interested in teaching in secondary classrooms, including working with 6th- through 12th-grade students in school sites. Focus on health requirements from California Commission on Teacher Credentialing. Experts in field lead discussion of issues related to physical and mental health of students and educators, issues of bullying, and learning theories and practices that engage diverse groups of students in classrooms. Active engagement in reflection on issues in schools in which students work. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC174A"
  },
  {
    "course_code": "EDUC 174B",
    "units": 2,
    "title": "Experiential Learning in Secondary Classrooms: Law",
    "description": "(Formerly numbered 170D.) Lecture, one hour; fieldwork, four hours. Training and supervised practicum for undergraduate mathematics or science students interested in teaching in secondary classrooms, including working with 7th- through 12th-grade students in school sites. Focus on law requirements from California Commission on Teacher Credentialing. Experts in field lead discussion of issues related to legal and ethical concerns of schooling, culture of schools, issues of bullying, building of classroom community, and learning theories and practices that engage diverse groups of students in classrooms. Active engagement in reflection on issues in schools in which students work. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC174B"
  },
  {
    "course_code": "EDUC 174C",
    "units": 2,
    "title": "Experiential Learning in Secondary Classrooms: Technology",
    "description": "(Formerly numbered 170E.) Lecture, one hour; fieldwork, four hours. Training and supervised practicum for undergraduate mathematics students interested in teaching in secondary classrooms, including working with 7th- through 12th-grade students in school sites. Focus on technology requirements from California Commission on Teacher Credentialing. Experts in field lead discussion of issues related to use of technology in classrooms, and learning theories and practices that engage students with diverse needs and interests. Active engagement in reflection on issues in schools in which students work. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC174C"
  },
  {
    "course_code": "EDUC 175A",
    "units": 4,
    "title": "Educational Innovations in Sport and Entertainment in Context of Diversity",
    "description": "Seminar, four hours. Introduction to central issues at nexus of education, sports, entertainment, and diversity. Examination and investigation of recent innovations in education, sports leadership, and entertainment that promise greater representation, equity, and inclusion of marginalized groups. Examination of media role in forming perceptions and attitudes, and its educational force in changing perceptions of athletes, and of college and professional sports. Examination of innovations in education, sports leadership, and entertainment that promote greater diversity. Examination of these and other related issues through prism of relevant theories, recent research literature, and documentaries. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC175A"
  },
  {
    "course_code": "EDUC 175B",
    "units": 4,
    "title": "Educational Leadership and Diversity in Sports: Equity, Access, and Future Prospects",
    "description": "Seminar, three hours. Examination of how leadership of sport, especially within intercollegiate athletics, impacts higher education, businesses, and other related organizations at macro and micro levels. Examination of equity across racial, gender, and social-class lines in both collegiate and professional sports. Addresses access in terms of which institutional mechanisms are in place to cultivate culture that empowers student-athletes, women, and people of color to positively matriculate in terms of social mobility. Approach to evaluating success of various organizations with diverse leaders and participants in sport focuses on both qualitative and quantitative measures. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC175B"
  },
  {
    "course_code": "EDUC 175C",
    "units": 4,
    "title": "Education, Hip-Hop Culture, and Sport",
    "description": "Lecture, three hours. Exploration of intersection of hip-hop culture, sport, and education; and how hip-hop culture serves as instrument of critical and culturally relevant pedagogy in K-12 education, higher education, and informal learning contexts. Exploration of development and rise of hip-hop from underground movement to dominant, cultural phenomenon; and its appropriation by prominent sports personalities. Exploration of hip-hop’s connection to television, social media, fashion, art, and film. Exploration of how this cultural art form intersects with development of social identities and cultural learnings in traditional and nontraditional educational settings (e.g., public schools, private schools, charter schools, and home schooling); and its enormous educational impact in general. Exploration of potential of hip-hop music and its cultural art form for furthering culturally relevant pedagogies and learning experiences. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC175C"
  },
  {
    "course_code": "EDUC 175D",
    "units": 4,
    "title": "Education of Contemporary Athletes: Leadership Themes and Principles",
    "description": "Seminar, three hours. Introduction to educational and business themes surrounding leadership in athletics. Emphasis on requisite experiences, knowledge, skills set, and abilities/characteristics for pursuing career in sport team operations; and how this impacts educational experiences of athletes. Study dissects current (mis)perceptions related to careers as general managers or sports agents, and supplies students with actionable plans for career development and advancement. Students learn about potential educational and career impact of impending and passed legislation related to name, image, and likeness rights of contemporary college student-athletes, including detailed discussion and analysis of how California bill fits within overall higher education model at universities such as UCLA. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC175D"
  },
  {
    "course_code": "EDUC 176",
    "units": 5,
    "title": "Transformative Research in Community-Based Settings: Practicum",
    "description": "(Formerly numbered 188B.) Lecture, four hours; fieldwork, one hour. Requisites: courses 35, 160. Introduction to broad tradition of transformative research in education—public scholarship that aims to disrupt long-standing educational inequities in partnership with local communities. This tradition includes Youth Participatory Action Research (YPAR), Community-Based Action Research (CBAR), and other collaborative approaches that value diverse forms of expertise and knowledge. Through variety of community-engaged learning opportunities, students are supported to develop ability to analyze education in social and political context, develop skills for effecting change, demonstrate understanding of multiple perspectives, diversity, pluralism, and social justice. Letter grading.",
    "prerequisites": [
      "EDUC 35",
      "EDUC 160"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC176"
  },
  {
    "course_code": "EDUC M177",
    "units": 4,
    "title": "Creating Safe and Welcoming Schools",
    "description": "(Same as Public Affairs M125.) Lecture, two hours; discussion, one hour. Examination of historical context and causes of school violence, theories, and diverse perceptions of school climate and safety. Special emphasis on impact of school climate on oppressed groups and how social contexts such as poverty and how neighborhood resources influence school safety. Letter grading.",
    "cross_listed": [
      "PUB AFF M125"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM177"
  },
  {
    "course_code": "EDUC CM178",
    "units": 4,
    "title": "Critical Media Literacy and Politics of Gender: Theory and Production",
    "description": "(Same as Gender Studies CM178.) Seminar, three hours. Corequisite: course CM178L. Use of range of pedagogical approaches to theory and practice of critical media literacy that necessarily involves understanding of new technologies and media forms. Study of both theory and production techniques to inform student analysis of media and critical media literacy projects. Concurrently scheduled with course CM278. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "EDUC CM178L"
    ],
    "corequisites": [
      "EDUC CM178L"
    ],
    "cross_listed": [
      "GENDER CM178"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCCM178"
  },
  {
    "course_code": "EDUC CM178L",
    "units": 2,
    "title": "Critical Media Literacy and Politics of Gender: Laboratory",
    "description": "(Same as Gender Studies CM178L.) Laboratory, two hours. Corequisite: course CM178. Hands-on production experience as integral component of course CM178. Concurrently scheduled with course CM278L. Letter grading.",
    "prerequisites": [
      "EDUC CM178"
    ],
    "corequisites": [
      "EDUC CM178"
    ],
    "cross_listed": [
      "GENDER CM178L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCCM178L"
  },
  {
    "course_code": "EDUC 180",
    "units": 4,
    "title": "Orientation to Community Engagement",
    "description": "Seminar, four hours. Limited to Education and Social Transformation majors. Not open for credit to students with credit for course 180W. First course in three-part series to satisfy community engagement requirement for Education and Social Transformation major capstone project. Introduction to conceptions and contexts of community engagement, focusing on possibilities and complexities of critical and asset-based approaches to community engagement. In preparation for students’ own community engagement experiences in community organizations, early childhood centers, or schools in Los Angeles, emphasis on reflecting on positionality, identifying forms of power and privilege, and understanding relationships between systemic issues and community engagement. Letter grading.",
    "equivalent_courses": [
      "EDUC 180W"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC180"
  },
  {
    "course_code": "EDUC 180W",
    "units": 5,
    "title": "Orientation to Community Engagement",
    "description": "Seminar, four hours. Requisite: English Composition 3. Limited to Education and Social Transformation majors. Not open for credit to students with credit for course 180. First course in three-part series to satisfy community engagement requirement for Education and Social Transformation major. Introduction to conceptions and contexts of community engagement, focusing on possibilities and complexities of critical and asset-based approaches to community engagement. In preparation for students’ own community engagement experiences, emphasis on reflecting on positionality, identifying forms of power and privilege, and understanding relationships between systemic issues and community engagement. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "equivalent_courses": [
      "EDUC 180"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC180W"
  },
  {
    "course_code": "EDUC 181",
    "units": 5,
    "title": "Capstone in Education and Social Transformation",
    "description": "Seminar, four hours. Limited to Education and Social Transformation majors. Third course in required capstone sequence for Education and Social Transformation major. Students reflect on their coursework, community engagement experiences, and other curricular and co-curricular opportunities while completing major. Students compile portfolio that incorporates work completed through Education and Social Transformation major curriculum as well as form reflection paper where students synthesize their learning. This includes reflection on their personal development, how coursework and community engagement experience contributed to their fulfillment of learning outcomes for major, and plans for future. Students produce compelling final public presentation of their portfolio. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC181"
  },
  {
    "course_code": "EDUC 187",
    "units": 5,
    "title": "Variable Topics in Education",
    "description": "Seminar, five hours; discussion, two hours. Limited to juniors/seniors. Variable topics course organized around disciplinary knowledge central to development of core understandings of educational and learning processes, phenomenon, policies, methods, and instruction. Development of culminating project. Consult Schedule of Classes for topics and instructors. May be applied as core credit for Education Studies minor students. May be repeated three times for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC187"
  },
  {
    "course_code": "EDUC 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC188SA"
  },
  {
    "course_code": "EDUC 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "EDUC 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC188SB"
  },
  {
    "course_code": "EDUC 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "EDUC 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC188SC"
  },
  {
    "course_code": "EDUC 191A",
    "units": 4,
    "title": "Current Issues in Education",
    "description": "Seminar, four hours. Limited to juniors/seniors. Variable topics course organized on selected current issues basis, integrating field observations and readings through seminar discussions. Development of culminating project. Consult Schedule of Classes for topics and instructors. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC191A"
  },
  {
    "course_code": "EDUC 191B",
    "units": 4,
    "title": "Current Issues in Education",
    "description": "Seminar, four hours. Limited to juniors/seniors. Variable topics course organized on selected current issues basis, integrating field observations and readings through seminar discussions. Development of culminating project. Consult Schedule of Classes for topics and instructors. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC191B"
  },
  {
    "course_code": "EDUC 191C",
    "units": 4,
    "title": "Current Issues in Education",
    "description": "Seminar, four hours. Limited to juniors/seniors. Variable topics course organized on selected current issues basis, integrating field observations and readings through seminar discussions. Development of culminating project. Consult Schedule of Classes for topics and instructors. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC191C"
  },
  {
    "course_code": "EDUC 191D",
    "units": 4,
    "title": "Current Issues in Education",
    "description": "Seminar, four hours. Limited to juniors/seniors. Variable topics course organized on selected current issues basis, integrating field observations and readings through seminar discussions. Development of culminating project. Consult Schedule of Classes for topics and instructors. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC191D"
  },
  {
    "course_code": "EDUC C192A",
    "units": 4,
    "title": "Practicum in Intergroup Dialogue Facilitation",
    "description": "Seminar, three hours. Requisite: course C160. Application and further development of content and skills learned in course C160. In addition to co-facilitating weekly dialogues, students are expected to participate in weekly teaching apprentice practicum seminars. Readings, discussions of group dynamics, and one-on-one meetings with assigned coach. Fosters supportive learning environment where each student facilitator can gain more insight and knowledge into skills of dialogue facilitation and continue process of self-reflection and critical inquiry of own identities, biases, beliefs, and perspectives. Includes learning as large group and time to receive individualized consultation as co-facilitation dyad from instructor. Concurrently scheduled with course C292A. Letter grading.",
    "prerequisites": [
      "EDUC C160"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCC192A"
  },
  {
    "course_code": "EDUC 195",
    "units": 2,
    "title": "Community Internships in Education",
    "description": "Tutorial, one hour; fieldwork, eight to 10 hours. Requisite: course 180. Limited to junior/senior Education and Social Transformation majors. Internship in approved educational or community setting to be supervised by instructor. Students meet biweekly with instructor, write reflective journals, and prepare final paper. May be repeated for credit. Individual contract with supervising faculty member required. Letter grading.",
    "prerequisites": [
      "EDUC 180"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC195"
  },
  {
    "course_code": "EDUC 195CE",
    "units": 4,
    "title": "Community or Corporate Internships in Education",
    "description": "Tutorial, one hour; fieldwork, eight to 10 hours. Requisite: course 180. Limited to junior/senior Education and Social Transformation majors. Internship in supervised educational settings coordinated through Center for Community Engagement. Students meet biweekly with graduate student instructor, complete weekly readings and written assignments, and write final research paper or project as agreed upon with instructor. May be repeated for credit with consent of department. Individual contract with supervising faculty member required. P/NP or letter grading.",
    "prerequisites": [
      "EDUC 180"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC195CE"
  },
  {
    "course_code": "EDUC 196R",
    "units": 2,
    "title": "Research Apprenticeship in Education",
    "description": "Tutorial, three hours per week per unit. Limited to juniors/seniors. Entry-level research apprenticeship for upper-division students under guidance of faculty mentor. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC196R"
  },
  {
    "course_code": "EDUC 196XP",
    "units": 4,
    "title": "Community-Engaged Research Apprenticeship",
    "description": "Tutorial, 12 hours. Requisite: course 180. Recommended: course 160. Limited to junior/senior Education and Social Transformation majors. Research apprenticeship in community setting for upper-division students under guidance of faculty mentor. Faculty advisor must be actively engaged in work of that community and focus of research must address needs of that community. May be repeated for credit. Individual contract required. Letter grading.",
    "prerequisites": [
      "EDUC 180"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC196XP"
  },
  {
    "course_code": "EDUC 197",
    "units": 2,
    "title": "Individual Studies in Education",
    "description": "Tutorial, four hours. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC197"
  },
  {
    "course_code": "EDUC 199",
    "units": 2,
    "title": "Directed Research or Senior Project in Education",
    "description": "Tutorial, to be arranged. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC199"
  },
  {
    "course_code": "EDUC 200A",
    "units": 4,
    "title": "Historical Research and Writing",
    "description": "Lecture, four hours. Methods of historical research and writing for students who are or who will be engaged in research and in report or paper or thesis writing, regardless of their field of interest. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC200A"
  },
  {
    "course_code": "EDUC 200B",
    "units": 4,
    "title": "Survey Research Methods in Education",
    "description": "Lecture, four hours. Requisite: course 230A. Problems of conceptualization, organization, and gathering nonexperimental and quasi-experimental quantitative and qualitative data. S/U or letter grading.",
    "prerequisites": [
      "EDUC 230A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC200B"
  },
  {
    "course_code": "EDUC 200D",
    "units": 4,
    "title": "Research Methods: Special Topics",
    "description": "Lecture, four hours. Variable topics in research methods in education. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC200D"
  },
  {
    "course_code": "EDUC 201",
    "units": 1,
    "title": "Variable Topics Seminar: Education",
    "description": "Seminar, three hours. Variable topics course organized around themes that explore emerging areas in education including the role of education, education policy, race and ethnic studies, social justice, and the sociocultural contexts that shape the field of education. Consult the Schedule of Classes for topics and instructors. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC201"
  },
  {
    "course_code": "EDUC M201C",
    "units": 4,
    "title": "History of American Education",
    "description": "(Same as History M264.) Discussion, three hours. History of educational thought and of social forces impinging on American education from 1880s to present. Analysis of relation between these ideas and forces, and aims and practices of American education today. S/U or letter grading.",
    "cross_listed": [
      "HIST M264"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM201C"
  },
  {
    "course_code": "EDUC 202",
    "units": 4,
    "title": "Evaluation Theory",
    "description": "Lecture, four hours. Prevalent evaluation theories, systems for categorizing these theories, and process of theory development in educational evaluation. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC202"
  },
  {
    "course_code": "EDUC 204A",
    "units": 4,
    "title": "Introduction to Education and Social Sciences",
    "description": "Lecture, four hours. Interdisciplinary course intended to introduce students to study of educational issues, texts, and movements of thought through social sciences and comparative perspectives. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC204A"
  },
  {
    "course_code": "EDUC 204B",
    "units": 4,
    "title": "Introduction to Comparative Education",
    "description": "Lecture, four hours. Examination of conceptual and methodological questions underlying comparative education. Particular attention to development of field and to styles of social analysis that may be applied to comparative and cross-national studies in education. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC204B"
  },
  {
    "course_code": "EDUC 204C",
    "units": 4,
    "title": "Education and National Development",
    "description": "Lecture, four hours. Designed for graduate students. Analysis of various social sciences perspectives and methodologies (including modernization, dependency, Marxist, neo-Marxist, liberation theology, and world-system theories of change and development) and changing notions of role of education in development of less-industrialized countries of world. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC204C"
  },
  {
    "course_code": "EDUC 204D",
    "units": 4,
    "title": "Minority Education in Cross-Cultural Perspective",
    "description": "Lecture, four hours. Historical and contemporary analyses of educational policies with regard to ethnic, religious, and linguistic minorities through selected national and international case studies. Introduction to cross-cultural education in representative countries in relation to social, political, and economic systems. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC204D"
  },
  {
    "course_code": "EDUC 204E",
    "units": 4,
    "title": "International Efforts in Education",
    "description": "Lecture, four hours. Designed for graduate students. Critical analysis of complex world of development cooperation, with particular reference to bilateral and multilateral efforts in education. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC204E"
  },
  {
    "course_code": "EDUC 204F",
    "units": 4,
    "title": "Nonformal Education in Comparative Perspective",
    "description": "Lecture, four hours. Comparative and international study of organized and systematic educational activity for children, youth, and adults carried on outside of schools. Types of programs include, among others, consciousness raising, community action, skills training, literacy, and extension programs. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC204F"
  },
  {
    "course_code": "EDUC 206A",
    "units": 4,
    "title": "Philosophy of Education: Introduction",
    "description": "Lecture, four hours. Systematic introduction to field, indicating ways in which philosophy serves to elucidate educational aims, content, methods, and values. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC206A"
  },
  {
    "course_code": "EDUC 207",
    "units": 5,
    "title": "Politics of Education",
    "description": "(Formerly numbered C207.) Lecture, two hours; discussion, two hours. Political dimensions of education institutions as organizations. Relationships between education institutions and political institutions in society. Political theory as foundation for public policy analysis; interest groups in education policy formation and implementation; and focus on Freirean pedagogy. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC207"
  },
  {
    "course_code": "EDUC 208A",
    "units": 4,
    "title": "Perspectives on Sociology of Education",
    "description": "Lecture, four hours. Sociological perspectives on current issues in educational policy and practice, including desegregation, decentralization, equality of educational opportunity, structure of educational organization, teacher/student relationships, reform in education at elementary, secondary, postsecondary levels. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC208A"
  },
  {
    "course_code": "EDUC 208B",
    "units": 4,
    "title": "(Im)migrant Youth, Ethnography, and Education",
    "description": "Seminar, four hours. Exploration of experiences of immigrant youth in U.S. schools, with focus on language, culture, and educational equity in urban settings. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC208B"
  },
  {
    "course_code": "EDUC 209A",
    "units": 5,
    "title": "History of Higher Education",
    "description": "(Formerly numbered C209A.) Lecture, four hours. Exploration of major eras in history of higher education. Topics include issues concerning access, diversity, parental choice, cultural literacy, teacher empowerment, and role of popular media. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC209A"
  },
  {
    "course_code": "EDUC 209C",
    "units": 4,
    "title": "Research and Evaluation in Higher Education",
    "description": "Lecture, four hours. Development of conceptual and practical understanding of research and evaluation in higher education. Topics include basic statistics, survey design, data analysis, assessment issues, and research proposal writing. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC209C"
  },
  {
    "course_code": "EDUC 211A",
    "units": 4,
    "title": "Educational and Psychological Measurement: Underlying Theory and Practice",
    "description": "Lecture, four hours. Requisite: course 230A. Measurement theory as applied to educational and psychological testing, with focus primarily on classical test theory, reliability estimation, and test construction and selection. S/U or letter grading.",
    "prerequisites": [
      "EDUC 230A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC211A"
  },
  {
    "course_code": "EDUC 211B",
    "units": 4,
    "title": "Educational and Psychological Measurement: Generalizability Theory",
    "description": "Lecture, four hours. Requisites: courses 230A, 230B, 230C. Basic and advanced topics in use of generalizability theory to address problems in measurement. S/U or letter grading.",
    "prerequisites": [
      "EDUC 230A",
      "EDUC 230B",
      "EDUC 230C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC211B"
  },
  {
    "course_code": "EDUC 211C",
    "units": 4,
    "title": "Introduction to Factor Analysis and Item Response Theory",
    "description": "Seminar, three hours. Requisites: course 230B or equivalent, and one course in education measurement (course 200B, 211A, 211B, or equivalent). Introduction to linear factor analysis (FA) and item response theory (IRT) models and their uses in research and assessment. Topics include specification, estimation, evaluation, and interpretation of exploratory and confirmatory models. Students use FA and IRT methods to perform range of basic data analyses. S/U or letter grading.",
    "prerequisites": [
      "EDUC 230B",
      "EDUC 200B",
      "EDUC 211A",
      "EDUC 211B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC211C"
  },
  {
    "course_code": "EDUC 212A",
    "units": 4,
    "title": "Learning and Education",
    "description": "Lecture, four hours. Models of learning, modeling, reinforcement, motivation, encoding, memory, transfer, individual differences, and instruction. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC212A"
  },
  {
    "course_code": "EDUC 212B",
    "units": 4,
    "title": "Motivation and Affect in Educative Process",
    "description": "Lecture, four hours. Review of theoretical and empirical literature on motivational factors in school settings and conditions for acquisition of affective outcomes. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC212B"
  },
  {
    "course_code": "EDUC 217A",
    "units": 4,
    "title": "Social Development and Education",
    "description": "Seminar, four hours. Biological and familial, school, and other influences on children; development in context of current research and theoretical models; consideration of theoretical and methodological research on family, peer group, and school; application of developmental theory and research to educational practice. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC217A"
  },
  {
    "course_code": "EDUC 217B",
    "units": 4,
    "title": "Cognitive Development and Education",
    "description": "Lecture, two hours; discussion, two hours. Designed for graduate students. Critical review of theories and research in cognitive development, with focus on work of Piaget and Vygotsky, and relation of this work to issues in educational practice. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC217B"
  },
  {
    "course_code": "EDUC M217C",
    "units": 4,
    "title": "Personality Development and Education",
    "description": "(Same as Psychology M245.) Lecture, four hours. Review of research and theory of critical content areas in personality development that bear on school performance: achievement motivation, self-concept, aggression, sex differences, empathy, and other social behaviors; review of status of emotional behavior in personality theory and development. S/U or letter grading.",
    "cross_listed": [
      "PSYCH M245"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM217C"
  },
  {
    "course_code": "EDUC 217D",
    "units": 4,
    "title": "Language Development and Education",
    "description": "Lecture, four hours. Research and theory on how children develop their first language; sociolinguistic and psycholinguistic issues in preschool and primary years; bilingual and dialectical issues. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC217D"
  },
  {
    "course_code": "EDUC M217F",
    "units": 4,
    "title": "Adolescent Development",
    "description": "(Same as Psychology M242G.) Seminar, four hours. Designed for graduate students. Review of recent research on physical, cognitive, social, and psychological development during second decade of life. Topics include pubertal development, changes in parent/adolescent relationships, role of peers, identity development, high-risk behaviors, stress and coping, and school adjustment. Letter grading.",
    "cross_listed": [
      "PSYCH M242G"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM217F"
  },
  {
    "course_code": "EDUC 219",
    "units": 4,
    "title": "Laboratory: Advanced Topics in Research Methodology",
    "description": "Laboratory, four hours. Provides assistance in design of research and interpretation of data to advanced students from other divisions. Coverage of special topics not included in other courses on research methods. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC219"
  },
  {
    "course_code": "EDUC 220A",
    "units": 4,
    "title": "Inquiry into Schooling: Organization and Change",
    "description": "Lecture, four hours. Critical analysis of issues in reconstruction of schooling; concepts of function and structure of schooling; organization theory; systems approaches in analysis of organization development and change. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC220A"
  },
  {
    "course_code": "EDUC 221",
    "units": 4,
    "title": "Computer Analyses of Empirical Data in Education",
    "description": "Lecture, two hours; laboratory, two hours. Requisites: courses 209C (section 1), 230A. Designed to develop conceptual and technical skills needed for designing and executing empirical research utilizing statistical packages. Each student conducts two original studies. Equal emphasis on techniques of data analysis and interpretation of results. S/U or letter grading.",
    "prerequisites": [
      "EDUC 209C",
      "EDUC 1",
      "EDUC 230A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC221"
  },
  {
    "course_code": "EDUC 222A",
    "units": 4,
    "title": "Introduction to Qualitative Methods and Design Issues in Educational Research",
    "description": "Lecture, three hours; discussion, one hour. Introductory course for students interested in epistemology, theories, and styles of qualitative research in educational settings. Theory and practice of naturalistic, qualitative research design covered in second half of course. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC222A"
  },
  {
    "course_code": "EDUC 222B",
    "units": 4,
    "title": "Participant-Observation Field Methods",
    "description": "Lecture, two hours; discussion, two hours. Requisite: course 222A. First of two courses on participant-observation field methods. Key skills (e.g., observation, recording, interviewing, role management, data storage) learned through classroom lectures and simulations, and by conducting actual field-based research project. Letter grading.",
    "prerequisites": [
      "EDUC 222A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC222B"
  },
  {
    "course_code": "EDUC 222C",
    "units": 4,
    "title": "Qualitative Data Reduction and Analysis",
    "description": "Lecture, two hours; discussion, two hours. Requisite: course 222B. Continuation of fieldwork project started in course 222B, with focus on practical skills and conceptual/methodological issues involved in reducing and analyzing qualitative data. Letter grading.",
    "prerequisites": [
      "EDUC 222B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC222C"
  },
  {
    "course_code": "EDUC 222D",
    "units": 4,
    "title": "Qualitative Inquiry: Special Topics",
    "description": "Lecture, four hours. Special topics course on some field or aspect of qualitative inquiry. Topics may include classroom ethnography, advanced ethnographic writing and/or multimedia design, discourse analysis, and microethnography of social interaction. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC222D"
  },
  {
    "course_code": "EDUC 223",
    "units": 4,
    "title": "Procedural Issues in Evaluation",
    "description": "Lecture, four hours. Assessment methodologies appropriate for evaluation problems. Writing evaluation proposals, developing program monitoring procedures, selecting appropriate evaluation design strategies, coping with ethical considerations in evaluation, framing decision context, and reporting evaluation results. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC223"
  },
  {
    "course_code": "EDUC 224",
    "units": 4,
    "title": "Leading Change through Evaluation: Methods of Continuous Improvement",
    "description": "Lecture, four hours. Introduction to disciplined inquiry and continuous improvement methods as means for driving change in complex systems. Introduction to organizational learning and change, and adult learning concepts. Focus on disciplined inquiry as strategy to lead change, whether for individuals, teams, or organizations, and its application in education, health care, and other disciplines. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC224"
  },
  {
    "course_code": "EDUC 225A",
    "units": 4,
    "title": "Issues in Education of Exceptional Individuals",
    "description": "Lecture, four hours. Designed for graduate students. Analysis of major research regarding contemporary trends, issues, and programs for exceptional individuals; consideration of commonalities and differences among exceptional individuals. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC225A"
  },
  {
    "course_code": "EDUC 227C",
    "units": 4,
    "title": "Research on Behavioral and Social Characteristics of Exceptional Individuals",
    "description": "Lecture, four hours. Analysis of social and emotional development of exceptional individuals and development of social competence in special education programs. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC227C"
  },
  {
    "course_code": "EDUC 229",
    "units": 4,
    "title": "Seminar: Special Topics in Urban Schooling",
    "description": "Seminar, four hours. Research on selected topics in fields of administration, policy, curriculum, and teaching studies and on conceptualization of hypotheses and research programs on division topics and issues. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC229"
  },
  {
    "course_code": "EDUC CM229B",
    "units": 4,
    "title": "Narratives of Justice: Disrupting School-to-Prison Pipeline—Arts, Activism, and Agency",
    "description": "(Same as African American Studies CM213XP.) Lecture, four hours; discussion, one hour. Exploration of policies and practices, art and activism, and other forms of agency engaging school-to-prison pipeline. Concurrently scheduled with course CM125XP. S/U or letter grading.",
    "cross_listed": [
      "AF AMER CM213XP"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCCM229B"
  },
  {
    "course_code": "EDUC 230A",
    "units": 4,
    "title": "Introduction to Research Design and Statistics",
    "description": "Lecture, four hours. Designed for graduate students. Key concepts and issues in design and conduct of social sciences research. Introduction to descriptive statistics and fundamentals of statistical inference. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC230A"
  },
  {
    "course_code": "EDUC 230AL",
    "units": 1,
    "title": "Introduction to Research Design and Statistics: Computer Laboratory",
    "description": "Laboratory, one hour. Corequisite: course 230A. Computer data analysis laboratory for introductory research design and statistics. Instruction in SPSS, STATA, and SAS statistical analysis packages. S/U grading.",
    "prerequisites": [
      "EDUC 230A"
    ],
    "corequisites": [
      "EDUC 230A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC230AL"
  },
  {
    "course_code": "EDUC 230B",
    "units": 4,
    "title": "Linear Statistical Models in Social Science Research: Multiple Regression Analysis",
    "description": "Lecture, four hours. Requisite: course 230A or passing score on screening examination. Solid and comprehensive training in regression-based methods for analyzing quantitative social science data. Letter grading.",
    "prerequisites": [
      "EDUC 230A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC230B"
  },
  {
    "course_code": "EDUC 230BL",
    "units": 1,
    "title": "Linear Statistical Models: Computer Laboratory",
    "description": "Laboratory, one hour. Corequisite: course 230B. Computer data analysis laboratory for linear statistical models. Instruction in SPSS, STATA, SAS, and other relevant statistical analysis packages. S/U grading.",
    "prerequisites": [
      "EDUC 230B"
    ],
    "corequisites": [
      "EDUC 230B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC230BL"
  },
  {
    "course_code": "EDUC 230C",
    "units": 4,
    "title": "Linear Statistical Models in Social Science Research: Analysis of Designed Experiments",
    "description": "Lecture, four hours. Requisites: courses 230A, 230B. Solid and comprehensive training in experimental design and analysis methods, especially use of analysis of variance methods. S/U or letter grading.",
    "prerequisites": [
      "EDUC 230A",
      "EDUC 230B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC230C"
  },
  {
    "course_code": "EDUC 230CL",
    "units": 1,
    "title": "Linear Statistical Models for Experimental Research: Computer Laboratory",
    "description": "Laboratory, one hour. Corequisite: course 230C. Computer data analysis laboratory for linear statistical models for experimental research. Instruction in SPSS and SAS statistical analysis packages. S/U grading.",
    "prerequisites": [
      "EDUC 230C"
    ],
    "corequisites": [
      "EDUC 230C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC230CL"
  },
  {
    "course_code": "EDUC 231A",
    "units": 4,
    "title": "Toolkit for Quantitative Methods Research",
    "description": "Lecture, four hours. Requisites: courses 230A, 230B, 230C. Elementary probability. Working knowledge with calculus. Mathematical and statistical results useful for advanced quantitative methodology research. Matrix algebra. Random vectors. Multivariate distribution theory. Likelihood and Bayesian estimation and inference. Linear and generalized linear models. Simulation. S/U or letter grading.",
    "prerequisites": [
      "EDUC 230A",
      "EDUC 230B",
      "EDUC 230C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC231A"
  },
  {
    "course_code": "EDUC M231B",
    "units": 4,
    "title": "Factor Analysis",
    "description": "(Same as Psychology M253.) Lecture, four hours. Requisites: courses 211B, 231A. Exploratory factor analysis, rotations, confirmatory factor analysis, multiple-group analysis. S/U or letter grading.",
    "prerequisites": [
      "EDUC 211B",
      "EDUC 231A"
    ],
    "cross_listed": [
      "PSYCH M253"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM231B"
  },
  {
    "course_code": "EDUC 231BL",
    "units": 1,
    "title": "Factor Analysis: Computer Laboratory",
    "description": "Laboratory, one hour. Corequisite: course M231B. Computer data analysis laboratory for exploratory and confirmatory factor analysis. Instruction in CEFA, LISREL, and other relevant statistical analysis packages. S/U grading.",
    "prerequisites": [
      "EDUC M231B"
    ],
    "corequisites": [
      "EDUC M231B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC231BL"
  },
  {
    "course_code": "EDUC 231C",
    "units": 4,
    "title": "Advanced Item Response Theory",
    "description": "(Formerly numbered 211C.) Lecture, four hours. Requisites: courses 231A, M231B. Review of standard item response theory models, multidimensional models, multiple group models and models with covariates, item and person parameter estimation, differential item functioning analysis, testing model fit, linking and scale alignment, computerized adaptive testing. S/U or letter grading.",
    "prerequisites": [
      "EDUC 231A",
      "EDUC M231B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC231C"
  },
  {
    "course_code": "EDUC 231D",
    "units": 4,
    "title": "Advanced Quantitative Models in Nonexperimental Research: Multilevel Analysis",
    "description": "Lecture, four hours. Requisites: courses 230B, 230C. Examination of conceptual, substantive, and methodological issues in analyzing multilevel data (i.e., on individuals in organizational settings such as schools, corporations, hospitals, communities); consideration of alternative analytical models. Letter grading.",
    "prerequisites": [
      "EDUC 230B",
      "EDUC 230C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC231D"
  },
  {
    "course_code": "EDUC M231E",
    "units": 4,
    "title": "Statistical Analysis with Latent Variables",
    "description": "(Same as Statistics M244.) Lecture, three hours. Requisites: courses 231A, M231B. Introduction to general latent variable modeling framework. Important special cases of this framework include confirmatory factor analysis, structural equation models, item response models, latent class models, and multilevel models, among others. Topics include discussions of general statistical and computational framework, model formulation, identification, estimation, and testing. Letter grading.",
    "prerequisites": [
      "EDUC 231A",
      "EDUC M231B"
    ],
    "cross_listed": [
      "STATS M244"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM231E"
  },
  {
    "course_code": "EDUC 233",
    "units": 4,
    "title": "Professional Writing in Education",
    "description": "Lecture, four hours. Intended to assist in professional development as writers, with focus on style and organization, scholarly genres, modes of discourse, and broader issues of conceptualization and method. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC233"
  },
  {
    "course_code": "EDUC 234",
    "units": 4,
    "title": "Critical Perspectives on Economic Approaches to Education",
    "description": "Seminar, four hours. Introduction to concepts and principles in economics of education using critical perspective. Overview of evolving relationship between education and economics, including growing use of education as economic policy tool and increased role of economic principles in internal functioning of educational systems. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC234"
  },
  {
    "course_code": "EDUC 235",
    "units": 4,
    "title": "Comparative Political Economy of Education and Skills",
    "description": "Seminar, four hours. Use of political economy of education perspective for exploring, at international and comparative levels, link between alternative models of governing, providing and financing education and training systems and impact of alternatives on outcomes such as unequal chances to learn, types of skill formation, and well-being. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC235"
  },
  {
    "course_code": "EDUC 237",
    "units": 4,
    "title": "Law and Urban Education",
    "description": "Lecture, four hours. Examination of recent legal controversies that may impact ability of urban educators to meet needs of students in multicultural society, with special emphasis on such equity-related issues as desegregation, school finance, standardized testing, and rights of language minority students. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC237"
  },
  {
    "course_code": "EDUC 238",
    "units": 4,
    "title": "Cross-National Analysis of Higher Education",
    "description": "Lecture, four hours. Comparative study of national systems of higher education: their division of work, basic values, structures of authority, modes of national integration, and types of change. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC238"
  },
  {
    "course_code": "EDUC 240",
    "units": 4,
    "title": "Immigrant Children and Education",
    "description": "Seminar, four hours. Examination of immigrant child and youth experience, with primary focus on educational outcomes. Topics include historical changes in experiences of immigrant youth, dynamics of immigrant families, cultural, ethnic, and socioeconomic status-related influences in immigrant youths’ adjustment, and school-family connections. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC240"
  },
  {
    "course_code": "EDUC 241",
    "units": 4,
    "title": "Conceptual Frameworks for Research in Urban Education",
    "description": "Seminar, four hours. Examination of diverse set of foundational theories for educational researchers concerned with understanding, designing, and studying transformative, culturally sustaining, and democratic educational practices. Includes both founding parents and neo perspectives in emancipatory/liberatory pedagogy, sociocultural/sociohistorical activity theory, critical race theory, cultural modeling/culturally sustaining pedagogy and contributions from learning sciences, indigenous, post-colonial, sociological, political-economic, and anthropological approaches to educational research. Attends both to original ideas and how they have changed over time, as well as how faculty in the Urban Schooling program draw on these frameworks for their research. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC241"
  },
  {
    "course_code": "EDUC 242",
    "units": 4,
    "title": "Learning, Culture, and Schooling",
    "description": "Seminar, four hours. Education typically refers to explicit efforts by experienced members of society to instruct new members in acceptable ways of thinking and acting in that society. Study of how learning sciences—broadly, social sciences interested in study of learning, with particular focus on variants of psychology—attempt to explain human cognitive development, and how people learn to think and act. Investigation of how accounts of learning and development can be, and have been, used to inform instruction in school. Focus on schools primarily as means to examine how theoretical perspectives on learning can inform praxis and scholarship or educational justice and equity. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC242"
  },
  {
    "course_code": "EDUC 243",
    "units": 4,
    "title": "Reflection on Methods in Social Sciences",
    "description": "Lecture, four hours. Preparation: two research methods courses. Fundamental issues surrounding use of methods in social sciences, including issues in philosophy of social sciences, relationship between theory and facts, ontological status of constructs, cognition and social research, sources of evidence in ethnography, research and social policy. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC243"
  },
  {
    "course_code": "EDUC C244",
    "units": 4,
    "title": "Theory and Practice of Intergroup Dialogue: Building Facilitation Skills",
    "description": "Seminar, four hours. Topics include social psychology of intergroup relations, intercultural and dialogic communication theories, methods for reconciling and bridging differences in schools and communities, research and evaluation of intergroup dialogues and other educational methods for improving intergroup relations, and core competencies for planning, delivering, and evaluating intergroup dialogues in multicultural settings. While providing foundational grounding in theory and pedagogy of intergroup dialogue, particular attention to relationships between intergroup dynamics, structural inequalities, systems of privilege and oppression, and mental health outcomes and disparities among populations. Concurrently scheduled with course C124. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCC244"
  },
  {
    "course_code": "EDUC 246A",
    "units": 4,
    "title": "Decision Analysis and Advanced Computer Methods for Educational Policy and Planning",
    "description": "Seminar, four hours. How information technology and decision analysis impact K-12 schooling, higher education, and technical training/workplace settings. With research paper, oral presentation, and two research briefs, students can pursue decision analysis areas of special interest to their professional and career objectives. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC246A"
  },
  {
    "course_code": "EDUC 248",
    "units": 4,
    "title": "Seminar: Special Topics in Child Development and Education",
    "description": "Seminar, four hours. Content varies; limits of investigation set by individual instructor. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC248"
  },
  {
    "course_code": "EDUC 249",
    "units": 4,
    "title": "Theories and Methods in Developmental Science",
    "description": "Lecture, three hours. Broad overview of theories and methods used to study development of children in context. Introduction to foundational theories in field of developmental science, and exposure to range of methodological approaches—ranging from sources of data to analytic approaches—that researchers use to characterize developmental change. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC249"
  },
  {
    "course_code": "EDUC 250A",
    "units": 4,
    "title": "Fundamentals of U.S Higher Education System",
    "description": "Lecture, four hours. Designed for graduate students. Two-course sequence designed to orient new students to issues, ideas, and literature that constitute this division, with emphasis on underlying social and political issues that shape higher education and organizational change. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC250A"
  },
  {
    "course_code": "EDUC 250B",
    "units": 4,
    "title": "Organizational Analysis of Higher Education",
    "description": "Lecture, four hours. Designed for graduate students. Two-course sequence designed to orient new students to issues, ideas, and literature that constitute this division, with emphasis on underlying social and political issues that shape higher education and organizational change. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC250B"
  },
  {
    "course_code": "EDUC 250C",
    "units": 4,
    "title": "Theoretical Frameworks of Higher Education",
    "description": "Lecture, four hours. Designed for graduate students. Overview of various social sciences theories used to analyze institutions and issues of contemporary higher education. Explanation of how theory and methodology affect research design and framing of research questions in studies of higher education. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC250C"
  },
  {
    "course_code": "EDUC 252B",
    "units": 4,
    "title": "Educational Enterprise",
    "description": "Lecture, two hours; discussion, two hours. Requisite: course 252A. Limited to Educational Leadership Program students. Use of structural, human resource, political, and symbolic frames to study K-16 education, with focus on educational environments, organizations, and curriculum and instruction. Letter grading.",
    "prerequisites": [
      "EDUC 252A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC252B"
  },
  {
    "course_code": "EDUC M253A",
    "units": 4,
    "title": "Seminar: Current Problems in Comparative Education",
    "description": "(Same as Gender Studies M253A.) Seminar, four hours. Examination of some of most influential critical theorists, including Marx, Nietzsche, Freud, Marcuse, Foucault, Fanon, and de Beauvoir and their contributions to critique of contemporary education, society, and politics. S/U or letter grading.",
    "cross_listed": [
      "GENDER M253A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM253A"
  },
  {
    "course_code": "EDUC 253B",
    "units": 4,
    "title": "Seminar: African Education",
    "description": "Seminar, four hours. Designed for graduate students. Contemporary issues in African educational systems, including questions of access and equity, quality and efficiency, relevance and responsiveness, links between schools and communities, and policy and practice in education. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC253B"
  },
  {
    "course_code": "EDUC 253C",
    "units": 4,
    "title": "Seminar: Asian Education",
    "description": "Seminar, four hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC253C"
  },
  {
    "course_code": "EDUC 253D",
    "units": 4,
    "title": "Seminar: Latin American Education",
    "description": "Seminar, four hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC253D"
  },
  {
    "course_code": "EDUC 253G",
    "units": 4,
    "title": "Seminar: Asian Americans and Education",
    "description": "Seminar, four hours. Basic issues and topics related to Asian Americans in field of education. Examples of issues and topics include Asian Americans and community, socioeconomic status, education-to-work transition, language and culture question. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC253G"
  },
  {
    "course_code": "EDUC 253H",
    "units": 4,
    "title": "Seminar: Chicanos/Hispanics and Education",
    "description": "Seminar, four hours. Basic issues and topics related to Chicanos and other Hispanic groups in education. Review of literature on specific educational levels and Chicano/Hispanic student progress (e.g., early childhood, elementary, higher education; specific topics: assessment, access, tracking, segregation; implications for schooling). S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC253H"
  },
  {
    "course_code": "EDUC 253I",
    "units": 4,
    "title": "Education and Social Change in Middle East and Islamic World",
    "description": "Seminar, four hours. Critical and analytic examination of historical and current role of traditional and modern (Western) education in affecting social, political, and economic changes in countries of Middle East and Islamic world (including Pacific Rim, South and Central Asia). S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC253I"
  },
  {
    "course_code": "EDUC 254",
    "units": 4,
    "title": "Seminar: History of Education",
    "description": "Seminar, four hours. Requisite: course M201C. Study of current movements in historiography of education and critical reading of texts in history of education. S/U or letter grading.",
    "prerequisites": [
      "EDUC M201C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC254"
  },
  {
    "course_code": "EDUC 255A",
    "units": 4,
    "title": "Seminar: Special Topics—Measurement",
    "description": "Seminar, four hours. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC255A"
  },
  {
    "course_code": "EDUC 255B",
    "units": 4,
    "title": "Seminar: Special Topics—Design",
    "description": "Seminar, four hours. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC255B"
  },
  {
    "course_code": "EDUC 255C",
    "units": 4,
    "title": "Seminar: Special Topics—Data Analysis",
    "description": "Seminar, four hours. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC255C"
  },
  {
    "course_code": "EDUC 256A",
    "units": 4,
    "title": "Seminar: Special Topics in School Learning",
    "description": "Seminar, four hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC256A"
  },
  {
    "course_code": "EDUC 256B",
    "units": 4,
    "title": "Seminar: Special Topics in Development",
    "description": "Seminar, four hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC256B"
  },
  {
    "course_code": "EDUC 259",
    "units": 4,
    "title": "Administration of International Programs in Higher Education",
    "description": "Seminar, four hours. Introduction to theory and practice of internationalization in U.S. higher education, looking at meaning of concept of comprehensive internationalization across campus, issues of effective leadership and management, and individual aspects of internationalization, including study abroad program development and implementation, international student recruitment and support services, international curriculum—area and language studies, English as a second language programs, international internships and careers, faculty development in international travel and research, international partnerships/branch campuses, international development and grant projects, international alumni, distance learning/massive open online courses (MOOCs)/hybrid models. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC259"
  },
  {
    "course_code": "EDUC M260A",
    "units": 4,
    "title": "Introduction to Programming and Data Management",
    "description": "(Formerly numbered 260A.) (Same as Public Policy M276A.) Lecture, three hours. Fundamental skills of data management. Development of strong foundation in R programming language. R is most popular language for statistical analysis and one of most popular languages for data science applications (e.g., web-scraping, interactive maps, network analysis). Students become proficient in data management and R programming through weekly problem sets, completed in groups. No prior experience with R required. S/U or letter grading.",
    "cross_listed": [
      "PUB PLC M276A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM260A"
  },
  {
    "course_code": "EDUC M260B",
    "units": 4,
    "title": "Fundamentals of Programming",
    "description": "(Formerly numbered 260B.) (Same as Public Policy M276B.) Lecture, three hours. Recommended requisite: course M260A. Second course in programming/data science sequence designed for students who do not have programming background. Uses primarily R programming language. Organized around practical programming skills/concepts that are fundamental across modern object-oriented programming languages (e.g., Python, Javascript). Topics include organizing files, folders, and scripts; reading (importing) and writing (exporting) data; using Git and GitHub for version control and collaboration; iteration (e.g., loops); conditional execution; writing functions; strings and regular expressions. These general programming skills are prerequisite for flashier data science applications (e.g., web-scraping, interactive maps). Students become proficient in programming skills/concepts through weekly problem sets, completed in groups. S/U or letter grading.",
    "prerequisites": [
      "EDUC M260A"
    ],
    "cross_listed": [
      "PUB PLC M276B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM260B"
  },
  {
    "course_code": "EDUC 261E",
    "units": 4,
    "title": "Higher Education Seminar: Diversity Issues and Research Perspectives",
    "description": "Seminar, four hours. Examination of how racial diversity and its related dynamics have transformed and at same time been reshaped by institutions of higher education, with focus specifically on student experiences, curricula, institutional climate, educational policies, and administrative practices. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC261E"
  },
  {
    "course_code": "EDUC 261F",
    "units": 4,
    "title": "Seminar: Cognitive and Personal Development of College Students",
    "description": "Seminar, four hours. Examination of cognitive development of college students; issues of personal and social development, including leadership, and interpersonal relations and skills. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC261F"
  },
  {
    "course_code": "EDUC 262B",
    "units": 4,
    "title": "Seminar: Reading",
    "description": "Seminar, four hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC262B"
  },
  {
    "course_code": "EDUC 263",
    "units": 4,
    "title": "Seminar: Higher Education",
    "description": "Seminar, four hours. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC263"
  },
  {
    "course_code": "EDUC 264",
    "units": 4,
    "title": "Seminar: Teacher Education",
    "description": "Seminar, four hours. Research, issues, and practices in preservice and in-service teacher preparation, evaluation, and certification. Social, philosophical, and methodological issues and current trends in America and abroad. Opportunities to observe, participate in, and discuss teacher education programs. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC264"
  },
  {
    "course_code": "EDUC 265",
    "units": 4,
    "title": "Higher Education Policy",
    "description": "Lecture, four hours. Requisites: courses 250A, 250B. Understanding public policy for higher education requires understanding of both issues and policy process. Review of major topics on which U.S. government is active, as well as key actors and their influence. Letter grading.",
    "prerequisites": [
      "EDUC 250A",
      "EDUC 250B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC265"
  },
  {
    "course_code": "EDUC M266",
    "units": 4,
    "title": "Feminist Theory and Social Sciences Research",
    "description": "(Same as Gender Studies M266.) Lecture, four hours. Examination of how diverse feminist social theories of last quarter century have both challenged and strengthened conventional social sciences theories and their methodologies. Introduction especially to feminist standpoint theory, distinctive critical theory methodology now widely used in social sciences. Letter grading.",
    "cross_listed": [
      "GENDER M266"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM266"
  },
  {
    "course_code": "EDUC 270",
    "units": 4,
    "title": "Introduction to Cultural Studies",
    "description": "Lecture, four hours. Investigation of current trends in cultural studies through examination of different methods of cultural interpretation, seminal texts in cultural studies, and practical criticism engaging popular artifacts of media culture. Emphasis on developing critical media literacy as goal of cultural studies. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC270"
  },
  {
    "course_code": "EDUC 272",
    "units": 4,
    "title": "Case-Study Research in Education Policy and Practice",
    "description": "Discussion, four hours. Use of case-study methods in education research, providing opportunities for applying methodological skills to actual case-study research projects. Focus on single and multiple case studies that investigate issues in education policy and practice. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC272"
  },
  {
    "course_code": "EDUC 274",
    "units": 4,
    "title": "Science, Technology, and Social Research after Eurocentrism",
    "description": "Lecture, four hours. Philosophy of natural sciences for social scientists that examines challenges to conventional research assumptions raised by multicultural and postcolonial science and technology studies that have emerged since World War II. Focus on sciences and technologies in third-world development projects, comparative ethnoscience movements, and new theories of knowledge and how to do maximally objective research emerging from these literatures. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC274"
  },
  {
    "course_code": "EDUC 275",
    "units": 4,
    "title": "Race and Education",
    "description": "Seminar, four hours. Limited to graduate students. Examination of role of race in educational policymaking. Exploration of broad interpretation of how schools contribute to racial stratification and inequality by linking sociological and sociopsychological theories of race, racial attitudes, and conflict to historical policy analysis. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC275"
  },
  {
    "course_code": "EDUC CM278",
    "units": 4,
    "title": "Critical Media Literacy and Politics of Gender: Theory and Production",
    "description": "(Same as Gender Studies CM278.) Seminar, three hours. Corequisite: course CM278L. Use of range of pedagogical approaches to theory and practice of critical media literacy that necessarily involves understanding of new technologies and media forms. Study of both theory and production techniques to inform student analysis of media and critical media literacy projects. Concurrently scheduled with course CM178. Letter grading.",
    "prerequisites": [
      "EDUC CM278L"
    ],
    "corequisites": [
      "EDUC CM278L"
    ],
    "cross_listed": [
      "GENDER CM278"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCCM278"
  },
  {
    "course_code": "EDUC CM278L",
    "units": 2,
    "title": "Critical Media Literacy and Politics of Gender: Laboratory",
    "description": "(Same as Gender Studies CM278L.) Laboratory, two hours. Corequisite: course CM278. Hands-on production experience as integral component of course CM278. Concurrently scheduled with course CM178L. Letter grading.",
    "prerequisites": [
      "EDUC CM278"
    ],
    "corequisites": [
      "EDUC CM278"
    ],
    "cross_listed": [
      "GENDER CM278L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCCM278L"
  },
  {
    "course_code": "EDUC 280A",
    "units": 2,
    "title": "Seminar: Selected Topics in Special Education",
    "description": "Seminar, two to six hours. Focus on research and clinical problems in special education. Introduction to range of clinical services and research strategies. Exploration of current topics in field. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC280A"
  },
  {
    "course_code": "EDUC 281",
    "units": 4,
    "title": "College Access Seminar",
    "description": "Seminar, two hours; discussion, two hours. Knowledge of changing dynamics of college access at individual, organizational, and field levels and understanding of links between K-12 and postsecondary stratification and how educational advantage and disadvantage accumulates throughout education and affects equity in college access. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC281"
  },
  {
    "course_code": "EDUC 284",
    "units": 4,
    "title": "Critical Theory in Education: Power, Politics, and Liberation",
    "description": "Lecture, four hours. Designed for graduate students. Introduction to major themes, issues, and methodologies within what has come to be known as critical and educational tradition, including some major theoretical writings in liberal, neo-Marxist, left liberal/postmodernist, and Marxist subfields of critical education tradition. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC284"
  },
  {
    "course_code": "EDUC 285",
    "units": 4,
    "title": "Education and Law",
    "description": "Lecture, four hours. Examination of recent high-profile, education-related disputes at both K-12 and higher education levels. Exploration of topics including campus safety and privacy, student freedom of expression, technology-related issues and concerns, religion in schools, cyberbullying, and accountability for off-campus behavior. Examination of access to quality education by analyzing disputes arising at every stage of education process, from issues regarding practices that may engender school-to-prison pipeline to ongoing legal battles regarding race-conscious policies, Every Student Succeeds Act, K-12 teacher tenure, school sports, unmet needs of English language learners, misuse of special education system, impact of burgeoning charter school movement, and rights of undocumented students. Concurrently taught with Law 282. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC285"
  },
  {
    "course_code": "EDUC M286",
    "units": 4,
    "title": "Language, Culture, and Education",
    "description": "(Same as Anthropology M256.) Seminar, three hours. Examination of ongoing movement to reclaim and reimagine schooling as site to sustain indigenous, Black, Latinx, Asian and Pacific Islander communities, including ways these identities/memberships intersect with gender identity and expression, sexuality, dis/ability, language, migration, place, class, and more. For centuries of teaching and learning, communities have sought to push against ways nation-state schools have devalued communities, their lifeways, and their lives. Most recently, this movement is indebted to several decades of research, theory, and practice in asset or strength-based pedagogy tradition. Work on culturally sustaining pedagogy (CSP) has joined these decades (and centuries) of work to offer vision of school that seeks to perpetuate and foster—to sustain—linguistic, literate, and cultural pluralism as part of schooling for positive social transformation and revitalization. S/U or letter grading.",
    "cross_listed": [
      "ANTHRO M256"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCM286"
  },
  {
    "course_code": "EDUC 287",
    "units": 4,
    "title": "Research on Language Issues in Education",
    "description": "Seminar, four hours. Roles of language(s) in formal and informal education, including study of opportunities and challenges offered by language variation found in schools. Examination of language acquisition theories along with those of language ideologies, language policies, and multilingualism. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC287"
  },
  {
    "course_code": "EDUC 288",
    "units": 2,
    "title": "Research Apprenticeship Course",
    "description": "Discussion, two hours. Course facilitates mentorship model of training PhD students in education, with focus on development of graduate student research topics. Assignment of common readings related to these topics; students have opportunity to offer and receive feedback. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC288"
  },
  {
    "course_code": "EDUC C292A",
    "units": 4,
    "title": "Practicum in Intergroup Dialogue Facilitation",
    "description": "Seminar, three hours. Requisite: course C244. Application and further development of content and skills learned in course C244. In addition to co-facilitating weekly dialogues, students are expected to participate in weekly teaching apprentice practicum seminars. Readings, discussions of group dynamics, and one-on-one meetings with assigned coach. Fosters supportive learning environment where each student facilitator can gain more insight and knowledge into skills of dialogue facilitation and continue process of self-reflection and critical inquiry of own identities, biases, beliefs, and perspectives. Includes learning as large group and time to receive individualized consultation as co-facilitation dyad from instructor. Concurrently scheduled with course C192A. Letter grading.",
    "prerequisites": [
      "EDUC C244"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUCC292A"
  },
  {
    "course_code": "EDUC 295",
    "units": 4,
    "title": "Freire",
    "description": "Seminar, four hours. Analysis of intellectual production of Paulo Freire linked to social context in which it took place. Study of his life and work in five phases: Brazilian Experience (1921 to 1964); Chilean Experience, where he published Education as Practice of Freedom and Pedagogy of Oppressed, as well as other lesser-known works, while also devoting most of this period to empirical research in literacy training (1964 to 1969); his work at Harvard, and then World Council of Churches in Geneva (1970 to 1980), including his consulting with postcolonial revolutionary governments in Africa; his return to Brazil and his work as Secretary of Education in São Paulo (1989 to 1992); and his global travels from 1980 until his death in 1997. Focus on work left incomplete before his death (including eco-pedagogy and citizen’s schools), and by implication his analyses, critiques, and impact in world, his methodology of generative word, and comparisons with other theoretical referents. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC295"
  },
  {
    "course_code": "EDUC 296A",
    "units": 2,
    "title": "Seminar: Research Topics in Education",
    "description": "Seminar, three hours. Advanced study and analysis of current topics in education. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC296A"
  },
  {
    "course_code": "EDUC 296B",
    "units": 2,
    "title": "Seminar: Research Topics in Education",
    "description": "Seminar, three hours. Advanced study and analysis of current topics in education. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC296B"
  },
  {
    "course_code": "EDUC 296C",
    "units": 2,
    "title": "Seminar: Research Topics in Education",
    "description": "Seminar, three hours. Advanced study and analysis of current topics in education. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC296C"
  },
  {
    "course_code": "EDUC 296D",
    "units": 2,
    "title": "Seminar: Research Topics in Education",
    "description": "Seminar, three hours. Advanced study and analysis of current topics in education. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC296D"
  },
  {
    "course_code": "EDUC 296G",
    "units": 2,
    "title": "Research Topics in Education: Legal Aspects of Educational Management",
    "description": "Lecture, two hours. Examination and analysis of legal issues, especially as they apply to school organizations. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC296G"
  },
  {
    "course_code": "EDUC 296H",
    "units": 2,
    "title": "Research Topics in Education: Organizational Theory",
    "description": "Lecture, two hours. Examination and analysis of organizational theories, especially as they apply to school organizations. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC296H"
  },
  {
    "course_code": "EDUC 296I",
    "units": 2,
    "title": "Theory in Educational Inquiry",
    "description": "Seminar, two hours. Theory and its application to study of educational settings and institutions. Examination of major paradigms, important schools of thought, and particular theoretical areas and theories within field of education, with focus both on conceptually and empirically based works as means for grounding discussions of theory and application. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC296I"
  },
  {
    "course_code": "EDUC 296J",
    "units": 2,
    "title": "Introduction to Survey Research Methods",
    "description": "Seminar, two hours. Introduction to conceptual and methodological issues involved in survey-based research in education, offering structured opportunity to practice various practical aspects of survey (instrument) development. Questionnaire design, format, and delivery; question writing, pretesting, and testing; and sample design and considerations, nonresponse, measurement error, and data preparation. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC296J"
  },
  {
    "course_code": "EDUC 296K",
    "units": 2,
    "title": "Research Design",
    "description": "Seminar, two hours. Effective educational leaders require ability to accurately diagnose educational problems before jumping to proposed solutions. Study designs must include systematic ways to collect and analyze data, as well as minimize potential threats to validity of data and analysis. Designed to equip students with tools needed to design research studies that address specific real-world educational problems. Basic understanding of research designs as strategies for investigating educational problems, such as types of questions that can be answered appropriately with qualitative and mixed methods studies, design components, planning for fieldwork and data collection, sampling, ethics, and credibility. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC296K"
  },
  {
    "course_code": "EDUC 298A",
    "units": 4,
    "title": "Introduction to Master's Research in Education",
    "description": "Seminar, three hours. Introduction and survey of pedagogies, theories, research, policies, and paradigms in education, specifically centering on a broad range of topical issues concerned with the relationships between social justice and education within self (cognitive, social, emotional), local, national, and international contexts. Through applied emphasis, offers guidance and techniques in writing and research to support the successful completion of division-specific culminating examination projects. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC298A"
  },
  {
    "course_code": "EDUC 298B",
    "units": 4,
    "title": "Research Capstone I: Project Development",
    "description": "Seminar, three hours. Supports students in the development and implementation of the research capstone project. and Deeper exploration of issues concerned with the relationships between social justice and education within self (cognitive, social, emotional), local, national, and international contexts. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC298B"
  },
  {
    "course_code": "EDUC 298C",
    "units": 4,
    "title": "Research Capstone II: Analyses, Interpretation, and Project",
    "description": "Seminar, three hours. Analysis and interpretation of data and findings. Completion of the research capstone project to be presented as part of final culminating project. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC298C"
  },
  {
    "course_code": "EDUC 299A",
    "units": 4,
    "title": "Research Practicum: Education",
    "description": "Clinical, to be arranged. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC299A"
  },
  {
    "course_code": "EDUC 299B",
    "units": 4,
    "title": "Research Practicum: Education",
    "description": "Clinical, to be arranged. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC299B"
  },
  {
    "course_code": "EDUC 299C",
    "units": 4,
    "title": "Research Practicum: Education",
    "description": "Clinical, to be arranged. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC299C"
  },
  {
    "course_code": "EDUC 301",
    "units": 2,
    "title": "Introduction to Information and Presentation Tools",
    "description": "Laboratory, two hours. Limited to credential program students. Sequence of laboratory sessions providing preservice teachers with introduction to education technology infrastructure and classroom presentation tools. Introduction to resources and services, e-mail functions and Internet, and presentation software and multimedia elements. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC301"
  },
  {
    "course_code": "EDUC 305",
    "units": 2,
    "title": "Health Education for Teachers",
    "description": "Lecture, two hours. Limited to Teacher Education Program students. Teaching/learning process as applied to personal and community health. Topics include psychoactive drugs (alcohol, tobacco, and narcotics), human sexuality, nutrition, community health resources, and analysis of state’s health framework. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC305"
  },
  {
    "course_code": "EDUC 309",
    "units": 2,
    "title": "Methodologies for English Language Learners",
    "description": "Laboratory, two hours. Limited to credential program students. Pedagogy for bilingual and English language learners. Discussion of competencies needed by all content area teachers of English language, including strategies for teaching in and through English. Topics include educational issues, organizational approaches, and communicative approach; strategies and activities. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC309"
  },
  {
    "course_code": "EDUC 315",
    "units": 3,
    "title": "Principles and Methods for Teaching Reading for Multiple Subject Instruction",
    "description": "Lecture, three hours. Reading instruction in elementary schools. Analysis of reading problems and programs; study of relationships between language/culture/cognition and reading. Examination and development of instructional programs; analysis and practice of alternative instructional methods. Observation and participation in schools. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC315"
  },
  {
    "course_code": "EDUC 315B",
    "units": 3,
    "title": "Elementary Literacy Methods",
    "description": "Seminar, three hours. Theoretical principles and pedagogical strategies necessary for developing and maintaining balanced comprehensive literacy program for elementary students. Examination of how children learn to read, write, and use language. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC315B"
  },
  {
    "course_code": "EDUC 318A",
    "units": 3,
    "title": "Integrated Methods for Elementary Teachers",
    "description": "Lecture, three hours. Examination and development of instructional programs and analyses and practices of instructional methods for teaching K-6 content, with emphasis on interdisciplinary approach that integrates content areas. Aligned with California state frameworks and California content standards for grades K-12 that address needs and interests of diverse students. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC318A"
  },
  {
    "course_code": "EDUC 318B",
    "units": 4,
    "title": "Integrated Methods for Elementary Teachers",
    "description": "Lecture, four hours. Examination and development of instructional programs and analyses and practices of instructional methods for teaching K-6 content, with emphasis on interdisciplinary approach that integrates content areas and infuses literacy, technology, and strategies for second language learners. Aligned with California state frameworks and California content standards for grades K-12, including English Language Development Standards—all of which address needs and interests of diverse students. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC318B"
  },
  {
    "course_code": "EDUC 318C",
    "units": 3,
    "title": "Integrated Methods for Elementary Teachers",
    "description": "Lecture, three hours. Examination and development of instructional programs and analyses and practices of instructional methods for teaching K-6 content, with emphasis on interdisciplinary approach that integrates content areas and infuses literacy, technology, and strategies for second language learners. Aligned with California state frameworks and California content standards. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC318C"
  },
  {
    "course_code": "EDUC 319",
    "units": 3,
    "title": "Mathematics Methods",
    "description": "Lecture, three hours. Details of children’s mathematics thinking and use of that information as way to ground learning about teaching of mathematics. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC319"
  },
  {
    "course_code": "EDUC 320A",
    "units": 4,
    "title": "Secondary Content and Literacy Methods",
    "description": "Lecture, three hours. Examination and development of instructional programs and analyses and practices of instructional methods for teaching content in grades 7-12. Emphasis on interdisciplinary approach that integrates content areas and infuses literacy, technology, and strategies for second language learners. Methods courses are aligned with California state frameworks and California content standards for grades K-12, including English Language Development Standards—all of which address needs and various interests of diverse students. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC320A"
  },
  {
    "course_code": "EDUC 320B",
    "units": 3,
    "title": "Secondary Content and Literacy Methods",
    "description": "Lecture, three hours. Examination and development of instructional programs and analyses and practices of instructional methods for teaching content in grades 7-12. Emphasis on interdisciplinary approach that integrates content areas and infuses literacy, technology, and strategies for second language learners. Methods courses are aligned with California state frameworks and California content standards for grades K-12, including English Language Development Standards—all of which address needs and various interests of diverse students. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC320B"
  },
  {
    "course_code": "EDUC 320C",
    "units": 3,
    "title": "Secondary Content and Literacy Methods",
    "description": "Lecture, three hours. Examination and development of instructional programs and analyses and practices of instructional methods for teaching content in grades 7-12. Emphasis on interdisciplinary approach that integrates content areas and infuses literacy, technology, and strategies for second language learners. Methods courses are aligned with California state frameworks and California content standards for grades K-12, including English Language Development Standards &equals;&equals; all of which address needs and various interests of diverse students. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC320C"
  },
  {
    "course_code": "EDUC 321A",
    "units": 3,
    "title": "Secondary Content and Literacy Methods in Ethnic Studies",
    "description": "Lecture, three hours. Examination and development of instructional programs, analyses, and practices of instructional methods for teaching ethnic studies in grades 7 through 12, with emphasis on interdisciplinary approach that integrates content areas and infuses literacy, technology, and strategies for second language learners. Methods courses align with California state frameworks and California content standards for grades K through 12, including English Language Development Standards—all of which address needs and various interests of diverse students. Ethnic studies curriculum focuses on Chicano studies, African American/Black studies, indigenous studies, Asian American studies, and gender/sexuality studies and how to develop curriculum focused on local histories in urban classrooms. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC321A"
  },
  {
    "course_code": "EDUC 321B",
    "units": 3,
    "title": "Ethnic Studies Curriculum Development",
    "description": "Lecture, three hours. Examination and development of theoretical frameworks around curriculum development for ethnic studies in grades 7 through 12, with emphasis on interdisciplinary approach that integrates content areas and infuses literacy, technology, and strategies for second language learners. Methods courses align with California state frameworks and California content standards for grades K through 12, including English Language Development Standards—all of which address needs and various interests of diverse students. Ethnic studies curriculum focuses on Chicano studies, African American/Black studies, indigenous studies, Asian American studies, gender/sexuality studies, and how to develop curriculum focused on local histories in Los Angeles urban classrooms. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC321B"
  },
  {
    "course_code": "EDUC 328",
    "units": 2,
    "title": "Principles and Methods for Teaching Mandarin Effectively",
    "description": "Lecture, two to six hours. Emphasis on proficiency-based foreign language teaching methods incorporating language assessment skills, modeling, hands-on experiences, and development of teaching and teacher-training materials. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC328"
  },
  {
    "course_code": "EDUC 330A",
    "units": 2,
    "title": "Observation and Participation",
    "description": "Site-based fieldwork, 10 to 15 hours. Students are assigned to school sites with racially, culturally, and linguistically diverse student populations. Throughout observation and participation period, students analyze effective strategies for achieving learning for all students, including sociocultural approaches and appropriate use of educational technology. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC330A"
  },
  {
    "course_code": "EDUC 330B",
    "units": 4,
    "title": "Student Teaching",
    "description": "Site-based fieldwork, 10 to 20 hours. Requisite: course 330A. Students are assigned to student teach in designated school sites with racially, culturally, and linguistically diverse student populations. Throughout student teaching period, students as novice teachers plan, implement, and assess daily lessons and units, as well as actively engage in reflecting on issues specific to school/community relations. S/U grading.",
    "prerequisites": [
      "EDUC 330A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC330B"
  },
  {
    "course_code": "EDUC 330C",
    "units": 4,
    "title": "Student Teaching",
    "description": "Site-based fieldwork, 10 to 30 hours. Requisite: course 330A. Students are assigned to student teach in designated school sites with racially, culturally, and linguistically diverse student populations. Throughout student teaching period, students as novice teachers plan, implement, and assess daily lessons and units, as well as actively engage in reflecting on issues specific to school/community relations. Increased daily responsibilities. S/U grading.",
    "prerequisites": [
      "EDUC 330A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC330C"
  },
  {
    "course_code": "EDUC 330D",
    "units": 4,
    "title": "Classroom Residency and Teaching",
    "description": "Site-based fieldwork, 40 hours. Students are employed by local school districts to teach as residents in designated school sites with racially, culturally, and linguistically diverse student populations. Students also work in collaborative teams through Teacher Education Program to initiate change project in their local school and/or complete case study on project. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC330D"
  },
  {
    "course_code": "EDUC 360A",
    "units": 2,
    "title": "Novice Seminar",
    "description": "Seminar, two hours. Analysis of basic principles and concepts of planning, conducting, and evaluating units of curriculum and instruction. Emphasis on study and utilization of constructivist strategies and their application in elementary and secondary schools. Examination of different methods of computer literacy and teaching subject matter. Students may conduct ethnographic inquiry of local community of their designated partnership district. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC360A"
  },
  {
    "course_code": "EDUC 360B",
    "units": 2,
    "title": "Novice Seminar",
    "description": "Seminar, two hours. Analysis of basic principles and concepts of planning, conducting, and evaluating units of curriculum and instruction. Emphasis on study and utilization of constructivist strategies and their application in elementary and secondary schools. Examination of different methods of computer literacy and teaching subject matter. Students may conduct ethnographic inquiry of local community of their designated partnership district. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC360B"
  },
  {
    "course_code": "EDUC 360C",
    "units": 2,
    "title": "Novice Seminar",
    "description": "Seminar, two hours. Analysis of basic principles and concepts of planning, conducting, and evaluating units of curriculum and instruction. Emphasis on study and utilization of constructivist strategies and their application in elementary and secondary schools. Examination of different methods of computer literacy and teaching subject matter. Students may conduct ethnographic inquiry of local community of their designated partnership district. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC360C"
  },
  {
    "course_code": "EDUC 390A",
    "units": 1,
    "title": "Colloquium Series: Human Development and Psychology",
    "description": "Seminar, one hour. Required of first-, second-, and third-year Human Development and Psychology (HDP) PhD students. Training to conduct research that has practical implications as well as theoretical significance within field of applied human development. Children’s cognitive, language, personality, and social development in educationally relevant settings such as schools and daycare programs. Series unites scholars exploring contemporary issues in applied human development and provides framework to facilitate research and training in human development within school and UCLA community, as well as forum to share information with other investigators and institutions. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC390A"
  },
  {
    "course_code": "EDUC 390B",
    "units": 1,
    "title": "Colloquium Series: Human Development and Psychology",
    "description": "Seminar, one hour. Required of first-, second-, and third-year Human Development and Psychology (HDP) PhD students. Training to conduct research that has practical implications as well as theoretical significance within field of applied human development. Children’s cognitive, language, personality, and social development in educationally relevant settings such as schools and daycare programs. Series unites scholars exploring contemporary issues in applied human development and provides framework to facilitate research and training in human development within school and UCLA community, as well as forum to share information with other investigators and institutions. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC390B"
  },
  {
    "course_code": "EDUC 390C",
    "units": 1,
    "title": "Colloquium Series: Human Development and Psychology",
    "description": "Seminar, one hour. Required of first-, second-, and third-year Human Development and Psychology (HDP) PhD students. Training to conduct research that has practical implications as well as theoretical significance within field of applied human development. Children’s cognitive, language, personality, and social development in educationally relevant settings such as schools and daycare programs. Series unites scholars exploring contemporary issues in applied human development and provides framework to facilitate research and training in human development within school and UCLA community, as well as forum to share information with other investigators and institutions. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC390C"
  },
  {
    "course_code": "EDUC 402",
    "units": 4,
    "title": "Curriculum Principles and Practices",
    "description": "Lecture, four hours. Critical analysis of major concepts, underlying assumptions, policy issues, and processes in development and implementation of curriculum in educational setting. Problems in formulation of purposes, selection of learning experiences, organization of curriculum, and curriculum evaluation. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC402"
  },
  {
    "course_code": "EDUC 403",
    "units": 4,
    "title": "Infant-Toddler Child Development and Care",
    "description": "Lecture, four hours. Exploration of infant and toddler development (ages 0 to 3) and implications of development on their care and education. Introduction to major theories in child development, developmental milestones, and recent brain development research. Topics include family engagement, inclusion, risk contexts, developmentally appropriate practices, and assessment. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC403"
  },
  {
    "course_code": "EDUC 405A",
    "units": 2,
    "title": "Teaching in Urban Schools: Exploring Communities",
    "description": "Seminar, two hours. Limited to credential program students. Learning about urban communities by critically examining students’ own beliefs, assumptions, and experiences about them to deepen understanding and appreciation about urban communities. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC405A"
  },
  {
    "course_code": "EDUC 405B",
    "units": 2,
    "title": "Teaching in Urban Schools: Exploring Identities",
    "description": "Seminar, two hours. Limited to credential program students. Examination and reflection on student values, beliefs, assumptions, and lives to determine how these factors shape way students view their world and, in particular, teaching, learning, students, their families, and their neighborhoods and communities. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC405B"
  },
  {
    "course_code": "EDUC 405C",
    "units": 2,
    "title": "Teaching in Urban Schools: Exploring Family-School Connections",
    "description": "Seminar, two hours. Limited to credential program students. Exploration of interrelationships among families, communities, and school systems, engaging parents, caregivers, guardians, students, and school personnel to develop strategies for working with families and to develop philosophy of education. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC405C"
  },
  {
    "course_code": "EDUC 406",
    "units": 3,
    "title": "Social Foundations and Cultural Diversity in American Education",
    "description": "Lecture, three hours. Intensive consideration of American society, particularly its racial and cultural diversity. Topics include historical development of American society, manifestations of cultures, and ways to learn about students’ cultures. Examination of issues of racism, ethnic and gender differences, perspectives of cultural diversity, and impact on educational and classroom instruction. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC406"
  },
  {
    "course_code": "EDUC 406B",
    "units": 3,
    "title": "Social Foundations and Cultural Diversity in American Education: Ethnic Studies Emphasis",
    "description": "Lecture, three hours. Historical, social, political, and economic contexts of schooling in U.S., with special emphasis on perspectives and contributions from ethnic studies. Examination of central arguments centered around systemic processes, deficit-framing, meanings produced in cultural contexts, and agency and activism. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC406B"
  },
  {
    "course_code": "EDUC 407",
    "units": 3,
    "title": "Psychological Foundations of Education",
    "description": "Lecture, three hours. Analysis of learning processes in school situations. Processes of human motivation, affective, cognitive, social, and personal development of children and adolescents, evaluation of learning, individual differences, and implications of relevant theory and research. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC407"
  },
  {
    "course_code": "EDUC 409",
    "units": 3,
    "title": "Language Structure, Acquisition, and Development",
    "description": "Lecture, three hours. Theoretical foundations of language structure and first and second language acquisition, with focus on major themes of current research that provide framework for schooling of English language learners. Rationale for bilingual/English language acquisition and development programs. Historical and current theories and models of language. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC409"
  },
  {
    "course_code": "EDUC 411",
    "units": 4,
    "title": "Procedural Issues in Evaluation",
    "description": "Lecture, four hours. Assessment methodologies appropriate for evaluation problems. Writing evaluation proposals, developing program monitoring procedures, selecting appropriate evaluation design strategies, coping with ethical considerations in evaluation, framing decision context, and reporting evaluation results. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC411"
  },
  {
    "course_code": "EDUC 412",
    "units": 3,
    "title": "Why Research Matters to Student Affairs Practice",
    "description": "Lecture, three hours. How do researchers study impact of college on students? How can that research be used to improve student affairs practice? Introduction to world of college impact research and orientation to major ongoing studies conducted at UCLA and beyond. Students interact with researchers and provide input on how research results might be utilized to improve work of student affairs. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC412"
  },
  {
    "course_code": "EDUC 413A",
    "units": 2,
    "title": "Language and Culture",
    "description": "Lecture, two hours. Limited to credential program students. Offered and required for Bilingual Authorization Programs. Focus on language of emphasis for bilingual teachers. Practice in listening, reading, speaking, and writing competencies required for bilingual classrooms. Assessment made at end of course to determine proficiency of Bilingual Authorization Program candidates. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC413A"
  },
  {
    "course_code": "EDUC 413B",
    "units": 2,
    "title": "Methodology for Bilingual Instruction",
    "description": "Lecture, three hours. Offered and required for Bilingual Authorization Programs. Consideration of models for developing cultural and language skills of home speakers of language of emphasis; practice in use of activities to develop student ability to use language for real-world and academic purposes in culturally appropriate ways. Consideration of models for teaching academic content in primary language for delivery of core curriculum to bilingual students. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC413B"
  },
  {
    "course_code": "EDUC 413C",
    "units": 2,
    "title": "History and Culture of Emphasis",
    "description": "Lecture, three hours. Offered and required for Bilingual Authorization Programs. Conducted in language of authorization. Discussion of commonalities of culture of emphasis in its home country or countries; major historical periods and events; values, belief systems, and expectations; migration and immigration; historical and contemporary demography. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC413C"
  },
  {
    "course_code": "EDUC 414A",
    "units": 3,
    "title": "Student Affairs Practice and Theory",
    "description": "Lecture, two hours; discussion, two hours. Examination of needs for student affairs services, range of services, their philosophical and empirical rationale, and their organization and evaluation to provide knowledge base for developing theories of practice. Ongoing involvement in cooperative learning project to examine these issues both as team members and as individuals. Offered in summer only. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC414A"
  },
  {
    "course_code": "EDUC 414C",
    "units": 3,
    "title": "College Student Counseling",
    "description": "Lecture, three hours. Overview of counseling at college counseling centers. Review of historical context, philosophical and practical bases, organization and administration, specific programs, and contemporary issues and trends in college student counseling. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC414C"
  },
  {
    "course_code": "EDUC 414E",
    "units": 3,
    "title": "Administration of Student Affairs",
    "description": "Lecture, two hours; discussion, two hours. Overview of general knowledge and processes essential to effectively administer programs or services under student affairs. Examination of relationship between environmental factors and strategies for governing, planning, and managing student affairs programs and services. Offered in summer only. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC414E"
  },
  {
    "course_code": "EDUC 416",
    "units": 4,
    "title": "Program Development and Planning in Student Affairs",
    "description": "Lecture, two hours; discussion, two hours. Planning of programs that provide or support learning for individuals and groups in student affairs context. Examination of philosophical foundations of program planning, along with pedagogical and logistical dimensions of program development. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC416"
  },
  {
    "course_code": "EDUC 419",
    "units": 4,
    "title": "Introduction to Research in Student Affairs",
    "description": "Lecture, two hours; discussion, two hours. Designed to orient students to nature of educational research in context of student affairs. Overview of quantitative, qualitative, and mixed methods to position students as scholar-practitioners. Exposure to these methods supplemented by examination of how they are used in published research relevant to practice of student affairs. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC419"
  },
  {
    "course_code": "EDUC 420A",
    "units": 4,
    "title": "Principles of Curriculum",
    "description": "Lecture, four hours. Critical examination of basic concepts underlying determination of objectives, selection and organization of learning experiences, and evaluation process. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC420A"
  },
  {
    "course_code": "EDUC 425",
    "units": 3,
    "title": "Principles for Teaching Exceptional Individuals",
    "description": "Lecture, three hours. Approaches for teaching exceptional individuals in special and regular education programs. Principles and assumptions underlying alternative approaches. Emphasis on individualizing curriculum and classroom management. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC425"
  },
  {
    "course_code": "EDUC 425S",
    "units": 3,
    "title": "Individualized Education: Supplemental Extensive Support Needs—Strategies and Understandings",
    "description": "Lecture, three hours. Supports candidates in learning about and building on specific knowledge of low-incident disabilities—including  deaf/blindness, support procedures, and health impairments—as it pertains to the unique learning profiles of individualized instruction, environment, and assessment that is appropriate for student needs. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC425S"
  },
  {
    "course_code": "EDUC 426A",
    "units": 2,
    "title": "Program Development and Program Evaluation in Student Affairs",
    "description": "Lecture, two hours. Introduction to program development and planning, as well as to assessment and program review. Development of knowledge of and skill in planning educational and training programs that provide support for learning within context of student affairs, as well as knowledge of and skill in developing, implementing, and analyzing assessment projects within student affairs context. Study of basic theoretical perspectives underlying program design/implementation and program review/assessment and application by developing, implementing, and assessing effectiveness of one program. In Progress grading (credit to be given only on completion of course 426B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC426A"
  },
  {
    "course_code": "EDUC 426B",
    "units": 2,
    "title": "Program Development and Program Evaluation in Student Affairs",
    "description": "Lecture, two hours. Introduction to program development and planning, as well as to assessment and program review. Development of knowledge of and skill in planning educational and training programs that provide support for learning within context of student affairs, as well as knowledge of and skill in developing, implementing, and analyzing assessment projects within student affairs context. Study of basic theoretical perspectives underlying program design/implementation and program review/assessment and application by developing, implementing, and assessing effectiveness of one program. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC426B"
  },
  {
    "course_code": "EDUC 427A",
    "units": 3,
    "title": "Individualized Education: Introduction to Special Education",
    "description": "Lecture, three hours. Covers developing and writing individualized education plans (IEP) for students of all eligibility categories, and covers initial aspects of special education law pertaining to IEPs and the least restrictive environment (LRE). Introduction to eligibilities of other health impairments (OHI), traumatic brain injuries (TBI), and autism, along with all special education eligibilities. Students learn to implement augmentative and alternative communication, when an alternative curriculum is appropriate, and how to implement an alternative curriculum in multiple settings. Through case studies, students also learn to develop transition plans for students aged 16 or above. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC427A"
  },
  {
    "course_code": "EDUC 427B",
    "units": 3,
    "title": "Individualized Education: Behavior",
    "description": "Lecture, three hours. Examination of approaches for developing behavioral interventions and supports for students with a range of disabilities. Examination of principles and assumptions underlying approaches to student support and behavior management. Emphasis on developing a student support philosophy rooted in introspective reflection and restorative practices which aims to utilize behavior challenges as catalysts for student growth. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC427B"
  },
  {
    "course_code": "EDUC 427C",
    "units": 3,
    "title": "Individualized Education: Introduction to Special Education—Collaboration with Families/Caregivers and Support Services",
    "description": "Lecture, three hours. In fostering an inclusive philosophy and approach, students are instructed on how to effectively collaborate with a variety of service providers in order to support, teach, and include students with disabilities. Students are provided with research-based strategies to enable them to collaborate with the families of students with disabilities and any associated stakeholders (i.e., outside agencies/service providers); and are exposed to and guided in how to use data collection tools for developing individualized education plan (IEP) goals, and how and when to employ certain instructional strategies and assessments. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC427C"
  },
  {
    "course_code": "EDUC 427D",
    "units": 3,
    "title": "Individualized Education: Assessments",
    "description": "Lecture, three hours. Covers the implementation and further development of assessment tools, data collection tools, and instructional strategies in order to use data to make informed instructional decisions through classroom instruction and/or in an individualized education plan (IEP) while keeping the student’s well-being at the forefront of all decision-making processes. Students have been exposed to various perspectives on multiple formal and informal assessment tools to support critical decisions that need to be made when educating students with exceptionalities. This information serves as data for progress monitoring with both IEP goals and to support teacher instruction. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC427D"
  },
  {
    "course_code": "EDUC 440C",
    "units": 4,
    "title": "Administration of Instructional Programs",
    "description": "Lecture, four hours. Examination of current educational problems in society and strategies of their solution through curriculum policy and practice; instructional design and operation; in-service training of teaching staffs. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC440C"
  },
  {
    "course_code": "EDUC 441A",
    "units": 4,
    "title": "Instructional Supervision A",
    "description": "Lecture, four hours. Analysis of teaching in light of research-substantiated elements of instruction: task analysis, appropriate objectives, principles that increase motivation, rate and degree of learning, retention and transfer, monitoring and adjusting instruction to meet needs and capacities of learners. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC441A"
  },
  {
    "course_code": "EDUC 442B",
    "units": 4,
    "title": "Legal Aspects of Educational Management and Practice",
    "description": "Lecture, four hours. Examination of structures and kinds of law governing educational systems in U.S.; constitutional dimensions of church/state relations; employees’ civil rights and legal aspects of hiring, firing, and negotiating procedures; student attendance, control, and civil rights. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC442B"
  },
  {
    "course_code": "EDUC 443",
    "units": 4,
    "title": "Policy Analysis in Education",
    "description": "Lecture, four hours. Overview of political, economic, and legal context of educational policy formation. Included in examination are issues that impact on minorities (e.g., bilingual education, desegregation, affirmative action, role of subdominants in policy-making process). S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC443"
  },
  {
    "course_code": "EDUC 448A",
    "units": 4,
    "title": "Urban School Leadership",
    "description": "Lecture, four hours. Analysis of problems of urban school leadership. Emphasis on changing nature of urban principalship, with considerable attention to role of other school and community agencies that interact with urban school leaders. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC448A"
  },
  {
    "course_code": "EDUC 448B",
    "units": 4,
    "title": "Urban Leadership Laboratory",
    "description": "Laboratory, four hours. Analysis of and opportunity to practice human and technical skills requisite for success as urban school leader. Topics include negotiations, conflict resolution, applied computer technology, and effective communication. Activities include gaming, simulation, computer programming, and group dynamics. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC448B"
  },
  {
    "course_code": "EDUC 450",
    "units": 4,
    "title": "Leadership Capacity Building",
    "description": "Lecture, one hour; discussion, three hours. Limited to Educational Leadership Program students. Course taken in year three of Educational Leadership Program to help students with their communication and leadership capacities. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC450"
  },
  {
    "course_code": "EDUC 451",
    "units": 2,
    "title": "Foundations of Organizations and Leadership",
    "description": "Lecture, four hours. Limited to Educational Leadership Program students. Promotion of understanding of traditional and contemporary conceptions of leadership and organizational theory, with application of these conceptions to student professional work settings. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC451"
  },
  {
    "course_code": "EDUC 452A",
    "units": 4,
    "title": "Educational Enterprise",
    "description": "Lecture, two hours; discussion, two hours. Limited to Educational Leadership Program students. Use of structural, human resource, political, and symbolic frames to study K-16 education. Focus on purposes of education governance, finance, access, and equity. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC452A"
  },
  {
    "course_code": "EDUC 452B",
    "units": 4,
    "title": "Educational Enterprise",
    "description": "Lecture, two hours; discussion, two hours. Requisite: course 452A. Limited to Educational Leadership Program students. Use of structural, human resource, political, and symbolic frames to study K-16 education. Focus on educational environments, organizations, and curriculum and instruction. Letter grading.",
    "prerequisites": [
      "EDUC 452A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC452B"
  },
  {
    "course_code": "EDUC 454A",
    "units": 4,
    "title": "Action Research: Collaboration in Change",
    "description": "Lecture, one hour; discussion, two hours; small group work, one hour. Limited to Educational Leadership Program students. Students carry out full cycle of action research at educational site. Projects done in teams as students hone and assess their collaboration abilities. Exploration of qualitative and quantitative data gathering methods and analyses. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC454A"
  },
  {
    "course_code": "EDUC 454B",
    "units": 4,
    "title": "Action Research: Collaboration in Change",
    "description": "Lecture, one hour; discussion, two hours; small group work, one hour. Limited to Educational Leadership Program students. Second course in two-course sequence on learning how to do and use action research. Honing of team processes and team roles while collaborating on data collection and analysis at educational site. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC454B"
  },
  {
    "course_code": "EDUC 455",
    "units": 4,
    "title": "Writing and Inquiry",
    "description": "Lecture/workshop, eight hours per month; discussion, one hour; laboratory, one hour. Limited to doctoral students in Educational Leadership Program. Intended to assist students’ professional development as writers, addressing style and organization, scholarly genres, modes of discourse, and broader issues of conceptualization and method. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC455"
  },
  {
    "course_code": "EDUC 456",
    "units": 2,
    "title": "Altering Structure and Culture of Schooling",
    "description": "Lecture, four hours; discussion, four hours. Limited to Educational Leadership Program students. Using applied orientation, examination of variety of approaches to organizational change and ways to sustain change. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC456"
  },
  {
    "course_code": "EDUC 458A",
    "units": 2,
    "title": "Practicum: Dissertation",
    "description": "Seminar, two hours; discussion, two hours. Preparation: completion of first- and second-year courses. Limited to Educational Leadership Program students. Development of EdD dissertation and its implementation to improve educational practice. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC458A"
  },
  {
    "course_code": "EDUC 458B",
    "units": 2,
    "title": "Practicum: Dissertation",
    "description": "Seminar, two hours; discussion, two hours. Preparation: completion of first- and second-year courses. Limited to Educational Leadership Program students. Development of EdD dissertation and its implementation to improve educational practice. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC458B"
  },
  {
    "course_code": "EDUC 458C",
    "units": 2,
    "title": "Practicum: Dissertation",
    "description": "Seminar, two hours; discussion, two hours. Preparation: completion of first- and second-year courses. Limited to Educational Leadership Program students. Development of EdD dissertation and its implementation to improve educational practice. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC458C"
  },
  {
    "course_code": "EDUC 460",
    "units": 2,
    "title": "Seminar: Special Issues in Evaluation",
    "description": "Seminar, one or two hours; discussion, one or two hours. Topics and instructors vary each term. Recent emphases included evaluation utilization and cost-effectiveness evaluation. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC460"
  },
  {
    "course_code": "EDUC 466",
    "units": 4,
    "title": "Critical Media Literacy: Teaching Youth to Critically Read and Create Media",
    "description": "Lecture, four hours. Preparation for educators to teach K-12 students to explore their relationships with media by critically questioning media representations and creating their own alternative media messages. Critical media literacy combines theoretical foundations of cultural studies and critical pedagogy with practical classroom applications of new digital media as well as traditional print-based means of communication. Exploration of media representations of race, class, gender, sexual orientation, and other identity markers. Educators critically question media and technology, as well as explore new alternatives for creating multimedia messages in their own classrooms. Analysis and creation of media projects related to teaching required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC466"
  },
  {
    "course_code": "EDUC 470A",
    "units": 4,
    "title": "Seminar: Large Systems and Individual Schools",
    "description": "Seminar, four hours. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC470A"
  },
  {
    "course_code": "EDUC 471",
    "units": 4,
    "title": "Principles of Effective Coaching and Leadership",
    "description": "Seminar, four hours. Introduction to principles and practice of effective coaching and teaching for aspiring coaches considering careers in professional and collegiate athletics, K-12 schools, and community-based sports organizations. Premised on principles of social justice and on value and promise of equity, inclusion, and diversity for contributing to creation of more humane, equitable, and harmonious society and nation. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC471"
  },
  {
    "course_code": "EDUC 472",
    "units": 4,
    "title": "Introduction to Philosophies of Coaching",
    "description": "Seminar, four hours. Introduction to philosophies of coaching—overarching frameworks, perspectives, deep beliefs, and values that drive coaches’ specific practices—as they are manifested in writings and conduct of professional and college sport coaches. Exploration of these through study of successful coaches in variety of sports unpacking their fundamental keys of success. Reflection on and cultivation of one’s own personal and intentional philosophy of coaching answering questions what is your why and what is your how. Exploration of questions such as what is coach, what is coach’s overall purpose, what are desired results, how best can coach lead and produce these results. Methods and assignments include presentations, analyzing videos, group work, interviews, analyses of coaching philosophies, and constructing statement of one’s own philosophy of coaching. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC472"
  },
  {
    "course_code": "EDUC 473",
    "units": 4,
    "title": "Diversity Leadership in Sports and Athletics",
    "description": "Seminar, four hours. Coaching and transformational leadership requires examination of important topics that depend upon analysis of complex, yet essential concepts. Examination and discussion of how and why sports, diversity, and leadership must be interconnected in order to meet needs of universities, professional organizations, and most importantly student-athletes. Sports as industry and as enterprise. Covers its history, purpose, evolution, and role in higher education and wider society. Emphasis on student-athletes’ experiences and outcomes, well-being, and readiness for educational and professional opportunities in sports and beyond. Addresses growing need for greater gender, ethnic, and racial diversity in athletic leadership. While those who participate in sports, particularly those sports designated as revenue generating, represent much of gender and racial diversity in U.S., leadership of sports falls embarrassingly short. Emphasis on equity throughout. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC473"
  },
  {
    "course_code": "EDUC 474",
    "units": 4,
    "title": "Ethical Issues in Sports",
    "description": "Lecture, three hours. Coaches and sport management professionals are likely to face numerous ethical issues and dilemmas in their day-to-day professional practices. Introduction to salient moral and ethical issues involved in physical education, sports, and coaching. Students gain analytical tools to make ethically informed decisions by introducing normative principles and framework to guide decision-making in real-life situations. Covers content areas where ethical decision-making may be relevant including sportsmanship, gambling, coaching, parental responsibilities, violence, drug use and testing, race and gender equity, media, and commercialization of college sports. Includes lectures, discussions, analysis of case studies, and applications of decision-making tools to resolve ethical issues. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC474"
  },
  {
    "course_code": "EDUC 475",
    "units": 4,
    "title": "Mental Health in Athletics and Coaching",
    "description": "Lecture, three hours. Introduction to mental health issues in context of athletics and coaching. Mental health issues are prevalent and on rise among athletes. Coaches and other sports personnel are often first line of defense and are best positioned to recognize symptoms and refer athletes to appropriate care and interventions. Cultivates greater awareness of prevalence of mental health issues among athletes. Enables students to recognize common symptoms and manifestations of mental health concerns (e.g., depression, eating disorders, etc.). Students gain knowledge base for appropriate referrals and interventions, and range of tools for creation of safe spaces within their organizations to address mental health concerns. Cultivates informed practitioners who are sensitive to mental health concerns and empathetic to plight of many who suffer from these issues. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC475"
  },
  {
    "course_code": "EDUC 476",
    "units": 4,
    "title": "History and Philosophy of Sport and Physical Education",
    "description": "Lecture, four hours. Focus on philosophical positions of body as determined by philosophical schools and intellectuals, past and present. Investigation that philosophical position of body has been significant factor in determining historic development of sport and physical activity/physical education; e.g., throughout history there were times where body was not held in high esteem, which negatively impacted development of sport. Theology also had impact upon how people viewed body. Sometimes sport thrived; sometimes it was condemned depending on theological beliefs. Body has history that is tied to sport history. Modernization theory used to explain how sport and physical activity evolved from pre-modern practice to modern practice. Study takes chronological, descriptive, and interpretive approaches. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC476"
  },
  {
    "course_code": "EDUC 477",
    "units": 4,
    "title": "Leadership and Management of Athletic Departments in Educational Institutions",
    "description": "Seminar, four hours. Introduction to principles and practices of leadership and management of athletic departments in higher education with emphasis on social justice leadership. Students develop their own, authentic and intentional leadership philosophy for leading with purpose and integrity, and gain knowledge, skills, and values to effectively lead in athletic departments. Introduction to various models of leadership and to fundamental management skills such as strategic planning, project management, effective communication, team building, team leadership, program evaluation, and effecting organizational change. Includes readings, responses to readings, analyses of case studies, developing leadership philosophy of one's own, formulating vision and mission statements, constructing strategic plans, developing communication strategies, and other individual and collaborative assignments around leadership and management of athletic departments. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC477"
  },
  {
    "course_code": "EDUC 479",
    "units": 4,
    "title": "Variable Topics in Transformative Coaching and Leadership",
    "description": "Seminar, three hours. Topics are organized around cultivating principles of coaching and leadership and their applications in practice. Study exposes students to various thinkers and concepts in coaching and leadership through readings, presentations, guest speakers, and seminar discussions. Students are encouraged to apply these principles in practice. Topics emphasize ethic of social justice and how equity, inclusion, and diversity can be fostered through coaching and leadership. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC479"
  },
  {
    "course_code": "EDUC 481",
    "units": 4,
    "title": "Knowledge and Inquiry in Classroom",
    "description": "Lecture, four hours. Logical features of instruction and their application to inquiry techniques in teaching and learning. Various conceptions of truth, belief, and fact and opinion, and their application to classroom learning situations. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC481"
  },
  {
    "course_code": "EDUC 482D",
    "units": 1,
    "title": "Instructional Strategies in Urban Education: Visual and Performing Arts",
    "description": "Lecture, two hours; discussion, two hours. Emphasis on instructional practices that integrate visual and performing arts into urban classrooms. Debriefing of field experiences implementing subject-centered arts instruction, instruction connecting arts disciplines, and instruction connecting arts and other core disciplines. Advanced exploration of elements of each art form, as well as content and emotional scaffolding strategies and reflection strategies to make learning accessible, engaging, and relevant. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC482D"
  },
  {
    "course_code": "EDUC 490A",
    "units": 4,
    "title": "Instructional Decision Making",
    "description": "Lecture, four hours. Analysis of instructional models relevant to public school education. Assumptions, procedures, and constraints of each strategy considered in terms of learner and task variables. Laboratory experiences in classroom settings permit students systematically to apply and evaluate alternative instructional strategies. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC490A"
  },
  {
    "course_code": "EDUC 491",
    "units": 4,
    "title": "Curricular Decision Making",
    "description": "Lecture, two hours; discussion, two hours. Examination of alternative solutions for practical problems that classroom teachers face in making curricular decisions. Analysis of influences of psychological, societal, and institutional factors in curricular decisions. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC491"
  },
  {
    "course_code": "EDUC 492",
    "units": 3,
    "title": "Data Centric Problem-Based Learning for Humanizing Purposes",
    "description": "Lecture, three hours. Focuses on humanizing science, technology, engineering, and mathematics (STEM) education through integration of data science and connections to computational thinking into project-based learning (PBL) pedagogical approach. Integration of data connections to computational thinking further contextualizes humanizing STEM education. Participants (pre-service teachers) explore how their K-12 students’ identities and lived experiences connect with STEM challenges. Critical analysis of data and practices of computational thinking (CT) are leveraged toward humanizing STEM purposes within curricular design and implementation of PBL project. Methods course is aligned with California state frameworks and California content standards for grades K-12, including English Language Development Standards—all of which address needs and various interests of diverse students. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC492"
  },
  {
    "course_code": "EDUC 495",
    "units": 2,
    "title": "Teaching Preparation in Education",
    "description": "Seminar, two hours. Teaching assistants (TA) are supported while becoming more effective and reflective teachers. Focus on how to create student-centered, inclusive learning experiences. Study of theory (relationship between teaching and learning), research (what we know about how people learn), and logistics (how this actually happens for students). Students gain understanding of serving as TA in education (e.g., departmental policies, responsibilities to students, how/where to get additional support, etc.). Students have opportunities to apply (in their own sections) what they learn, to reflect collaboratively on their ongoing TA experiences, and to learn from experienced TAs. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC495"
  },
  {
    "course_code": "EDUC 498A",
    "units": 1,
    "title": "Directed Field Experience",
    "description": "Clinical, to be arranged. Field experiences designed to increase understanding of student fields of study. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC498A"
  },
  {
    "course_code": "EDUC 498B",
    "units": 2,
    "title": "Directed Field Experience",
    "description": "Clinical, to be arranged. Field experiences designed to increase understanding of student fields of study. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC498B"
  },
  {
    "course_code": "EDUC 498C",
    "units": 2,
    "title": "Directed Field Experience",
    "description": "Clinical, to be arranged. Field experiences designed to increase understanding of student fields of study. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC498C"
  },
  {
    "course_code": "EDUC 499A",
    "units": 4,
    "title": "Advanced Directed Field Experience",
    "description": "Clinical, to be arranged. Dissertation practicum that supports students in developing their proposals. Guides students on how to write their dissertation proposals and serves as writing workshop where students have opportunities to receive feedback from instructors, fellows, and peers. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC499A"
  },
  {
    "course_code": "EDUC 499B",
    "units": 4,
    "title": "Advanced Directed Field Experience",
    "description": "Clinical, to be arranged. Dissertation practicum that supports students in developing their proposals. Guides students on how to write their dissertation proposals and serves as writing workshop where students have opportunities to receive feedback from instructors, fellows, and peers. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC499B"
  },
  {
    "course_code": "EDUC 499C",
    "units": 4,
    "title": "Advanced Directed Field Experience",
    "description": "Clinical, to be arranged. Dissertation practicum that supports students in developing their proposals. Guides students on how to write their dissertation proposals and serves as writing workshop where students have opportunities to receive feedback from instructors, fellows, and peers. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC499C"
  },
  {
    "course_code": "EDUC 501",
    "units": 2,
    "title": "Cooperative Program in Special Education",
    "description": "Tutorial, to be arranged. Preparation: consent of UCLA academic adviser and graduate dean, and host campus instructor, department chair, and graduate dean. Limited to UCLA doctoral students in special education. Used to record enrollment in practicum courses taken under cooperative arrangements with USC. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC501"
  },
  {
    "course_code": "EDUC 596",
    "units": 1,
    "title": "Directed Independent Study",
    "description": "Tutorial, to be arranged (one hour per unit). Individual study or research for graduate students. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC596"
  },
  {
    "course_code": "EDUC 597",
    "units": 1,
    "title": "Preparation for Master's Comprehensive Examinations or Doctoral Qualifying Examinations",
    "description": "Tutorial, to be arranged. Individual study for master’s comprehensive examinations or for PhD or EdD qualifying examinations. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC597"
  },
  {
    "course_code": "EDUC 598",
    "units": 4,
    "title": "Thesis Research",
    "description": "Tutorial, to be arranged (four hours for every 4 units). Research for and preparation of master’s thesis. May be taken for maximum of 12 units. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC598"
  },
  {
    "course_code": "EDUC 599",
    "units": 4,
    "title": "Dissertation Research",
    "description": "Tutorial, to be arranged (four hours for every 4 units). Research for and preparation of doctoral dissertation. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EDUC599"
  }
]