[
  {
    "course_code": "ENV HLT 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT19"
  },
  {
    "course_code": "ENV HLT 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT89"
  },
  {
    "course_code": "ENV HLT 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT89HC"
  },
  {
    "course_code": "ENV HLT 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT99"
  },
  {
    "course_code": "ENV HLT 100",
    "units": 4,
    "title": "Introduction to Environmental Health",
    "description": "Lecture, three hours; discussion, one hour. Preparation: one course each in chemistry and biology. Limited to nonmajors. Not open for credit to students with credit for course 120. Introduction to environmental health, including coverage of sanitary principles and chronic and acute health effects of environmental contaminants. P/NP or letter grading.",
    "credit_exclusions": [
      "ENV HLT 120"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT100"
  },
  {
    "course_code": "ENV HLT 101",
    "units": 3,
    "title": "Fundamentals of Chemistry in Environmental Health",
    "description": "Lecture, three hours; discussion, one hour. Guided tutorial on fundamental chemical concepts that are important for public health students that either do not have strong background in chemistry or who have not recently taken chemistry class and want to refresh their knowledge. Discussion of examples relevant to environmental health more broadly in each topic area and used to illustrate why understanding fundamental chemical concepts are important. Interactive study with focus on core chemical concepts. Recommended to be taken before or concurrently with introductory courses. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT101"
  },
  {
    "course_code": "ENV HLT 112",
    "units": 4,
    "title": "Fundamentals of Occupational Exposure and Techniques",
    "description": "Lecture, three hours; laboratory, one hour. Examination of occupational exposure agents and technical skills to quantify airborne agents causing worker’s exposure. Topics include sampling strategy, method and design, exposure quantification of airborne agents, sampling device operation and calibration, interpretation of exposed agents and data, and technical report writing. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT112"
  },
  {
    "course_code": "ENV HLT 120",
    "units": 5,
    "title": "Environment and Health",
    "description": "Lecture, three hours; discussion, one hour. Limited to Public Health majors. Not open for credit to students with credit for course 100. Examination of scientific principles and methods of field, as well as translation of science to environmental health practice. Topics include environmental stressors and their health effects, regulations and policy, equity and justice, and systems thinking. Acquisition of skills important for public health professionals, such as application of scientific information to real-world problems and ability to communicate effectively with different stakeholders. Letter grading.",
    "credit_exclusions": [
      "ENV HLT 100"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT120"
  },
  {
    "course_code": "ENV HLT C125",
    "units": 4,
    "title": "Atmospheric Transport and Transformations of Airborne Chemicals",
    "description": "Lecture, four hours. Preparation: one year of calculus, one course each in physics, organic chemistry, and physical chemistry. Designed for science, engineering, and public health students. Role of regional or long-range transport, and atmospheric lifetimes and fates of airborne chemicals in phenomena such as photochemical smog, acid deposition, stratospheric ozone depletion, accumulation of greenhouse gases, and regional and global distribution of volatile toxic compounds. Concurrently scheduled with course C225. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC125"
  },
  {
    "course_code": "ENV HLT C135",
    "units": 4,
    "title": "Environmental Policy for Science and Engineering",
    "description": "Lecture, four hours. Limited to senior undergraduate and graduate students. Examination of theoretical underpinnings of several major types of regulatory policy, as well as practical issues involved in implementing and enforcing each. Exploration of selection and impact of regulatory forms from variety of disciplines and viewpoints. Focus on traditional command and control regulation (including self-executing performance standards and permitting), market-based regulation (such as emissions trading), remediation, and emerging regulatory approaches such as management-based regulation and alternatives assessment. Issues of compliance and enforcement. Concurrently scheduled with course C235. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC135"
  },
  {
    "course_code": "ENV HLT C140",
    "units": 4,
    "title": "Fundamentals of Toxicology",
    "description": "Lecture, four hours. Preparation: one course each in biology, organic chemistry, and biochemistry. Essential aspects of toxicology, with emphasis on human species. Absorption, distribution, excretion, biotransformation, as well as basic toxicologic processes and organ systems. Concurrently scheduled with course C240. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC140"
  },
  {
    "course_code": "ENV HLT C152D",
    "units": 4,
    "title": "Properties and Measurement of Airborne Particles",
    "description": "Lecture, four hours. Preparation: one year each of chemistry, physics, and calculus. Basic theory and application of aerosol science to environmental health, including properties, behavior, sampling, and measurement of aerosols and quantitative problems. Concurrently scheduled with course C252D. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC152D"
  },
  {
    "course_code": "ENV HLT C157",
    "units": 4,
    "title": "Risk Assessment and Standard Setting",
    "description": "Seminar, four hours. Requisite: course C140. Designed to provide students with opportunity to review scientific basis for association of selected occupational and environmental exposures with disease. Special emphasis on critical evaluations of literature. Attention specifically to interface of science and regulatory standards. Concurrently scheduled with course C257. P/NP or letter grading.",
    "prerequisites": [
      "ENV HLT C140"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC157"
  },
  {
    "course_code": "ENV HLT C164",
    "units": 4,
    "title": "Fate and Transport of Organic Chemicals in Aquatic Environment",
    "description": "Lecture, four hours. Recommended requisites: Chemistry 14A and 14B, or 20A and 20B. Evaluation of how and where and in what form and concentration organic pollutants are distributed in aquatic environments. Study of mass transport mechanisms moving organic chemicals between phases, biological degradation and accumulation, and chemical reactions. Effect of humic substances on these processes. Concurrently scheduled with course C264. P/NP or letter grading.",
    "prerequisites": [
      "CHEM 14A",
      "CHEM 14B",
      "CHEM 20A",
      "CHEM 20B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC164"
  },
  {
    "course_code": "ENV HLT M166",
    "units": 4,
    "title": "Environmental Microbiology",
    "description": "(Same as Civil Engineering M166.) Lecture, four hours; discussion, two hours; outside study, six hours. Recommended requisite: Civil Engineering 153. Microbial cell and its metabolic capabilities, microbial genetics and its potentials, growth of microbes and kinetics of growth, microbial ecology and diversity, microbiology of wastewater treatment, probing of microbes, public health microbiology, pathogen control. Letter grading.",
    "prerequisites": [
      "C&EE 153"
    ],
    "cross_listed": [
      "C&EE M166"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTM166"
  },
  {
    "course_code": "ENV HLT M166L",
    "units": 2,
    "title": "Environmental Microbiology Laboratory",
    "description": "(Same as Civil Engineering M166L.) Lecture, one hour; laboratory, two hours; outside study, two hours. Requisite: course M166 (may be taken concurrently). General laboratory practice within environmental microbiology, sampling of environmental samples, classical and modern molecular techniques for enumeration of microbes from environmental samples, techniques for determination of microbial activity in environmental samples, laboratory setups for studying environmental biotechnology. Letter grading.",
    "prerequisites": [
      "ENV HLT M166"
    ],
    "cross_listed": [
      "C&EE M166L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTM166L"
  },
  {
    "course_code": "ENV HLT 170",
    "units": 4,
    "title": "Climate Change and Public Health",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 100 or 120 or C185A. Preparation: introductory statistics course. Introduction to critical issues of global environmental change with focus on climate change as related to consequences for human health and wellbeing. Exploration of physical mechanisms that drive anthropogenic climate change. Examination of direct and indirect pathways through which environmental changes influence health and potential solutions. P/NP or letter grading.",
    "prerequisites": [
      "ENV HLT 100",
      "ENV HLT 120",
      "ENV HLT C185A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT170"
  },
  {
    "course_code": "ENV HLT C185A",
    "units": 4,
    "title": "Foundations of Environmental Health Sciences",
    "description": "Lecture, four hours. Preparation: one year of undergraduate biology and chemistry. Introduction to field of environmental health sciences designed for students pursuing concentration in environmental health or Public Health minors. Examination of series of topics relevant to science of environmental and occupational health (e.g., climate change, ecology, microbiology, and toxicology) by introducing scientific basis from ecological perspective and describing how topics relate to health on a biochemical and molecular basis. Emphasis on scientific aspects of field, with focus on critique of primary literature and quantitative approaches for examination of topics to provide skills that are critical to perform research. Concurrently scheduled with course C200A. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC185A"
  },
  {
    "course_code": "ENV HLT C185B",
    "units": 2,
    "title": "Foundations of Environmental Health Sciences for Public Health Professionals",
    "description": "Lecture/seminar, two hours. Preparation: 4 units each of undergraduate chemistry and biology. Future environmental health and public health leaders must understand vocabulary and systems issues related to local, regional, and global environmental factors affecting public health. Development of content knowledge and thought processes to effectively analyze environmental health problems and development, implementation, and leading of actions to address these problems. Supplements content presented in Public Health 200A and 200B and Environment 100. Concurrently scheduled with course C200B. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC185B"
  },
  {
    "course_code": "ENV HLT C185C",
    "units": 6,
    "title": "Foundations of Environmental Health Sciences",
    "description": "Lecture, four hours; group project, two hours. Enforced requisite: course C185A or C185B. Multidisciplinary aspects of environmental health sciences in context of public health for environmental health majors. Concurrently scheduled with course C200C. Letter grading.",
    "prerequisites": [
      "ENV HLT C185A",
      "ENV HLT C185B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC185C"
  },
  {
    "course_code": "ENV HLT 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT189"
  },
  {
    "course_code": "ENV HLT 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT189HC"
  },
  {
    "course_code": "ENV HLT C200A",
    "units": 4,
    "title": "Foundations of Environmental Health Sciences",
    "description": "Lecture, four hours. Preparation: one year of undergraduate biology and chemistry. Introduction to field of environmental health sciences designed for students pursuing MS, MPH, and PhD degrees. Examination of series of topics relevant to science of environmental and occupational health (e.g., climate change, ecology, microbiology, and toxicology) by introducing scientific basis from ecological perspective and describing how topics relate to health on a biochemical and molecular basis. Emphasis on scientific aspects of field, with focus on critique of primary literature and quantitative approaches for examination of topics to provide skills that are critical to perform research. Concurrently scheduled with course C185A. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC200A"
  },
  {
    "course_code": "ENV HLT C200B",
    "units": 2,
    "title": "Foundations of Environmental Health Sciences for Public Health Professionals",
    "description": "Lecture/seminar, two hours. Preparation: 4 units each of undergraduate chemistry and biology. Future environmental health and public health leaders must understand vocabulary and systems issues related to local, regional, and global environmental factors affecting public health. Development of content knowledge and thought processes to effectively analyze environmental health problems and development, implementation, and leading of actions to address these problems. Supplements content presented in Public Health 200A and 200B and Environment 100. Concurrently scheduled with course C185B. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC200B"
  },
  {
    "course_code": "ENV HLT C200C",
    "units": 6,
    "title": "Foundations of Environmental Health Sciences",
    "description": "Lecture, four hours; group project, two hours. Enforced requisite: course C200A or C200B. Multidisciplinary aspects of environmental health sciences in context of public health for environmental health majors. Concurrently scheduled with course C185C. Letter grading.",
    "prerequisites": [
      "ENV HLT C200A",
      "ENV HLT C200B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC200C"
  },
  {
    "course_code": "ENV HLT 200D",
    "units": 4,
    "title": "Policy Analysis for Environmental Health Science",
    "description": "Lecture, two hours; discussion, two hours. Designed for second-year Environmental Health Sciences MS and MPH students. Practice-focused synthesization and application of content from prior courses to analyze current environmental health policy issues. Students learn fundamentals of environmental health law, regulatory frameworks, communication strategies, approaches for working with community-based organizations, and policy analysis methods. Focus on environmental and occupational health and policy aspects of single case study. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT200D"
  },
  {
    "course_code": "ENV HLT 201",
    "units": 2,
    "title": "Seminar: Health Effects of Environmental Contaminants",
    "description": "Seminar, two hours. Requisites: courses C200A or C200B and C200C. Emphasis on health effects of air, water, environmental pollutants on man and review of research literature. May be repeated for credit. S/U or letter grading.",
    "prerequisites": [
      "ENV HLT C200A",
      "ENV HLT C200B",
      "ENV HLT C200C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT201"
  },
  {
    "course_code": "ENV HLT 202",
    "units": 2,
    "title": "Seminar: Environmental Chemistry",
    "description": "Seminar, one hour. Requisites: courses C200A, C200B, 410A, 410B. Environmental chemistry aspects of environmental health sciences through multimedia analyses and biological and microbiological analyses. May be repeated for credit. Letter grading.",
    "prerequisites": [
      "ENV HLT C200A",
      "ENV HLT C200B",
      "ENV HLT 410A",
      "ENV HLT 410B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT202"
  },
  {
    "course_code": "ENV HLT 203",
    "units": 2,
    "title": "Seminar: Ecotoxicology",
    "description": "Seminar, two hours. Discussion of various topics in ecotoxicology. Topics vary from term to term and include aspects of environmental chemistry, toxicology, and ecology. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT203"
  },
  {
    "course_code": "ENV HLT 204",
    "units": 2,
    "title": "Seminar: Exposure Assessment",
    "description": "Seminar, two hours. Discussion of various topics in exposure assessment. Topics vary by term and include aspects of population activity, microenvironments, types of monitoring (outdoor, indoor, personal, biomarkers), and multimedia sources of exposure. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT204"
  },
  {
    "course_code": "ENV HLT 205",
    "units": 2,
    "title": "Environmental Health Sciences Doctoral Seminar",
    "description": "Seminar, two hours. Limited to environmental health sciences doctoral students. Presentation of current research of environmental health sciences doctoral students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT205"
  },
  {
    "course_code": "ENV HLT 206",
    "units": 2,
    "title": "Seminar: Applied Coastal Ecology",
    "description": "Seminar. two hours. Discussion of various topics in applied coastal ecology. Topics vary by term and include wetland ecology, restoration ecology, and ecology and management of coastal watersheds. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT206"
  },
  {
    "course_code": "ENV HLT 207",
    "units": 4,
    "title": "Introduction to Geographic Information Systems",
    "description": "Lecture, two hours; laboratory, two hours. Introduction to geographic information systems (GIS), including use of GIS software, mapping, geocoding, and data analysis. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT207"
  },
  {
    "course_code": "ENV HLT 208",
    "units": 4,
    "title": "Built Environment and Health",
    "description": "Lecture, three hours; discussion, one hour. Limited to public health and urban planning graduate students. Interdisciplinary course on built environment and health and breaking down silos. U.S. and other developed, as well as developing, countries are facing increasingly lethal and costly epidemics of acute and chronic diseases related to land use and built environment decisions. While hazards presented by air and water pollution are well recognized for acute, infectious, and toxicological illnesses, there is increasing recognition of hazards presented by building and community designs that fail to recognize human health. Land use and built environment decisions impact every age group and social and racial minority. Impacts range from very acute (motor vehicle trauma) to long term (obesity, cancer, heart disease). Decisions have as their bases economic, financial, insurance, housing, and other factors. Analysis of each factor and related disease endpoints. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT208"
  },
  {
    "course_code": "ENV HLT 209",
    "units": 2,
    "title": "Practical Applications in Environmental Health Sciences",
    "description": "Lecture, two hours. Enforced requisites: courses C200A, C200B. Description of many leading environmental and occupational health problems that environmental health practitioners face today, conducted as series of lectures, assignments, hands-on field exercises, and group projects, to help students develop skills necessary to integrate concepts across disciplines in field of environmental health. May satisfy some requirements needed to qualify for Registered Environmental Health Specialist (REHS) certification. S/U or letter grading.",
    "prerequisites": [
      "ENV HLT C200A",
      "ENV HLT C200B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT209"
  },
  {
    "course_code": "ENV HLT 212",
    "units": 4,
    "title": "Applied Ecology",
    "description": "Lecture, four hours. Preparation: one ecology course. Application of ecological theory and principles to solve environmental problems, including conservation biology, assessment of environmental impacts, and restoration ecology and mitigation of environmental impacts. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT212"
  },
  {
    "course_code": "ENV HLT 213",
    "units": 2,
    "title": "Seminar: Practical Aspects of Biosafety and Biosecurity",
    "description": "Seminar/discussion, two hours. Preparation: one year of introductory biology. Recommended requisite: Microbiology 101 or 102. Designed for environmental health sciences graduate students and students in UCLA Biosafety Training Program. Interactive seminar with focus on critical concepts in and practical aspects of biosafety, biosecurity, risk assessment, and risk management that are needed for individuals wishing to serve as interns in UCLA biosafety program and/or become biosafety professionals. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT213"
  },
  {
    "course_code": "ENV HLT 214",
    "units": 4,
    "title": "Children's Environmental Health: Prenatal and Postnatal",
    "description": "Lecture, four hours. Preparation: one year each of chemistry and biology. Examination of how environmental exposures to chemical, physical, and biological agents during period of maturation (from fertilization to adulthood) cause pathophysiological perturbations in homeostasis at any stage during life. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT214"
  },
  {
    "course_code": "ENV HLT 215",
    "units": 4,
    "title": "Fundamentals of Health Impact Assessment",
    "description": "Seminar, four hours. Provides students with sound understanding of health impact assessment (HIA) practice, its rationale and underlying principles, and opportunities to develop and apply HIA skills in work with public agencies and community-based organizations. Focus on problem solving around case-study HIAs and student experiences working on HIA-related projects. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT215"
  },
  {
    "course_code": "ENV HLT 216",
    "units": 4,
    "title": "Planetary Health: Consequences of Environmental Change for Human Health",
    "description": "Seminar, three hours. Planetary health is emerging interdisciplinary field that explores connections between environmental change and public health. Human-caused impacts on natural systems that have subsequent effects on human health include changes in land use, food systems, biodiversity, air pollution, and water availability. Our ability to understand planetary health requires synthesizing information from diverse academic disciplines across spatial and temporal scales, including atmospheric and climate science, ecology, epidemiology, and policy. Students from environmental health sciences and related fields learn how to interpret studies from scientific literature that discuss various aspects of planetary health, from drivers of environmental change to human health outcomes, integrate information across multiple scientific fields, and communicate planetary health research through oral presentation and written report. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT216"
  },
  {
    "course_code": "ENV HLT M217",
    "units": 4,
    "title": "Graduate Seminar in Environmental Economics and Policy",
    "description": "(Same as Public Policy M217.) Seminar, four hours. Preparation: undergraduate-level statistics, basic undergraduate microeconomics. Introduction to applied scholarship in environmental economics and policy. Enables students to become more proficient consumers and producers of social science research that explores questions of environmental policy and sustainability broadly construed. Topics include health and economic impacts of climate change, adaptation to climate change, efficient and equitable design of environmental policies (e.g., cap and trade, carbon taxes). Developmental of detailed empirical research proposal and short presentation. Letter grading.",
    "cross_listed": [
      "PUB PLC M217"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTM217"
  },
  {
    "course_code": "ENV HLT 218",
    "units": 4,
    "title": "Science Communication: Art and Practice of Science Storytelling",
    "description": "Lecture, three hours. Students from environmental health sciences focus on communicating with diverse audiences through visual communication. Study of science of science communication and importance of narrative and storytelling to producing engaging science communication. Applying these skills to their own research topics and interests, students develop two pieces of science communication, video and photo/infographic project. Through learning fundamentals of good public communication, students also advance their peer communication. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT218"
  },
  {
    "course_code": "ENV HLT 219",
    "units": 4,
    "title": "Environmental Health Disparities",
    "description": "Seminar, three hours. Designed for advanced graduate students who have completed foundational coursework in environmental health sciences. Exploration of disproportionate health burden experienced by low income communities and communities of color in U.S. due to environmental hazards. Study of social, economic, and political forces that create inequitable burdens of environmental pollution. Covers theoretical frameworks and analytic tools for understanding cumulative impacts of environmental and social inequalities on health. Case studies, research, and policy debates used to explore challenges and opportunities for addressing environmental racism and advancing environmental justice. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT219"
  },
  {
    "course_code": "ENV HLT 220",
    "units": 2,
    "title": "Overview of Environmental Public Health Microbiology",
    "description": "Lecture, two hours. Preparation: one course in biology. Introduction to environmental public health microbiology. Focus on human-disease-causing organisms. Covers bacteria, viruses, fungi, protozoa or protists, prions, and algae. Consideration of infectious diseases and of toxins produced by these microbes. Addresses how infectious agents interact with human immune system. Overview of this wide variety of microbial topics. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT220"
  },
  {
    "course_code": "ENV HLT 221",
    "units": 4,
    "title": "Climate Change, Equity, and Health",
    "description": "Lecture, two hours; discussion, two hours. Basic foundation in physical mechanisms of, responses to, and health implications of human-induced climate change. Exploration of variety of epidemiologic, risk assessment, and statistical methods used to understand impacts of climate change on health across diverse demographic groups; including efforts to estimate current and future global burden of disease due to climate change, as well as avoidable and attributable risk. Elaboration of public health implications, positive and negative, of efforts to mitigate and adapt to climate change, including discussions of ethical, political, and economic aspects of these efforts. Emphasis on how adverse effects of climate change are borne disproportionately by vulnerable people and groups. Students are responsible for leading class discussions and presenting poster on their choice of topic related to climate change and health. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT221"
  },
  {
    "course_code": "ENV HLT C225",
    "units": 4,
    "title": "Atmospheric Transport and Transformations of Airborne Chemicals",
    "description": "Lecture, four hours. Preparation: one year of calculus, one course each in physics, organic chemistry, and physical chemistry. Designed for science, engineering, and public health students. Role of regional or long-range transport, and atmospheric lifetimes and fates of airborne chemicals in phenomena such as photochemical smog, acid deposition, stratospheric ozone depletion, accumulation of greenhouse gases, and regional and global distribution of volatile toxic compounds. Concurrently scheduled with course C125. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC225"
  },
  {
    "course_code": "ENV HLT 230A",
    "units": 2,
    "title": "Interdisciplinary Occupational Health Practice",
    "description": "Seminar, one hour; fieldwork, one hour. Multidisciplinary nature of occupational health practice featured and explored in these varied-activity courses, including material related to recognition, prevention, surveillance, and management of work-related health problems that occupational health and safety researchers and professionals encounter in various work environments. Lectures, seminars, field exercises, workshops, clinical case conferences, and group assignments combined to help students develop skills necessary to integrate and communicate relevant approaches to occupational hazard detection and control, work-related injury and illness surveillance, and disease and disability prevention from different disciplines in field of occupational health and safety. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT230A"
  },
  {
    "course_code": "ENV HLT 230B",
    "units": 2,
    "title": "Interdisciplinary Occupational Health Practice",
    "description": "Seminar, one hour; fieldwork, one hour. Multidisciplinary nature of occupational health practice featured and explored in these varied-activity courses, including material related to recognition, prevention, surveillance, and management of work-related health problems that occupational health and safety researchers and professionals encounter in various work environments. Lectures, seminars, field exercises, workshops, clinical case conferences, and group assignments combined to help students develop skills necessary to integrate and communicate relevant approaches to occupational hazard detection and control, work-related injury and illness surveillance, and disease and disability prevention from different disciplines in field of occupational health and safety. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT230B"
  },
  {
    "course_code": "ENV HLT 230C",
    "units": 2,
    "title": "Interdisciplinary Occupational Health Practice",
    "description": "Seminar, one hour; fieldwork, one hour. Multidisciplinary nature of occupational health practice featured and explored in these varied-activity courses, including material related to recognition, prevention, surveillance, and management of work-related health problems that occupational health and safety researchers and professionals encounter in various work environments. Lectures, seminars, field exercises, workshops, clinical case conferences, and group assignments combined to help students develop skills necessary to integrate and communicate relevant approaches to occupational hazard detection and control, work-related injury and illness surveillance, and disease and disability prevention from different disciplines in field of occupational health and safety. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT230C"
  },
  {
    "course_code": "ENV HLT C235",
    "units": 4,
    "title": "Environmental Policy for Science and Engineering",
    "description": "Lecture, four hours. Limited to senior undergraduate and graduate students. Examination of theoretical underpinnings of several major types of regulatory policy, as well as practical issues involved in implementing and enforcing each. Exploration of selection and impact of regulatory forms from variety of disciplines and viewpoints. Focus on traditional command and control regulation (including self-executing performance standards and permitting), market-based regulation (such as emissions trading), remediation, and emerging regulatory approaches such as management-based regulation and alternatives assessment. Issues of compliance and enforcement. Concurrently scheduled with course C135. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC235"
  },
  {
    "course_code": "ENV HLT C240",
    "units": 4,
    "title": "Fundamentals of Toxicology",
    "description": "Lecture, four hours. Preparation: one course each in biology, organic chemistry, and biochemistry. Essential aspects of toxicology, with emphasis on human species. Absorption, distribution, excretion, biotransformation, as well as basic toxicologic processes and organ systems. Concurrently scheduled with course C140. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC240"
  },
  {
    "course_code": "ENV HLT M241",
    "units": 4,
    "title": "Advanced Concepts in Gene-Environment Interactions",
    "description": "(Same as Molecular Toxicology M247.) Lecture, three hours; discussion, one hour. Comprehensive and practical examination of emerging science of gene-environment interaction. Discussion of primary components of field, including role of metabolic pathways in modifying environmental responses and importance of environmental influences in human disease. Exploration of selected hot topics infield, such as importance of epigenetics and of microbiome. S/U or letter grading.",
    "cross_listed": [
      "MOL TOX M247"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTM241"
  },
  {
    "course_code": "ENV HLT C252D",
    "units": 4,
    "title": "Properties and Measurement of Airborne Particles",
    "description": "Lecture, four hours. Preparation: one year each of chemistry, physics, and calculus. Basic theory and application of aerosol science to environmental health, including properties, behavior, sampling, and measurement of aerosols and quantitative problems. Concurrently scheduled with course C152D. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC252D"
  },
  {
    "course_code": "ENV HLT 252E",
    "units": 4,
    "title": "Identification and Measurement of Gases and Vapors",
    "description": "Lecture, three hours; discussion, one hour; outside study, two hours. Preparation: one year each of chemistry, physics, and calculus. Theoretical and practical aspects of industrial hygiene sampling and measurement of gases and vapors. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT252E"
  },
  {
    "course_code": "ENV HLT 252F",
    "units": 3,
    "title": "Industrial Hygiene Measurements Laboratory",
    "description": "Laboratory, three hours. Corequisites: courses C252D, 252E. Limited to industrial hygiene majors. Laboratory methods for sampling, measurement, and analysis of gases, vapors, and aerosols found in occupational environment. S/U or letter grading.",
    "prerequisites": [
      "ENV HLT C252D",
      "ENV HLT 252E"
    ],
    "corequisites": [
      "ENV HLT C252D",
      "ENV HLT 252E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT252F"
  },
  {
    "course_code": "ENV HLT 252G",
    "units": 4,
    "title": "Industrial and Environmental Hygiene Assessment",
    "description": "Lecture, one hour; discussion, two hours; laboratory, two hours; outside study, four hours. Requisites: courses C200A, C200B, C252D, 252E, 252F. Environmental and industrial hygiene sampling strategies and assessment via walk-through surveys, lectures, group discussion, actual field measurements, laboratory calibrations, and analyses and reports, with emphasis on chemical, physical, and ergonomic hazards. Letter grading.",
    "prerequisites": [
      "ENV HLT C200A",
      "ENV HLT C200B",
      "ENV HLT C252D",
      "ENV HLT 252E",
      "ENV HLT 252F"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT252G"
  },
  {
    "course_code": "ENV HLT 253",
    "units": 2,
    "title": "Physical Agents in Work Environment",
    "description": "Lecture, two hours; laboratory, two hours. Preparation: one year of physics. Physics, measurement methods, health effects, and control methods for radiation (ionizing and nonionizing), noise, and thermal stress in workplace environment. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT253"
  },
  {
    "course_code": "ENV HLT 255",
    "units": 4,
    "title": "Control of Airborne Contaminants in Industry",
    "description": "Lecture, two hours; laboratory, two hours. Preparation: one year of physics. Requisite: course C252D. Principles and applications of control technology to industrial environments, including general and local exhaust ventilation, air cleaning equipment, and respiratory protection. S/U or letter grading.",
    "prerequisites": [
      "ENV HLT C252D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT255"
  },
  {
    "course_code": "ENV HLT 256",
    "units": 4,
    "title": "Biological and Health Surveillance Monitoring in Occupational/Environmental Health",
    "description": "Lecture, three hours; discussion, one hour; assignments, three hours. Principles and applications of biological monitoring and health surveillance to assess occupational and environmental exposures to organic and inorganic chemicals and physical factors. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT256"
  },
  {
    "course_code": "ENV HLT C257",
    "units": 4,
    "title": "Risk Assessment and Standard Setting",
    "description": "Seminar, four hours. Requisite: course C240. Designed to provide students with opportunity to review scientific basis for association of selected occupational and environmental exposures with disease. Special emphasis on critical evaluations of literature. Attention specifically to interface of science and regulatory standards. Concurrently scheduled with course C157. S/U or letter grading.",
    "prerequisites": [
      "ENV HLT C240"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC257"
  },
  {
    "course_code": "ENV HLT 258",
    "units": 4,
    "title": "Identification and Analysis of Hazardous Wastes",
    "description": "Lecture, three hours; discussion, one hour; laboratory, one hour; one field trip. Requisite: course 252E. Designed to define, identify, label, and quantify hazardous wastes and how workers should be protected. Provides critical understanding of all analytical aspects of hazardous wastes, health aspects, and regulation and practice of handling hazardous wastes. Letter grading.",
    "prerequisites": [
      "ENV HLT 252E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT258"
  },
  {
    "course_code": "ENV HLT 259A",
    "units": 4,
    "title": "Occupational Safety and Ergonomics",
    "description": "Lecture, four hours. Overview of most frequent and severe occupational injuries and illnesses, their distribution, causes, analysis methods, and control approaches, including low back pain, falls, machine exposures, upper extremity musculoskeletal disorders, fleet safety, and selected ergonomics topics. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT259A"
  },
  {
    "course_code": "ENV HLT 259B",
    "units": 2,
    "title": "Workplace Safety",
    "description": "Lecture, two hours. Introduction to broad range of topics in workplace safety through lectures on safety hazards, their classification, metrics, control philosophy, and control methods. Specific topics include traditional safety rubrics, such as fall hazards, machine safety, and fire hazards. Introduction to concepts of safety culture and philosophy. Review and presentation of peer-reviewed articles on topics relevant to course material. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT259B"
  },
  {
    "course_code": "ENV HLT M260",
    "units": 4,
    "title": "Occupational Epidemiology",
    "description": "(Same as Epidemiology M261.) Lecture, three hours. Requisites: Epidemiology 100; for Epidemiology majors, Epidemiology 200A, 200B, 200C. Methodological considerations, approaches, and limitations in epidemiological studies of occupational groups and environments. S/U or letter grading.",
    "prerequisites": [
      "EPIDEM 100"
    ],
    "cross_listed": [
      "EPIDEM M261"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTM260"
  },
  {
    "course_code": "ENV HLT 261",
    "units": 4,
    "title": "Chemical Behavior of Aquatic Systems",
    "description": "Lecture, three hours. Requisites: courses C200A, C200B, Chemistry 20A, 20B, Mathematics 3A. Chemistry of ocean waters, rivers, groundwaters, and water treatment systems. Topics include thermodynamics of natural waters, acids and bases, carbon dioxide cycle, solubility reactions, oxidation and reduction, plus applied problems. Letter grading.",
    "prerequisites": [
      "ENV HLT C200A",
      "ENV HLT C200B",
      "CHEM 20A",
      "CHEM 20B",
      "MATH 3A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT261"
  },
  {
    "course_code": "ENV HLT C264",
    "units": 4,
    "title": "Fate and Transport of Organic Chemicals in Aquatic Environment",
    "description": "Lecture, four hours. Preparation: bachelor’s degree in science, engineering, geophysics, chemistry, biology, or public health. Evaluation of how and where and in what form and concentration organic pollutants are distributed in aquatic environments. Study of mass transport mechanisms moving organic chemicals between phases, biological degradation and accumulation, and chemical reactions. Effect of humic substances on these processes. Concurrently scheduled with course C164. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTC264"
  },
  {
    "course_code": "ENV HLT M270",
    "units": 4,
    "title": "Work and Health",
    "description": "(Same as Community Health Sciences M278.) Lecture, three hours; practicum, one hour. Recommended preparation: graduate-level methods/statistics course, basic epidemiology. Designed for graduate students. Exploration of impact of work on physical and psychological health in context of newly emerging discipline. Focus on psychosocial models, measurement (including hands-on experience), contextual factors (gender, ethnicity, social class), and how work stressors can be ameliorated. S/U or letter grading.",
    "cross_listed": [
      "COM HLT M278"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTM270"
  },
  {
    "course_code": "ENV HLT 280",
    "units": 4,
    "title": "Nanomaterial-Related Emerging Technologies: Exposure and Health Effects",
    "description": "Seminar, three hours; activity, one hour. Students gain understanding of exposure and health effects of nanomaterials and related technologies, and of approaches to control exposure risks to workers and public. Students develop foundation for advanced studies in topics regarding nanomaterial-related emerging technologies. Topics include nano- and advanced materials and their developments; electronic products containing toxic substances and nanomaterials; nanotechnology-enabled products, their liability and regulatory compliance; exposure issues related to these materials and products throughout life cycle, including occupational and environmental perspectives; and biological mechanisms in humans from exposure intakes to post-exposure effects. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT280"
  },
  {
    "course_code": "ENV HLT 296A",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Psychosocial Factors and Occupational Health",
    "description": "Research group meeting, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296A"
  },
  {
    "course_code": "ENV HLT 296B",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Teratogenesis",
    "description": "Research group meeting, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296B"
  },
  {
    "course_code": "ENV HLT 296C",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Social Inequality and Environment",
    "description": "Research group meeting, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296C"
  },
  {
    "course_code": "ENV HLT 296G",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Advances in Aerosol Technology",
    "description": "Seminar, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296G"
  },
  {
    "course_code": "ENV HLT 296H",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Occupational and Environmental Exposure Assessment",
    "description": "Research group meeting, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296H"
  },
  {
    "course_code": "ENV HLT 296I",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Industrial and Environmental Hygiene",
    "description": "Seminar, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296I"
  },
  {
    "course_code": "ENV HLT 296J",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Work, Fertility, and Family",
    "description": "Research group meeting, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296J"
  },
  {
    "course_code": "ENV HLT 296K",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Aquatic Chemistry",
    "description": "Seminar, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296K"
  },
  {
    "course_code": "ENV HLT 296L",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Water Science and Health",
    "description": "Seminar, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296L"
  },
  {
    "course_code": "ENV HLT 296M",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Experimental and Modeling Studies of Atmospheric Pollution",
    "description": "Seminar, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296M"
  },
  {
    "course_code": "ENV HLT 296N",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Genetic Toxicology",
    "description": "Seminar, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296N"
  },
  {
    "course_code": "ENV HLT 296O",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Built Environment and Health",
    "description": "Research group meeting, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296O"
  },
  {
    "course_code": "ENV HLT 296P",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Global Environmental Change and Health",
    "description": "Seminar, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296P"
  },
  {
    "course_code": "ENV HLT 296Q",
    "units": 2,
    "title": "Research Topics in Environmental Health Sciences: Occupational and Environmental Exposure Assessment, Industrial Hygiene, and Advances in Emerging Technology",
    "description": "Seminar, two hours. Advanced study and analysis of current topics in environmental health sciences. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT296Q"
  },
  {
    "course_code": "ENV HLT 400",
    "units": 4,
    "title": "Field Studies in Environmental Health Sciences",
    "description": "Fieldwork, to be arranged. Field observation and studies in selected community environmental health organizations. Students must file field placement and program training documentation on form available from Student Affairs Office. May not be applied toward MS minimum course requirement; 4 units may be applied toward 62-unit minimum total required for MPH degree. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT400"
  },
  {
    "course_code": "ENV HLT 401",
    "units": 4,
    "title": "Environmental Measurements",
    "description": "Lecture, two hours; laboratory, four hours. Requisites: courses C200A, C200B, Chemistry 20A, 30AL. Instrumental methods for laboratory and field applications to assess quantity of environmental pollutants in air, food, and water, and to assess degree of exposure to such factors as noise and radiation. Letter grading.",
    "prerequisites": [
      "ENV HLT C200A",
      "ENV HLT C200B",
      "CHEM 20A",
      "CHEM 30AL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT401"
  },
  {
    "course_code": "ENV HLT 410A",
    "units": 4,
    "title": "Instrumental Methods in Environmental Sciences",
    "description": "Lecture, four hours; discussion, two hours; other, two hours. Preparation: one year each of physics, chemistry, and biology. Theory and principles of instrumental methods through lectures and group discussions. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT410A"
  },
  {
    "course_code": "ENV HLT 410B",
    "units": 4,
    "title": "Instrumental Methods Laboratory in Environmental Health Sciences",
    "description": "Lecture, one hour; discussion, one hour; laboratory, four hours; other, two hours. Preparation: one year each of physics, chemistry, and mathematics. Requisites: courses C200A, C200B. Laboratory techniques and instrumentation used in preparation and analysis of biological, environmental, and occupational samples. Letter grading.",
    "prerequisites": [
      "ENV HLT C200A",
      "ENV HLT C200B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT410B"
  },
  {
    "course_code": "ENV HLT 411",
    "units": 2,
    "title": "Environmental Health Sciences Seminar",
    "description": "Seminar, two hours. Required of graduate environmental health sciences students for one term each year. Current topics in environmental health in science, policy, and leadership. Speakers who are leading thinkers at interface of health and environment address important subjects of environmental health. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT411"
  },
  {
    "course_code": "ENV HLT 414A",
    "units": 2,
    "title": "Research Methods and Effective Communication in Environmental Health Sciencess",
    "description": "Lecture, two hours. Prepares doctoral students in environmental health sciences and related fields for skills needed to undertake dissertation. Skills including performing literature searches, designing research study, proposing specific aims, forming testable hypotheses, completing Institutional Review Board (IRB) application, choosing data collection methods, data management, analysis, and interpretation; and writing research proposal. Students complete pilot research proposal for submission for funding. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT414A"
  },
  {
    "course_code": "ENV HLT 414B",
    "units": 2,
    "title": "Research Methods and Effective Communication in Environmental Health Sciences",
    "description": "Lecture, two hours. Prepares doctoral students in environmental health sciences and related fields for skills needed to undertake dissertation. Skills including performing literature searches, designing research study, proposing specific aims, forming testable hypotheses, completing Institutional Review Board (IRB) application, choosing data collection methods, data management, analysis, and interpretation; and writing scientific paper and presenting research results. Students complete manuscript for submission to peer-reviewed journal. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT414B"
  },
  {
    "course_code": "ENV HLT 450",
    "units": 2,
    "title": "Case Studies in Regulatory Decision-Making: How Government Agencies Are Influenced to Delay Abatement of Local Health Threats",
    "description": "Seminar, two hours. Requisites: course C200A or Public Health 200A or equivalent. Examination of process in which regulatory decisions are made. Review of several case studies in which industrial operations resulted in discharge of toxic chemicals to air, soils, or surface waters, and subsequently threatened health of adjoining community; this is common scenario for which California's health-protective regulatory process was designed. Through review of response of state and local agencies in these cases, examination of how private interests can influence regulatory decisions, rendering process ineffective in abating health threats, especially in some of California's most vulnerable communities. As practitioners in public health, consideration of how framing of complex regulatory decision in public health terms can be vital to gaining support of policymakers and public. S/U or letter grading.",
    "prerequisites": [
      "ENV HLT C200A",
      "PUB HLT 200A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT450"
  },
  {
    "course_code": "ENV HLT 454",
    "units": 4,
    "title": "Health Hazards of Industrial Processes",
    "description": "Lecture, two hours; field trips, four hours. Requisite: course 255. Industrial processes and operations and occupational health hazards that arise from them. Letter grading.",
    "prerequisites": [
      "ENV HLT 255"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT454"
  },
  {
    "course_code": "ENV HLT 461",
    "units": 4,
    "title": "Water Quality and Health",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses C200A, C200B, 401. Introduction to water quality, with coverage of hydrology, water chemistry, and various chemical contaminants that may affect human health. Various treatment methods and health implications. S/U or letter grading.",
    "prerequisites": [
      "ENV HLT C200A",
      "ENV HLT C200B",
      "ENV HLT 401"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT461"
  },
  {
    "course_code": "ENV HLT M471",
    "units": 4,
    "title": "Improving Worker Health: Social Movements, Policy Debates, and Public Health",
    "description": "(Same as Community Health Sciences CM470 and Urban Planning M470.) Lecture, three hours; fieldwork, two hours. Examination of intersection between work, health, and environment, analysis of social causes of health disparities, investigation of historical trends and social movements, interpretation of current policy debates, and development of innovative interventions. S/U or letter grading.",
    "cross_listed": [
      "COM HLT CM470",
      "URBN PL M470"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLTM471"
  },
  {
    "course_code": "ENV HLT 495",
    "units": 2,
    "title": "Teacher Preparation in Environmental Health Sciences",
    "description": "Seminar, two hours. Preparation: 18 units of cognate courses in area of specialization. May not be applied toward master’s degree minimum total course requirement. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT495"
  },
  {
    "course_code": "ENV HLT 596",
    "units": 2,
    "title": "Directed Individual Study or Research",
    "description": "Tutorial, to be arranged. Limited to graduate students. Individual guided studies under direct faculty supervision. Only 4 units may be applied toward MPH and MS minimum total course requirement. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT596"
  },
  {
    "course_code": "ENV HLT 597",
    "units": 2,
    "title": "Preparation for Master's Comprehensive or Doctoral Qualifying Examinations",
    "description": "Tutorial, to be arranged. Limited to graduate students. May not be applied toward any degree course requirements. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT597"
  },
  {
    "course_code": "ENV HLT 598",
    "units": 2,
    "title": "Master's Thesis Research",
    "description": "Tutorial, four hours. Only 4 units may be applied toward MPH and MS minimum total course requirement; may not be applied toward minimum graduate course requirement. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT598"
  },
  {
    "course_code": "ENV HLT 599",
    "units": 2,
    "title": "Doctoral Dissertation Research",
    "description": "Tutorial, four hours. May not be applied toward any degree course requirements. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ENVHLT599"
  }
]