[
  {
    "course_code": "FOOD ST 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST19"
  },
  {
    "course_code": "FOOD ST 27",
    "units": 5,
    "title": "Critical Thinking about Food and Science Publications",
    "description": "Lecture, two hours; discussion, one hour. Development of process of further thinking about stories behind conclusions from nutrition studies and food scientific literature. Exercises, discussions, reports, and readings designed to provide practices to become critical thinker in food science and literature. P/NP or letter grading.",
    "satisfies": [
      "General Education - Life Sciences without Lab Credit (Scientific Inquiry)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST27"
  },
  {
    "course_code": "FOOD ST 35",
    "units": 5,
    "title": "Visual Representations of Food from Antiquity to Present",
    "description": "Lecture, three hours; discussion, one hour. Examination of food imagery in visual art from antiquity to present. Introduction to many major movements in Western art history, with primary focus on historical and sociological implications that can be derived from close analysis of visual representations of food, kitchens, markets, and agriculture over centuries. Topics of investigation include diets of ancient Romans as evidenced by floor mosaics and wall paintings of Pompeii; religious symbolism of food during Middle Ages; opulence of Renaissance banquets; common food of common folk; significance of still life paintings; what paintings can tell us about trade; turn-of-century tables; food and eroticism; economics, packaging, and advertising; and food presentation and plating as art form. P/NP or letter grading.",
    "satisfies": [
      "General Education - Visual & Performance Arts Analysis & Practice (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST35"
  },
  {
    "course_code": "FOOD ST M79",
    "units": 5,
    "title": "Food Politics: Cultural Solutions to Political Problems",
    "description": "(Same as World Arts and Cultures M79.) Lecture, four hours; discussion, one hour. Examination of issues of environmental and public health effects of intensive and extensive agriculture, influence of corporations on government, animal ethics, food deserts and urban gardening, and food insecurity. Focus on representation of such issues in documentaries, public lectures, memoirs, novels, and visual art, as well as on initiatives to address such problems through policy and activism. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Social Analysis (Society & Culture)",
      "General Education - Visual & Performance Arts Analysis & Practice (Arts & Humanities)"
    ],
    "cross_listed": [
      "WL ARTS M79"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODSTM79"
  },
  {
    "course_code": "FOOD ST 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST89"
  },
  {
    "course_code": "FOOD ST 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST89HC"
  },
  {
    "course_code": "FOOD ST 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST99"
  },
  {
    "course_code": "FOOD ST M132",
    "units": 5,
    "title": "Food Cultures and Food Politics",
    "description": "(Same as English M118F and Society and Genetics M132.) Lecture, four hours; discussion, one hour (when scheduled). Requisite: English Composition 3. Introduction to interdisciplinary field of food studies, with focus on how literature, art, science writing, and visual culture address political dimensions of food and agriculture in specific contexts. P/NP or letter grading.",
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "cross_listed": [
      "SOC GEN M132",
      "ENGL M118F"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODSTM132"
  },
  {
    "course_code": "FOOD ST 133W",
    "units": 5,
    "title": "Historical Recipes and Recipe for History",
    "description": "Lecture, two hours; discussion, one hour. Requisite: English Composition 3. Exploration of historical meaning of food in late Medieval and Early Modern Europe through lens of recipes. How recipes, as historical documents, are related to culture, social interactions, and historical ways of knowing. Introduction to ways that historians attempt to understand and recreate rhythms of daily life through interactive pedagogy and experimental recreation of historical recipes. Students gain working knowledge of food studies as interdisciplinary field from historical perspective. Research project documenting original research. Satisfies Writing II requirement. P/NP or letter grading.",
    "satisfies": [
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST133W"
  },
  {
    "course_code": "FOOD ST M136",
    "units": 4,
    "title": "Eating Society: Science and Politics of Food from Individual to Planetary Health",
    "description": "(Same as Society and Genetics M136 and Sociology M136.) Lecture, three hours; discussion, one hour. Questions of food and health are both individual and social. Students gain tools for understanding relationships between individual eaters, medicine, and social organization of food production and processing through set of research frameworks newly emergent in range of social and health sciences. Topics include individual and social ramifications of microbiome science; understanding how human gut microbes and health are shaped by pasteurization, processing, and food safety practices; One Health approaches that encompass human and animal health, discussing examples such as antibiotic resistance and emerging infectious disease as effects of large-scale agriculture; planetary health frameworks that link individual human metabolic health to issues of sustainable agriculture, for example how pesticides and fertilizers tie diets to environments; and resilience of cultural food systems in face of environmental pollution as issue of reproductive health. Letter grading.",
    "cross_listed": [
      "SOCIOL M136",
      "SOC GEN M136"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODSTM136"
  },
  {
    "course_code": "FOOD ST 142",
    "units": 4,
    "title": "Introduction to Cellular Agriculture",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Introduction to cellular agriculture as it relates to generating ex vivo edible animal proteins of meat, fish, dairy, and other products from cells. Topics include exploration of food production methods and impacts to the environment. Other topics may include human health, conventional animal agriculture and food cultivation, developing food technologies and methods, food safety regulations, and socio-cultural frameworks. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST142"
  },
  {
    "course_code": "FOOD ST M157",
    "units": 4,
    "title": "Food: Molecules, Microbes, Environment",
    "description": "(Same as Chemistry M157.) Lecture, three hours; discussion, one hour. Requisite: Chemistry 153A. Recommended requisites: Life Sciences 7A, 7B. Study of science of food. Study of food units physical, biological, environmental, social, and behavioral sciences. Use of scientific concepts to explain properties of food. Covers range of topics that focus on science of cooking, critical role of microbes in transformation of foods, genetic and environmental concerns related to acquisition of food, and impact of different dietary systems on metabolism and physiology. Comprises four major interrelated topics: molecules of food and their sources, science of cooking, acquisition of food, eating. P/NP or letter grading.",
    "prerequisites": [
      "CHEM 153A"
    ],
    "cross_listed": [
      "CHEM M157"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODSTM157"
  },
  {
    "course_code": "FOOD ST 159",
    "units": 4,
    "title": "Food and Health in Global Perspective",
    "description": "Lecture, three hours. Not open to students with credit for Society and Genetics 134. Study problematizes and adds depth to common-sense understandings of healthy and unhealthy consumption by examination of relationship between food and health, from critical and holistic perspective, that accounts for interplay of biology and culture within broader historical, societal, and global contexts. Topics include what is meant by health, especially in terms of diet; relationship between food practices and evolutionary biology, as well as particular environments of societies, cultural systems, histories, and their health implications; how major global foods have come to their dominance and consequences for health; and influences of food production, distribution, and preparation on health. P/NP or letter grading.",
    "credit_exclusions": [
      "SOC GEN 134"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST159"
  },
  {
    "course_code": "FOOD ST M167",
    "units": 4,
    "title": "Historical Sociology of Urban/Rural Relations and Food Production",
    "description": "(Same as Sociology M137.) Lecture, three hours; discussion, one hour. Historical examination of food supply and food production in relation to urban and rural regions. Topics include food logistics such as storage, transportation, and distribution, as well as human population growth and migration, famine and hunger, and agricultural advances and environmental impacts. P/NP or letter grading.",
    "cross_listed": [
      "SOCIOL M137"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODSTM167"
  },
  {
    "course_code": "FOOD ST M170XP",
    "units": 4,
    "title": "Food Studies and Food Justice in Los Angeles",
    "description": "(Formerly numbered M170SL.) (Same as Community Engagement and Social Change M170XP.) Seminar, three hours; fieldwork, two hours. Interdisciplinary service learning course that provides general understanding of access and equity issues related to food chain in Los Angeles. Exploration of social justice issues faced by residents of lower-income communities. Reading of research from multiple disciplines, including but not limited to public health, environmental justice, and public policy. Service-learning component includes meaningful work with off-campus community partners selected in advance by instructor and Center for Community Learning. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "CESC M170XP"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODSTM170XP"
  },
  {
    "course_code": "FOOD ST M176XP",
    "units": 5,
    "title": "Making Films about Food",
    "description": "(Formerly numbered M176SL.) (Same as Community Engagement and Social Change M176XP and Public Affairs M176XP.) Lecture, three hours. Introduction to documentary video production and distribution. Students work on assignments in pairs and small groups to create 8- to 10-minute video about one of several Los Angeles partner organizations that advocate for healthy, local, sustainable food. Consideration, through video production, of challenges posed by existing farming, ranching, and distribution methods, and strategies these groups are pursuing to create more sustainable food pathways. Students look at social media communication strategies to help think through intervention in face of historically entrenched industrial food production and regulations that remain favorable to mass-produced, processed food items. P/NP or letter grading.",
    "cross_listed": [
      "PUB AFF M176XP",
      "CESC M176XP"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODSTM176XP"
  },
  {
    "course_code": "FOOD ST M177",
    "units": 4,
    "title": "Superfoods: Cultural and Global Perspectives",
    "description": "(Same as Global Studies M177 and International Development Studies M177.) Seminar, four hours. Exploration of superfoods, which are nutrient rich foods considered beneficial for well-being, health, and longevity, as they are high in minerals, vitamins, and antioxidants. While superfoods have been part of cultures’ diets for centuries, in recent decades they have been researched in scientific and medical communities. Citizens globally have begun to increasingly demand and consume foods that are nutritious, organic, and sustainable. It is important also to address issues such as marketing, misinformation, and hyper about superfoods. Surge of interest in superfoods is increasingly important in context of ongoing global inequities with regards to food access and production. Study addresses paradox that communities cope simultaneously with malnutrition/hunger and obesity, and how farming practices for superfoods and staple crops are related. P/NP or letter grading.",
    "cross_listed": [
      "GLBL ST M177",
      "INTL DV M177"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODSTM177"
  },
  {
    "course_code": "FOOD ST M179",
    "units": 4,
    "title": "Food Activism in Los Angeles: Narrating Pasts, Imagining Futures",
    "description": "(Same as World Arts and Cultures M179.) Lecture, two hours; discussion, two hours. Introduction to history and praxis of local interventions into food insecurity and food oppression, such as community gardens, pop-up markets, and care farms. Through ethnographic and oral history methodologies, students learn how food activists organize themselves, and mobilize creativity to counteract injustice. Focus on relationships between food access, food oppression, food politics, and food ethics; and social histories of race, class, urban planning, and housing discrimination. P/NP or letter grading.",
    "cross_listed": [
      "WL ARTS M179"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODSTM179"
  },
  {
    "course_code": "FOOD ST 181",
    "units": 4,
    "title": "Special Topics: Perspectives on Food and Society",
    "description": "Lecture, 90 minutes; discussion, one hour. Variable topics that engage with current societal challenges through lens of food and transdisciplinary approach. Emphasis on food-related issues that impact society from social justice to food access to planetary health. May be repeated for credit with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST181"
  },
  {
    "course_code": "FOOD ST 187",
    "units": 4,
    "title": "Special Topics in Food Studies",
    "description": "Lecture, three hours. Variable topics in one area within food studies. May be repeated for credit with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST187"
  },
  {
    "course_code": "FOOD ST 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST189"
  },
  {
    "course_code": "FOOD ST 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST189HC"
  },
  {
    "course_code": "FOOD ST 195C",
    "units": 4,
    "title": "Community and Corporate Internships in Food Studies for Capstone",
    "description": "Tutorial, to be arranged; fieldwork, eight to 10 hours. Limited to juniors/seniors. Internship in corporate, governmental, or nonprofit setting coordinated through Center for Community Learning (CCL). Students complete weekly written assignments, attend biweekly meetings with graduate student coordinator, and write final research paper. Faculty sponsor and graduate student coordinator construct series of reading assignments that examine issues related to internship site. Fulfills capstone experience requirement for Food Studies minor. Individual contract with site supervisor, CCL coordinator, and faculty sponsor required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST195C"
  },
  {
    "course_code": "FOOD ST 195CE",
    "units": 4,
    "title": "Community and Corporate Internships in Food Studies",
    "description": "Tutorial, to be arranged; fieldwork, eight to 10 hours. Limited to juniors/seniors. Internship in corporate, governmental, or nonprofit setting coordinated through Center for Community Engagement. Students complete weekly written assignments, attend biweekly meetings with graduate student instructor, and write final research paper. Faculty mentor and graduate student instructor construct series of reading assignments that examine issues related to internship site. May be repeated for credit with consent of Center for Community Engagement. No more than 8 units may be applied toward major; units applied must be taken for letter grade. May not be applied toward concentration or distribution requirements. Individual contract with supervising faculty member required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST195CE"
  },
  {
    "course_code": "FOOD ST 196",
    "units": 4,
    "title": "Research Apprenticeship in Food Studies",
    "description": "Tutorial, one hour. Entry-level research apprenticeship under guidance of faculty mentors affiliated with Food Studies minor. Collaboration with faculty mentors on their research in area related to food studies. May be repeated for credit. Individual contract required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST196"
  },
  {
    "course_code": "FOOD ST 197",
    "units": 2,
    "title": "Individual Studies in Foodways, Diet, and Nutrition",
    "description": "Tutorial, to be arranged. Limited to juniors/seniors. Individual intensive study, with scheduled meetings between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST197"
  },
  {
    "course_code": "FOOD ST 199",
    "units": 4,
    "title": "Directed Research or Senior Project in Food Studies",
    "description": "Tutorial, to be arranged. Limited to juniors/seniors. Supervised individual research projects in food studies under guidance of faculty mentor. Culminating paper required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FOODST199"
  }
]