[
  {
    "course_code": "FRNCH 1",
    "units": 4,
    "title": "Elementary French",
    "description": "Lecture, five hours. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH1"
  },
  {
    "course_code": "FRNCH 2",
    "units": 4,
    "title": "Elementary French",
    "description": "Lecture, five hours. Enforced requisite: course 1 with grade of C– or better. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 2"
    ],
    "prerequisites": [
      "FRNCH 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH2"
  },
  {
    "course_code": "FRNCH 3",
    "units": 4,
    "title": "Elementary French",
    "description": "Lecture, five hours. Enforced requisite: course 2 with grade of C– or better. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 3"
    ],
    "prerequisites": [
      "FRNCH 2"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH3"
  },
  {
    "course_code": "FRNCH 4",
    "units": 4,
    "title": "Intermediate French",
    "description": "Lecture, four hours. Enforced requisite: course 3 with grade of C– or better. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 3"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH4"
  },
  {
    "course_code": "FRNCH 5",
    "units": 4,
    "title": "Intermediate French",
    "description": "Lecture, four hours. Enforced requisite: course 4 with grade of C– or better. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 4"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH5"
  },
  {
    "course_code": "FRNCH 6",
    "units": 4,
    "title": "Intermediate French",
    "description": "Lecture, four hours. Enforced requisite: course 5 with grade of C– or better. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH6"
  },
  {
    "course_code": "FRNCH 8",
    "units": 12,
    "title": "Intensive First-Year French",
    "description": "Lecture, 15 hours. All-in-French intensive language program equivalent to first year of college French and designed to develop basic language skills. Additional work in language and media laboratory required. Offered in summer only. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 3"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH8"
  },
  {
    "course_code": "FRNCH 9",
    "units": 8,
    "title": "Intensive Second-Year French",
    "description": "Lecture, 10 hours; media laboratory, three hours. Enforced requisite: course 3. Intensive course equivalent to first two terms of intermediate French and designed to improve proficiency in reading, writing, and speaking. Offered in summer only. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 3"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH9"
  },
  {
    "course_code": "FRNCH 12",
    "units": 5,
    "title": "Introduction to Study of French and Francophone Literature",
    "description": "Lecture, two hours; discussion, one hour. Enforced requisite: course 6. Principles of literary analysis as applied to selected texts in poetry, theater, and prose by French and Francophone writers. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 6"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH12"
  },
  {
    "course_code": "FRNCH 14",
    "units": 5,
    "title": "Introduction to French Culture and Civilization in English",
    "description": "Lecture, three hours; discussion, one hour. Not open for credit to students with credit for course 14W. Study of contemporary French institutions and issues in cultural, political, and socioeconomic realms. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "equivalent_courses": [
      "FRNCH 14W"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH14"
  },
  {
    "course_code": "FRNCH 14W",
    "units": 5,
    "title": "Introduction to French Culture and Civilization in English",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 14. Study of contemporary French institutions and issues in cultural, political, and socioeconomic realms. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Writing II",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "prerequisites": [
      "ENGCOMP 3",
      "ENGCOMP 3H",
      "ESL 36"
    ],
    "equivalent_courses": [
      "FRNCH 14"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH14W"
  },
  {
    "course_code": "FRNCH 16",
    "units": 5,
    "title": "Society And Self in Early Modern France",
    "description": "Lecture, three hours; discussion, one hour. Role of religion, politics, and sociability in constructing self and understanding its relation with society in early modern France. Development of students’ critical thought and knowledge of French and European intellectual tradition. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH16"
  },
  {
    "course_code": "FRNCH 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH19"
  },
  {
    "course_code": "FRNCH 41",
    "units": 5,
    "title": "French Cinema and Culture",
    "description": "Lecture/screenings, five hours; discussion, one hour. Introduction to French culture and literature through study of films of cultural and literary significance. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Visual & Performance Arts Analysis & Practice (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH41"
  },
  {
    "course_code": "FRNCH 60",
    "units": 5,
    "title": "French and Francophone Novel",
    "description": "Lecture, three hours; discussion, one hour. Study of literary masterpieces produced by writers from France and Francophone world (Canada, Africa, Caribbean, etc.) from 17th to early 21st century. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH60"
  },
  {
    "course_code": "FRNCH 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH89"
  },
  {
    "course_code": "FRNCH 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH89HC"
  },
  {
    "course_code": "FRNCH 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH99"
  },
  {
    "course_code": "FRNCH 100",
    "units": 5,
    "title": "Written Expression: Techniques of Description and Narration",
    "description": "Lecture, three hours. Requisite: course 5. Taught in French. Writing assignments follow close analysis of relevant texts, film, and related grammatical structures. Examination of vocabulary and structures associated with descriptive writing and French verb tense system required for narration. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH100"
  },
  {
    "course_code": "FRNCH 101",
    "units": 4,
    "title": "Advanced Expository Writing: Techniques of Argumentation",
    "description": "Lecture, three hours. Requisite: course 100. Study of rhetorical devices and revision of related grammatical structures. Writing assignments follow analysis of relevant texts. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 100"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH101"
  },
  {
    "course_code": "FRNCH 104",
    "units": 4,
    "title": "Theory and Correction of Diction",
    "description": "Lecture, three hours. Enforced requisite: course 6. Study of individual sounds (vowels, consonants, and semi-vowels), including rhythm, intonation, and phrasing, and of learning sound—spelling correspondences to help sight read accurately. Thorough study of symbols of International Phonetic Alphabet (IPA) to give students tools to work on pronunciation systematically. Standard French serves as model, with examination of pronunciation changes and various dialects that are spoken in Francophone world to improve listening comprehension and pronunciation. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 6"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH104"
  },
  {
    "course_code": "FRNCH 105",
    "units": 4,
    "title": "Structure of French",
    "description": "Lecture, three hours. Prior background in linguistics not required. Introduction to linguistic analysis of French in areas of phonology, morphology, syntax, and language variation. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH105"
  },
  {
    "course_code": "FRNCH 107",
    "units": 4,
    "title": "Advanced Oral Expression",
    "description": "Lecture, three hours. Requisite: course 6. Discussion and analysis of current events and sociocultural issues; techniques of argumentation. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 6"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH107"
  },
  {
    "course_code": "FRNCH 108",
    "units": 4,
    "title": "Advanced Practical Translation",
    "description": "Lecture, three hours. Enforced requisite: course 5. Translation of literary, sociocultural, and journalistic texts. May include editorials, polemical issues, film subtitles, biography and interview, formal and informal reporting, advertising and idiomatic language. Comparative stylistics of translation. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH108"
  },
  {
    "course_code": "FRNCH 109",
    "units": 4,
    "title": "French for Professional Purposes: Language and Communication in Professional Environment",
    "description": "Lecture, three hours. Requisite: course 6. Oral and written communication in professional environment, including job search (résumé and cover letter), correspondence (professional letter and e-mail), and how to understand and negotiate work life in French-speaking company. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 6"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH109"
  },
  {
    "course_code": "FRNCH 110XP",
    "units": 5,
    "title": "French in Community",
    "description": "Lecture, three hours; fieldwork, four hours. Requisite: course 5. French immigrants started to settle in Los Angeles already in the 19th century. Today, Los Angeles has the third-largest population of French citizens in the U.S. The francophone community includes people of very diverse backgrounds such as francophone Africa, Benelux countries, and Canada. Unlike other communities, French speakers are not always easy to track down in the city because of their geographic, cultural, and social diversity. French immersion schools allow for an opportunity to connect with the francophone community of Los Angeles and its complex dynamics. Students work in a public-school context with children belonging to Los Angeles’ francophone community. Students collaborate with local stakeholders of French language education to address needs of Los Angeles area public schools and enhance community well-being. A West Los Angeles school hosts students for the quarter. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH110XP"
  },
  {
    "course_code": "FRNCH 114A",
    "units": 5,
    "title": "Survey of French Literature: Medieval and Renaissance Literature",
    "description": "Lecture, three hours. Requisite: course 12. Masterpieces of medieval and Renaissance literature, including examples of epic (La Chanson de Roland), romance (Chrétien de Troyes’ Yvain), and Renaissance prose and poetry (including Marot, Du Bellay, Ronsard, Rabelais, Marguerite de Navarre, and Montaigne). P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 12"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH114A"
  },
  {
    "course_code": "FRNCH 114B",
    "units": 5,
    "title": "Survey of French Literature: 17th and 18th Centuries",
    "description": "Lecture, three hours. Requisite: course 12. Study of selections from major works of classicism and Enlightenment, including those by Racine, Pascal, La Fayette, La Fontaine, Laclos, Diderot, Voltaire, and Rousseau. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 12"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH114B"
  },
  {
    "course_code": "FRNCH 114C",
    "units": 5,
    "title": "Survey of French Literature: 19th and 20th Centuries",
    "description": "Lecture, three hours. Requisite: course 5. Taught in French. Study of major literary movements and writers of period, including works by Balzac, Baudelaire, Duras, Flaubert, Gide, Hugo, Proust, Robbe-Grillet, Sartre, Stendhal, and Zola. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH114C"
  },
  {
    "course_code": "FRNCH 115",
    "units": 4,
    "title": "Studies in Medieval French Culture and Literature",
    "description": "Lecture, three hours. Enforced requisite: course 5. Taught in French. Study of medieval French culture and literature, including lyric poetry and narrative romance, history of medieval warfare, comedy, and class structures. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH115"
  },
  {
    "course_code": "FRNCH 116",
    "units": 4,
    "title": "Studies in Renaissance French Culture and Literature",
    "description": "Lecture, three hours. Taught in French. Study of Renaissance French culture and literature, including la Pléiade and 16th-century poetry, linguistic and poetic revolution, novel and early prose, and late French humanism. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH116"
  },
  {
    "course_code": "FRNCH 117",
    "units": 4,
    "title": "Studies in 17th-Century French Culture and Literature",
    "description": "Lecture, three hours. Enforced requisite: course 5. Taught in French. Study of 17th-century French culture and literature, including theater, philosophers, moralists, novelists, and cultural, political, social, religious, and courtly aspects. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH117"
  },
  {
    "course_code": "FRNCH 118",
    "units": 4,
    "title": "Studies in 18th-Century French Culture and Literature",
    "description": "Lecture, three hours. Taught in French. Study of 18th-century French culture and literature, including satire, novel, theater, philosophers, and theoretical writings. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH118"
  },
  {
    "course_code": "FRNCH 119",
    "units": 4,
    "title": "Studies in 19th-Century French Culture and Literature",
    "description": "Lecture, three hours. Enforced requisite: course 5. Taught in French. Study of 19th-century French culture and literature, including Romanticism, generation of 1848, naturalism and symbolism, and genres and trends from 1885 through World War I. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH119"
  },
  {
    "course_code": "FRNCH 120",
    "units": 4,
    "title": "Studies in 20th-Century French Culture and Literature",
    "description": "Lecture, three hours. Requisite: course 5. Taught in French. Study of 20th-century French culture and literature, including early 20th-century writers, surrealism, literature from 1915 to 1945, post-World War II literature, existentialism, new novel, theater, and poetry. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH120"
  },
  {
    "course_code": "FRNCH 121",
    "units": 4,
    "title": "Studies in Francophone Cultures and Literatures",
    "description": "Lecture, three hours. Enforced requisite: course 5. Taught in French. Study of Francophone cultures and literatures, including works by poets, playwrights, and novelists from Caribbean, North Africa, Quebec, and sub-Saharan Africa, immigrant narratives, and colonialism and postcolonial studies. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH121"
  },
  {
    "course_code": "FRNCH 130",
    "units": 4,
    "title": "Contemporary French and Francophone Cultures",
    "description": "Lecture, three hours. Requisite: course 5. Taught in French. Study of contemporary France and Francophone world (Africa, Asia, Caribbean, Quebec), government, institutions, and cultural, economic, social, and political issues. May be repeated for credit with topic change. Letter grading.",
    "prerequisites": [
      "FRNCH 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH130"
  },
  {
    "course_code": "FRNCH 133",
    "units": 4,
    "title": "French and Francophone Short Story",
    "description": "Lecture, three hours. Taught in French. Survey of short fiction forms in France and Francophone world. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH133"
  },
  {
    "course_code": "FRNCH 135",
    "units": 4,
    "title": "Eco-Citizenship: Encounters with Eco-Citizens",
    "description": "Lecture, three hours. Enforced requisite: course 6. Taught in French. Not open to students with credit for course 165. Exploration of what eco-citizen is, what it means to be eco-citizen, if we are eco-citizens, and why. Answers to these questions by studying sustainability in France. Study of French cities (i.e., Nantes) that act as real-life laboratories. Using reading, videos, and podcasts, students make observations and draw some conclusions regarding concept of eco-citizenship. Study of some theories on eco-citizenship developed by French thinkers. Exploration of how French citizens aspire to be eco-citizens. Students meet with them formally and informally through readings, videos, and virtual meetings. Examination of several experiments put in place by these cities, and assessment of whether these are successes or failures. Comparison and contrast of actions to protect environment developed in Los Angeles and at UCLA. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 6"
    ],
    "equivalent_courses": [
      "FRNCH 165"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH135"
  },
  {
    "course_code": "FRNCH 136",
    "units": 4,
    "title": "French and Francophone Autobiography",
    "description": "Lecture, three hours. Requisite: course 5. Taught in French. Rhetoric of genre and its relation to broad questions of identity, gender, race, and class. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH136"
  },
  {
    "course_code": "FRNCH 137",
    "units": 4,
    "title": "French and Francophone Intellectual History",
    "description": "Lecture, three hours. Requisite: course 12 or 100. Taught in French. Exploration of themes that address particular problem of French literature, civilization, or ideas. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 12",
      "FRNCH 100"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH137"
  },
  {
    "course_code": "FRNCH 138",
    "units": 4,
    "title": "Contemporary French Theory",
    "description": "Lecture, three hours. Requisite: course 12 or 100. Taught in French. Study of French theorists (Barthes, Baudrillard, Cixous, Derrida, Foucault, Irigaray) and major concepts in contemporary French thought, with attention to its influence on and application to literary and nonliterary texts. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 12",
      "FRNCH 100"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH138"
  },
  {
    "course_code": "FRNCH 139",
    "units": 4,
    "title": "Paris: Study of French Capital",
    "description": "Lecture, three hours. Enforced requisite: course 5. Taught in French. Textual and visual exploration of historical and imaginary (re)constructions of Paris, beginning with its earliest history and gradual formation of this great urban complex in maps from Renaissance to 20th century. Study of city’s streets and quarters, traffic and transportation, multiple layers of past, present, and future, and flâneurs and insurrectionists through wide range of literary and critical texts. Readings cover mainly 19th and 20th centuries—Honoré de Balzac, Charles Baudelaire, Emile Zola, Marcel Proust, Louis-Ferdinand Céline, and others. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH139"
  },
  {
    "course_code": "FRNCH 140",
    "units": 4,
    "title": "Nantes: Shape of City",
    "description": "Lecture, three hours. Enforced requisite: course 6. Taught in French. Not open for credit to students with credit for course 170. Metaphorical and virtual exploration of city of Nantes in western France to discover rich culture. Study of French government’s repressive measures against Breton culture, and especially Breton language. Examination of Nantes’s dark part, i.e. 18th-century slave trade. Study of how people today made it their mission to recover this repressed memory, and to create connections with African countries, victims of slave trade. Examination of Nantes’s industrial part and how in recent years old and abandoned industrial sites are transformed into inclusive spaces such as village solidaire, place to combat homelessness and promote social connections for all. P/NP or letter grading.",
    "prerequisites": [
      "FRNCH 6"
    ],
    "equivalent_courses": [
      "FRNCH 170"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH140"
  },
  {
    "course_code": "FRNCH 141",
    "units": 4,
    "title": "French Cinema",
    "description": "Lecture, three hours. Study of French cinema and cinematographers in generic, thematic, and sociocultural aspects. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH141"
  },
  {
    "course_code": "FRNCH 142",
    "units": 4,
    "title": "Francophone Cinema",
    "description": "Lecture, three hours. Study of Francophone (Africa, Caribbean, postcolonial communities in France) cinema and cinematographers in generic, thematic, and sociocultural aspects. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH142"
  },
  {
    "course_code": "FRNCH 160",
    "units": 4,
    "title": "Francophone Cultures in English",
    "description": "Lecture, three hours. Study of historical, anthropological, legal, literary, or filmic texts to provide students with broad view of some main issues in field of colonial and postcolonial Francophone studies. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH160"
  },
  {
    "course_code": "FRNCH 161",
    "units": 4,
    "title": "French and Francophone Theater in Translation",
    "description": "Lecture, three hours. Through plays of 20th century, analysis of struggles of individuals and social groups in contexts that are historical, political, philosophical (existentialism, absurd), and cultural (colonialism and conformism). May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH161"
  },
  {
    "course_code": "FRNCH 163",
    "units": 4,
    "title": "French and Francophone Short Story in Translation",
    "description": "Lecture, three hours. Survey of short fiction forms in France and Francophone world. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH163"
  },
  {
    "course_code": "FRNCH 164",
    "units": 4,
    "title": "French and Francophone Novel in Translation",
    "description": "Lecture, three hours. Study of French novels. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH164"
  },
  {
    "course_code": "FRNCH 165",
    "units": 4,
    "title": "Eco-Citizenship: Encounters with Eco-Citizens in Translation",
    "description": "Lecture, three hours. Not open to students with credit for course 135. Exploration of what eco-citizen is, what it means to be eco-citizen, if we are eco-citizens, and why. Answers to these questions by studying sustainability in France. Study of French cities (i.e., Nantes) that act as real-life laboratories. Using reading, videos, and podcasts, students make observations and draw some conclusions regarding concept of eco-citizenship. Study of some theories on eco-citizenship developed by French thinkers. Exploration of how French citizens aspire to be eco-citizens. Students meet with them formally and informally through readings, videos, and virtual meetings. Examination of several experiments put in place by these cities, and assessment of whether these are successes or failures. Comparison and contrast of actions to protect environment developed in Los Angeles and at UCLA. P/NP or letter grading.",
    "equivalent_courses": [
      "FRNCH 135"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH165"
  },
  {
    "course_code": "FRNCH 166",
    "units": 4,
    "title": "French and Francophone Autobiography in Translation",
    "description": "Lecture, three hours. Rhetoric of genre and its relation to broad questions of identity, gender, race, and class. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH166"
  },
  {
    "course_code": "FRNCH 167",
    "units": 4,
    "title": "French and Francophone Intellectual History in Translation",
    "description": "Lecture, three hours. Readings of French and Francophone writers, historians, and thinkers. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH167"
  },
  {
    "course_code": "FRNCH 14W",
    "units": 5,
    "title": "Introduction to French Culture and Civilization in English",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 14. Study of contemporary French institutions and issues in cultural, political, and socioeconomic realms. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Writing II",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "prerequisites": [
      "ENGCOMP 3",
      "ENGCOMP 3H",
      "ESL 36"
    ],
    "equivalent_courses": [
      "FRNCH 14"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH169"
  },
  {
    "course_code": "FRNCH 170",
    "units": 4,
    "title": "Nantes: Shape of City in Translation",
    "description": "Lecture, three hours. Not open for credit to students with credit for course 140. Metaphorical and virtual exploration of city of Nantes in western France to discover rich culture. Study of French government’s repressive measures against Breton culture, and especially Breton language. Examination of Nantes’s dark part, i.e. 18th-century slave trade. Study of how people today made it their mission to recover this repressed memory, and to create connections with African countries, victims of slave trade. Examination of Nantes’s industrial part and how in recent years old and abandoned industrial sites are transformed into inclusive spaces such as village solidaire, place to combat homelessness and promote social connections for all. P/NP or letter grading.",
    "equivalent_courses": [
      "FRNCH 140"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH170"
  },
  {
    "course_code": "FRNCH 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH189"
  },
  {
    "course_code": "FRNCH 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH189HC"
  },
  {
    "course_code": "FRNCH 191A",
    "units": 4,
    "title": "Variable Topics Research Seminars in Translation",
    "description": "Seminar, three hours. Research seminars on topics to be announced each term. Topics include major writers, genres, cultural movements, or theoretical practices. Reading, discussion, and development of culminating project. May be repeated for credit with consent of major adviser. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH191A"
  },
  {
    "course_code": "FRNCH 191B",
    "units": 4,
    "title": "Variable Topics Research Seminars: French",
    "description": "Seminar, three hours. Taught in French. Research seminars on topics to be announced each term. Topics include major writers, genres, cultural movements, or theoretical practices. Reading, discussion, and development of culminating project. May be repeated for credit with consent of major adviser. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH191B"
  },
  {
    "course_code": "FRNCH 195",
    "units": 4,
    "title": "Community or Corporate Internships in French",
    "description": "Tutorial, to be arranged. Limited to juniors/seniors. Internship in supervised setting in community agency or business. Students meet on regular basis with instructor and provide periodic reports of their experience. May be repeated for credit. Individual contract with supervising faculty member required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH195"
  },
  {
    "course_code": "FRNCH 198",
    "units": 4,
    "title": "Honors Research in French",
    "description": "Tutorial, three hours. Limited to junior/senior French majors with 3.5 departmental and 3.25 overall grade-point averages. Development and completion of honors thesis or comprehensive research project under direct supervision of faculty member. May be repeated for credit. Individual contract required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH198"
  },
  {
    "course_code": "FRNCH 199",
    "units": 2,
    "title": "Directed Research or Senior Project in French",
    "description": "Tutorial, three hours. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH199"
  },
  {
    "course_code": "FRNCH 200",
    "units": 4,
    "title": "Contemporary French Theories",
    "description": "Lecture, three hours. Introductory study of French structuralist and poststructuralist thought in literature, linguistics, psychoanalysis, anthropology, philosophy, and feminism, that may include texts by Althusser, Barthes, Deleuze, Derrida, Foucault, Genette, Irigaray, Kristeva, Lacan, Lyotard, and others. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH200"
  },
  {
    "course_code": "FRNCH 201",
    "units": 4,
    "title": "Techniques of Literary Analysis",
    "description": "Lecture, three hours. Practice in close analysis of literary texts, including explication de teste. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH201"
  },
  {
    "course_code": "FRNCH 202",
    "units": 4,
    "title": "Cultural Studies",
    "description": "Lecture, three hours. Introduction to theoretical approaches to popular and mass culture, and to postcolonial and Francophone cultures. Topics include emergent disciplines and theories such as sociology and structuralism, city, revolution, avant-garde strategies, media, diaspora during postwar modernization, Algerian War, May 68, and beyond. Theorists include Barthes, de Certeau, Bourdieu, Baudrillard, Lyotard, Ross, Rey Chow, Virilio. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH202"
  },
  {
    "course_code": "FRNCH 203",
    "units": 4,
    "title": "Contemporary Francophone Literature",
    "description": "Lecture, three hours. Study of Francophone African, Caribbean, Vietnamese, or Quebec literatures and cultures, with specific attention to issues of cultural contact, language, colonialism, anticolonialism, nationalism, resistance and dissidence, and postcolonial theory. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH203"
  },
  {
    "course_code": "FRNCH 204",
    "units": 4,
    "title": "Studies in Autobiography",
    "description": "Lecture, three hours. Introduction to theories of autobiography and subjectivity, and to genre of autobiography in literatures in French across centuries. Topics include early modern approaches to self-writing, Rousseau and emergence of modern self, women’s autobiography in France and Francophone world. Theorists may include Georges Gusdorf, Philippe Lejeune, Paul de Man, Jacques Derrida, Helene Cixous, Michel Foucault, Pierre Bourdieu, Toril Moi. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH204"
  },
  {
    "course_code": "FRNCH 205",
    "units": 4,
    "title": "Studies in Cinema and Literature",
    "description": "Lecture, three hours. Discussion of selected topics in French and Francophone cinema and literature. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH205"
  },
  {
    "course_code": "FRNCH 207",
    "units": 4,
    "title": "Studies in History of Ideas",
    "description": "Seminar, three hours. Particular problems in French literature and ideas. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH207"
  },
  {
    "course_code": "FRNCH 208",
    "units": 4,
    "title": "Studies in Literary Criticism",
    "description": "Seminar, three hours. Readings in literary criticism, theory, and literature from any period of French literature. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH208"
  },
  {
    "course_code": "FRNCH 209",
    "units": 4,
    "title": "Studies in Literary Genre",
    "description": "Seminar, three hours. Advanced research and study of literary genres such as poetry, drama, fiction, autobiography, or performance and of theory of these genres. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH209"
  },
  {
    "course_code": "FRNCH M210",
    "units": 4,
    "title": "Paleography of Latin and Vernacular Manuscripts, 900 to 1500",
    "description": "(Same as Classics M218, English M215, and History M218.) Lecture, three hours; discussion, two hours. Introduction to history of Latin and vernacular manuscript book from 900 to 1500 to (1) train students to make informed judgments with regard to place and date of origin, (2) provide training in accurate reading and transcription of later medieval scripts, and (3) examine manuscript book as witness to changing society that produced it. Focus on relationship between Latin manuscripts and vernacular manuscripts with regard to their respective presentation of written texts. S/U or letter grading.",
    "cross_listed": [
      "HIST M218",
      "Paleography of Latin and Vernacular Manuscripts, 900",
      "Paleography of Latin and Vernacular Manuscripts, 1500",
      "ENGL M215",
      "Paleography of Latin and Vernacular Manuscripts, 900",
      "Paleography of Latin and Vernacular Manuscripts, 1500",
      "CLASSIC M218",
      "Paleography of Latin and Vernacular Manuscripts, 900",
      "Paleography of Latin and Vernacular Manuscripts, 1500"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCHM210"
  },
  {
    "course_code": "FRNCH 214",
    "units": 4,
    "title": "Problematics of Medieval Language and Literature",
    "description": "Lecture, three hours. Introduction to Old French and problematics of medieval literature. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH214"
  },
  {
    "course_code": "FRNCH 215",
    "units": 4,
    "title": "Studies in Middle Ages",
    "description": "Seminar, three hours. Examination of nature of cross-cultural, crosslinguistic, and cross-confessional exchange in medieval and early modern periods and France’s role in it. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH215"
  },
  {
    "course_code": "FRNCH 216",
    "units": 4,
    "title": "Renaissance",
    "description": "Lecture, three hours. French literature of 16th century studied within historical, intellectual, and cultural contexts. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH216"
  },
  {
    "course_code": "FRNCH 217",
    "units": 4,
    "title": "17th Century",
    "description": "Lecture, three hours. Readings in 17th-century literature studied within historical, cultural, and literary contexts. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH217"
  },
  {
    "course_code": "FRNCH 218",
    "units": 4,
    "title": "Enlightenment",
    "description": "Lecture, three hours. Readings in 18th-century French literature and thought: novels, satires, plays, and other key Enlightenment philosophies. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH218"
  },
  {
    "course_code": "FRNCH 219",
    "units": 4,
    "title": "19th Century",
    "description": "Lecture, three hours. Readings in 19th-century literature, covering development of novel, lyric poetry, and theater from Romantic period to fin-de-siecle. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH219"
  },
  {
    "course_code": "FRNCH 220",
    "units": 4,
    "title": "20th Century",
    "description": "Lecture, three hours. Overview, both historical and analytical, of 20th-century French literature set in context of several key critical topics that interrogate canonical interpretation. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH220"
  },
  {
    "course_code": "FRNCH 296",
    "units": 2,
    "title": "Research Methods and Writing",
    "description": "Seminar, two hours. Advanced study of current topics in literary and cultural analysis and in critical theory. Discussion of current research and literature in research specialty of faculty member teaching course. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH296"
  },
  {
    "course_code": "FRNCH 596",
    "units": 2,
    "title": "Directed Individual Studies or Research",
    "description": "Tutorial, to be arranged. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH596"
  },
  {
    "course_code": "FRNCH 597",
    "units": 2,
    "title": "Preparation for Second-Year Review or PhD Qualifying Examinations",
    "description": "Tutorial, to be arranged. May be repeated for maximum of 16 units. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH597"
  },
  {
    "course_code": "FRNCH 598",
    "units": 2,
    "title": "Research for and Preparation of MA Thesis",
    "description": "Tutorial, to be arranged. Maximum of 4 units may be applied toward MA degree requirements. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH598"
  },
  {
    "course_code": "FRNCH 599",
    "units": 2,
    "title": "Research for and Preparation of PhD Dissertation",
    "description": "Tutorial, to be arranged. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/FRNCH599"
  }
]