[
  {
    "course_code": "GRNTLGY 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGY19"
  },
  {
    "course_code": "GRNTLGY 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGY89"
  },
  {
    "course_code": "GRNTLGY 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGY89HC"
  },
  {
    "course_code": "GRNTLGY 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGY99"
  },
  {
    "course_code": "GRNTLGY M104C",
    "units": 4,
    "title": "Diversity in Aging: Roles of Gender and Ethnicity",
    "description": "(Same as Chicana/o and Central American Studies M106B, Gender Studies M104C, Public Affairs M131, and Social Welfare M104C.) Lecture, four hours. Exploration of complexity of variables related to diversity of aging population and variability in aging process. Examination of gender and ethnicity within context of both physical and social aging, in multidisciplinary perspective utilizing faculty from variety of fields to address issues of diversity. Letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "GENDER M104C",
      "SOC WLF M104C",
      "CCAS M106B",
      "PUB AFF M131"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGYM104C"
  },
  {
    "course_code": "GRNTLGY M104D",
    "units": 4,
    "title": "Public Policy and Aging",
    "description": "(Same as Social Welfare M104D.) Lecture, four hours. Examination of theoretical models and concepts of policy process, with application to aging policy. Analysis of decision-making processes that affect aging policy. Description of history of contemporary aging policy. Exploration of current policy issues affecting elderly. P/NP or letter grading.",
    "cross_listed": [
      "SOC WLF M104D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGYM104D"
  },
  {
    "course_code": "GRNTLGY M104E",
    "units": 4,
    "title": "Social Aspects of Aging",
    "description": "(Same as Social Welfare M104E.) Lecture, four hours. Topics include theories of aging, economic factors, changing roles, social relationships, and special populations. Weekly seminars organized around key aspect of social gerontology. P/NP or letter grading.",
    "cross_listed": [
      "SOC WLF M104E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGYM104E"
  },
  {
    "course_code": "GRNTLGY M108",
    "units": 5,
    "title": "Biomedical, Social, and Policy Frontiers in Human Aging",
    "description": "(Same as Public Affairs M130 and Social Welfare M108.) Lecture, four hours. Limited to juniors/seniors. Course of human aging charted in ways that are based on variety of recent research frontiers. Use of conceptual frameworks to increase relevance of aging to students’ lives and enhance their critical thinking—biopsychosocial approach that is based on recognition that aging is inherently interdisciplinary phenomenon, and life course perspective that is distinguished by analytical framework it provides for understanding interplay between human lives and changing social structures, and allows students to understand how events, successes, and losses at one stage of life can have important effects later in life. Focus on individuals as they age within one particular sociohistorical context. Letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)"
    ],
    "cross_listed": [
      "PUB AFF M130",
      "SOC WLF M108"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGYM108"
  },
  {
    "course_code": "GRNTLGY M119O",
    "units": 4,
    "title": "Psychology of Aging",
    "description": "(Same as Psychology M119O.) Lecture, four hours. Requisite: Psychology 115. Designed for juniors/seniors. Aging refers to developmental changes occurring at end stages of life. Some alterations that occur represent improvement, others are detrimental. Examination of impact of aging process on mental phenomena and exploration of ways in which positive changes can be maximally utilized and impact of detrimental alterations minimized. P/NP or letter grading.",
    "prerequisites": [
      "PSYCH 115"
    ],
    "cross_listed": [
      "PSYCH M119O"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGYM119O"
  },
  {
    "course_code": "GRNTLGY M119X",
    "units": 4,
    "title": "Biology and Behavioral Neuroscience of Aging",
    "description": "(Same as Psychology M119X.) Lecture, three hours. Designed for juniors/seniors. Biologic mechanisms of aging process and its terminal phase, death, have been increasingly studied in recent years. Establishment of what is known experimentally about biology and behavioral neuroscience of aging and evaluation of theories developed to account for this knowledge. P/NP or letter grading.",
    "cross_listed": [
      "PSYCH M119X"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGYM119X"
  },
  {
    "course_code": "GRNTLGY 120",
    "units": 4,
    "title": "Sex and Aging",
    "description": "Lecture, three hours. Sexuality in aging from psychological, psychobiological, physical, and psychosocial perspectives, with emphasis on differences between females and males concerning physical and social changes that occur with aging and how this impacts on emotional well-being and human sexual response. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGY120"
  },
  {
    "course_code": "GRNTLGY M142XP",
    "units": 4,
    "title": "Intergenerational Communication across Lifespan",
    "description": "(Formerly numbered M142SL.) (Same as Public Affairs M129XP and Social Welfare M142XP.) Lecture, three hours; fieldwork, one hour. Limited to juniors/seniors. What do you say to your parents in conversation? How do you talk to your grandparents? Does your family talk well to one another as group? How do you communicate well with boss who is 30 years older than you? Individuals of all ages interact with one another, and their interactions have significance throughout their lives. Introduction to psychological, interpersonal, and societal issues related to intergenerational communication across lifespan. Letter grading.",
    "cross_listed": [
      "SOC WLF M142XP",
      "PUB AFF M129XP"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGYM142XP"
  },
  {
    "course_code": "GRNTLGY M150",
    "units": 4,
    "title": "Sociology of Aging",
    "description": "(Same as Sociology M150.) Lecture, three hours; discussion, one hour. Study of sociological processes shaping definition, experience, and response to aging in contemporary society. Topics include race, class, and gender in aging over life course; interpersonal relations and social worlds of aged; caregiving relations and institutions; professions concerned with aged and aging. Letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture"
    ],
    "cross_listed": [
      "SOCIOL M150"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGYM150"
  },
  {
    "course_code": "GRNTLGY M165",
    "units": 4,
    "title": "Disability Policy and Services in Contemporary America",
    "description": "(Same as Disability Studies M130 and Social Welfare M165.) Lecture, three hours. Limited to juniors/seniors. Growing numbers of people of all ages with disabilities are leading active and productive lives in American communities. Many others are struggling to lead such lives. Who are people with disabilities in contemporary America? How has U.S. responded over time to various needs and aspirations of people with disabilities, young and old? What demands have been made over time by disability advocates? How has government addressed demands of advocates for various disability populations? What do we know about extent to which public policies and programs are responsive to people in need? How do demographics, economics, and politics continue to influence evolving public policy responses? P/NP or letter grading.",
    "cross_listed": [
      "SOC WLF M165",
      "DIS STD M130"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGYM165"
  },
  {
    "course_code": "GRNTLGY 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGY189"
  },
  {
    "course_code": "GRNTLGY 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGY189HC"
  },
  {
    "course_code": "GRNTLGY 195",
    "units": 2,
    "title": "Community or Corporate Internships in Gerontology",
    "description": "Tutorial, six to 12 hours. Requisite: course M108, or Clusters 80A and 80BX. Limited to juniors/seniors. Students propose their own ideas for internship project and petition for its approval. Approval of internship is contingent on position having relevance in field of gerontology. May be repeated for credit. Individual contract with supervising faculty member required. P/NP or letter grading.",
    "prerequisites": [
      "GRNTLGY M108",
      "CLUSTER 80A",
      "CLUSTER 80BX"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGY195"
  },
  {
    "course_code": "GRNTLGY 199",
    "units": 4,
    "title": "Directed Research or Senior Project in Gerontology",
    "description": "Tutorial, to be arranged. Requisites: course M108, or GE Clusters 80A and 80B. Limited to juniors/seniors. Supervised individual research under guidance of gerontology faculty mentor. Submission of weekly writing assignments and research paper at end of term. Eight units of 199 (or 195CE) required for successful completion of minor. Individual contract required. Information and contracts may be obtained from Gerontology Advising Office. Letter grading.",
    "prerequisites": [
      "GRNTLGY M108",
      "CLUSTER 80A",
      "CLUSTER 80B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GRNTLGY199"
  }
]