[
  {
    "course_code": "HIST 138C",
    "units": 4,
    "title": "U.S. History, 1800 to 1850",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Discussion of major social, political, economic, and cultural transformations of first half of 19th century and how these changes helped to drive wedge between North and South. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST138C"
  },
  {
    "course_code": "HIST 1A",
    "units": 5,
    "title": "Introduction to Western Civilization: Ancient Civilizations, Prehistory to circa AD 843",
    "description": "Lecture, three hours; discussion, one hour. Survey of diverse cultures that shaped foundation of Western civilization to onset of 9th century AD. Investigation of first civilizations in Near East and Egypt. Analysis of worlds of Greeks and Romans. Examination of ways in which western European societies created new syntheses through selective appropriation of Greek and Roman cultures and introduction of new cultural forms. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "equivalent_courses": [
      "HIST 1AH",
      "Ancient Civilizations, Prehistory to circa AD 843"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST1A"
  },
  {
    "course_code": "HIST 1B",
    "units": 5,
    "title": "Introduction to Western Civilization: Circa 843 to circa 1715",
    "description": "Lecture, three hours; discussion, one hour. Introduction to history of the West and its connections to rest of world from 843 to 1715. Profound social, political, cultural, and intellectual changes that affected development of modern world. Topics covered include economic, social, and cultural aspects of feudal system; relationship between Church and empire; new religious movements (including the Reformation); formation of nation-states; relationship between Western Europe and non-European and non-Christian people and traditions. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "equivalent_courses": [
      "HIST 1BH",
      "Circa AD 843",
      "Circa AD 1715"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST1B"
  },
  {
    "course_code": "HIST 1C",
    "units": 5,
    "title": "Introduction to Western Civilization: Circa 1715 to Present",
    "description": "Lecture, three hours; discussion, one hour. Introduction to history of the West and its connection to rest of world after 1715, during period of sweeping political, social, and cultural tensions and transformations. Topics covered include industrialization, rise of nationalism and mass politics, revolutionary movements, urbanization, mass global migrations, European expansion and imperialism, and decolonization, leading to emergence of new nation states in Europe’s former colonies. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "equivalent_courses": [
      "HIST 1CH",
      "Circa 1715"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST1C"
  },
  {
    "course_code": "HIST 2B",
    "units": 5,
    "title": "Social Knowledge and Social Power",
    "description": "Lecture, three hours; discussion, two hours. History of social knowledge and social power in the 19th and 20th centuries. Everyday ideas and practices about human nature, common sense, and community and relation of those practices to social thought, social engineering, and social science. Themes include development of social knowledges through public activities and discourses; how social knowledge differs in agricultural, mercantile, industrial, and information-based political economies; and how social science addresses these issues. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST2B"
  },
  {
    "course_code": "HIST 2C",
    "units": 5,
    "title": "Religion, Occult, and Science: Mystics, Heretics, and Witches in Western Tradition, 1000 to 1600",
    "description": "Lecture, three hours; discussion, two hours. Specific aspects of elite and popular culture in medieval and early modern Europe. Manner in which men and women sought to explain, order, and escape terrors of their lives by embracing transcendental religious experiences and dreaming of apocalypse and witchcraft. Examination of experiences in context of genesis of the state, birth of a new science, and economic and social change. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST2C"
  },
  {
    "course_code": "HIST 3A",
    "units": 5,
    "title": "History of Science: Renaissance to 1800",
    "description": "Lecture, three hours; discussion, two hours. Survey of beginnings of physical sciences involving transformation from Aristotelian to Newtonian cosmology, mechanization of natural world, rise of experimental science, and origin of scientific societies. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST3A"
  },
  {
    "course_code": "HIST 3B",
    "units": 5,
    "title": "History of Science: Enlightenment to 1900",
    "description": "Lecture, three hours; discussion, two hours. In this period science became part of Enlightenment campaign for reason and of culture of an Industrial Revolution. New social science and evolutionary debates about science and religion demonstrate its rising intellectual and practical significance. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST3B"
  },
  {
    "course_code": "HIST 3C",
    "units": 5,
    "title": "History of Science: 20th Century",
    "description": "Lecture, three hours; discussion, two hours. Ranging from startling new physics of relativity and the quantum, and of nuclear weapons, to molecular reductionism in biology and campaigns for statistical objectivity, examination of involvement of science in technological, military, intellectual, and political changes of the 20th century. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST3C"
  },
  {
    "course_code": "HIST 3D",
    "units": 5,
    "title": "History of Modern Medicine",
    "description": "Lecture, three hours; discussion, two hours. Examination, through illustrated lectures and focused discussion of primary sources, of five important themes in development of modern medicine: nature of diagnosis, emergence of surgery, epidemics, conception and treatment of insanity, and use of medical technology. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST3D"
  },
  {
    "course_code": "HIST M4",
    "units": 5,
    "title": "Introduction to History of Religions",
    "description": "(Same as Religion M4.) Lecture, three hours; discussion, two hours. Comparative study of eight major religious traditions, with emphasis on their beginnings and subsequent decisive changes in their respective historical developments and interactions. Equips students with intellectual tools necessary for thinking analytically, empathetically, and comparatively about fascinating human phenomena identified as religious, such as sacred acts, places, words, and persons in their varied historical contexts. Development of student skills in critical thinking, analyzing documents, and making persuasive arguments based on historical evidence. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "cross_listed": [
      "RELIGN M4"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM4"
  },
  {
    "course_code": "HIST 5",
    "units": 5,
    "title": "Holocaust: History and Memory",
    "description": "Lecture, three hours; discussion, two hours. Holocaust, murder of six million Jews by Germans in Nazi-occupied Europe during World War II, is one of crucial events of modern history. Examination of origins of Holocaust, perpetrators and victims, and changing efforts to come to terms with this genocide. Exploration of forces that led to Holocaust, including emergence of scientific racism, anti-Semitism, and machinery of modern state. Consideration of debates about implementation of genocide, including significance of gender and sexuality, relationship between war and genocide, meanings of resistance and culpability, and political and philosophical implications of Holocaust. Exploration of how genocide of European Jewry was intertwined with targeting of other victims of Nazi rule, including Roma, Slavs, black Germans, disabled, homosexuals, and political opponents of National Socialism. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST5"
  },
  {
    "course_code": "HIST 8A",
    "units": 5,
    "title": "Colonial Latin America",
    "description": "Lecture, three hours; discussion, one hour. Not open for credit to students with credit for course 8AH. General introduction to Latin American history from contact period to independence (1490s to 1820s), with emphasis on convergence of Native American, European, and African cultures in Latin America; issues of ethnicity and gender; development of colonial institutions and societies; and emergence of local and national identities. Readings focus on writings of Latin American men and women from the period studied. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "equivalent_courses": [
      "HIST 8AH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST8A"
  },
  {
    "course_code": "HIST 8B",
    "units": 5,
    "title": "Modern Latin America",
    "description": "Lecture, three hours; discussion, one hour. Introductory survey of social, political, and economic history of Latin America after independence, region that includes Mexico, Central and South America, and Caribbean. Formation of independent nation states and political regimes and quest for sovereignty and its challenges in shadow of U.S., approached from bottom up through lens of social history, everyday life, and popular culture. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "equivalent_courses": [
      "HIST 8BH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST8B"
  },
  {
    "course_code": "HIST 8C",
    "units": 5,
    "title": "Latin American Social History",
    "description": "Lecture, three hours; discussion, two hours. Historical and contemporary perspective of role of ordinary people in Latin American society. Each lecture/film session centers on a major Latin American movie illustrative of a theme in social history. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "equivalent_courses": [
      "HIST 8CH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST8C"
  },
  {
    "course_code": "HIST 9A",
    "units": 5,
    "title": "Introduction to Asian Civilizations: History of India",
    "description": "Lecture, three hours; discussion, two hours. Introductory survey for beginning students of major cultural, social, and political ideas, traditions, and institutions of Indic civilization. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST9A"
  },
  {
    "course_code": "HIST 9C",
    "units": 5,
    "title": "Introduction to Asian Civilizations: History of Japan",
    "description": "Lecture, three hours; discussion, two hours. Survey of Japanese history from earliest recorded time to the present, with emphasis on development of Japan as a cultural daughter of China. Attention to manner in which Chinese culture was Japanized and aspects of Japanese civilization which became unique. Creation of the modern state in the last century and impact of Western civilization on Japanese culture. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "equivalent_courses": [
      "HIST 9CH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST9C"
  },
  {
    "course_code": "HIST 9D",
    "units": 5,
    "title": "Introduction to Asian Civilizations: History of Middle East",
    "description": "Lecture, three hours; discussion, two hours. Introduction to history of Muslim world from advent of Islam to present day. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "Diversity - Arts and Architecture",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST9D"
  },
  {
    "course_code": "HIST 9E",
    "units": 5,
    "title": "Introduction to Asian Civilizations: Southeast Asian Crossroads",
    "description": "Lecture, three hours; discussion, two hours. Overview history of a region united by its wet tropical environment and divided by great religious, cultural, and political pluralism, with focus on Vietnamese, Thai, Filipino, Khmer, Burmese, and Malayo-Indonesian patterns. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST9E"
  },
  {
    "course_code": "HIST M10A",
    "units": 5,
    "title": "History of Africa to 1800",
    "description": "(Same as African American Studies M10A.) Lecture, three hours; discussion, one hour. Exploration of development of African societies from earliest times to late 18th century. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "cross_listed": [
      "AF AMER M10A",
      "History of Africa to 1800"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM10A"
  },
  {
    "course_code": "HIST 10B",
    "units": 5,
    "title": "History of Africa, 1800 to Present",
    "description": "Lecture, three hours; discussion, two hours. Not open for credit to students with credit for course 10BH or 10BW. Survey of social, economic, and political developments in Africa since 1800, with focus on slave trade, imperialism and colonialism, and nationalism and independence. Attention to different ideologies (nationalism, socialism, apartheid), rural/urban tensions, changing role of women. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "equivalent_courses": [
      "HIST 10BH",
      "HIST 10BW",
      "Introduction to Civilizations of Africa since 1800"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST10B"
  },
  {
    "course_code": "HIST 10BW",
    "units": 5,
    "title": "Introduction to Civilizations of Africa since 1800",
    "description": "Lecture, three hours; discussion, two hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 10B or 10BH. Survey of social, economic, and political developments in Africa since 1800, with focus on slave trade, imperialism and colonialism, and nationalism and independence. Attention to different ideologies (nationalism, socialism, apartheid), rural/urban tensions, changing role of women. Four papers required. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3",
      "ENGCOMP 3H",
      "ESL 36"
    ],
    "equivalent_courses": [
      "HIST 10B",
      "History of Africa, 1800",
      "HIST 10BH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST10BW"
  },
  {
    "course_code": "HIST 11A",
    "units": 5,
    "title": "History of China: To 1000",
    "description": "Lecture, three hours; discussion, two hours. Survey of early history of China—genesis of characteristic Chinese institutions and modes of thought from antiquity to 1000. Focus on social, political, intellectual, and economic aspects of early and middle empires. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "equivalent_courses": [
      "HIST 11AH",
      "To 1000"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST11A"
  },
  {
    "course_code": "HIST 11B",
    "units": 5,
    "title": "History of China, circa 1000 to 2000",
    "description": "Lecture, three hours; discussion, one hour. Survey of later history of China—evolution of characteristic Chinese institutions and modes of thought from circa 1000 to 2000. Focus on social, political, intellectual, cultural, and economic aspects of early modern regimes and empires and rise of modern China into contemporary era. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "equivalent_courses": [
      "HIST 11BH",
      "HIST 1000",
      "HIST 1950"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST11B"
  },
  {
    "course_code": "HIST 12A",
    "units": 5,
    "title": "Inequality: History of Mass Imprisonment",
    "description": "Lecture, three hours; discussion, one hour. Beginning with end of U.S.-Mexican War (1848) and ending with beginning of World War II, historical analysis from days when Los Angeles first became U.S. town until 1940s when Los Angeles first became global epicenter of human confinement. Exploration of major eras and turning points in city’s rise as both national and global leader in human incarceration, with review of historical foundations of mass imprisonment in Los Angeles. Introduction to current social and political landscape of imprisonment in Los Angeles. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Social Analysis (Society & Culture)",
      "American History and Institutions",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST12A"
  },
  {
    "course_code": "HIST 12B",
    "units": 5,
    "title": "Inequality: History of Neoliberalism",
    "description": "Lecture, three hours; discussion, one hour. Exploration of origins, ideas, and consequences of neoliberalism—theory that society is best organized on principles of free trade, deregulation, and privatization. Combination of political, economic, and intellectual history to construct genealogy of neoliberal thinking by attending to 18th- and 19th-century liberalism, colonialism, imperialism, rise of social democracy and military Keynesianism, and Mount Pelerin Society’s Cold War resuscitation of 19th-century liberalism. Coverage of economic crisis of 1970s, restructuring of global political economy in U.S., Europe, global south—specifically debt, structural adjustment policies, environmental destruction, and military intervention. Tracing of colonial roots of global north-south divide to reveal how neoliberal policies represent longer process of accumulation by dispossession and enclosure rather than sudden radical break from Keynesian model. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Social Analysis (Society & Culture)",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST12B"
  },
  {
    "course_code": "HIST 12C",
    "units": 5,
    "title": "Inequality: Global History of Anti-Colonial Thought and Struggle",
    "description": "Lecture, three hours; discussion, one hour. Ongoing growth and normalization of poverty, violence, and racial hatred in neo-liberal present have direct linkage to earlier moment when colonial rule of previous century brought about global structure of inequality. Examination of some of most important voices of anti-colonial and anti-imperialist struggle from comparative perspective in order to historicize current conjuncture. Readings include Aimé Césaire, Frantz Fanon, Ho Chi Minh, Toten Miyazaki, Sun Yat-Sen, Shusui Kotoku, Malcolm X, Che Guevara, and Mahatma Gandhi. Use of dialogue to reveal and reflect on commonalities and differences of thinker/activist pairs. Historical background for each thinker and active engagement in interpretation and discussion of texts. Group project as way to reflect on current conjecture. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST12C"
  },
  {
    "course_code": "HIST 13A",
    "units": 5,
    "title": "History of the U.S. and Its Colonial Origins: Colonial Origins and First Nation Building Acts",
    "description": "Lecture, three hours; discussion, one hour. Strongly recommended for History majors planning to take more advanced courses in U.S. history. Cultural heritages, political institutions, economic developments, and social interactions which created contemporary society. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST13A"
  },
  {
    "course_code": "HIST 13B",
    "units": 5,
    "title": "History of the U.S. and Its Colonial Origins: 19th Century",
    "description": "Lecture, three hours; discussion, one hour. Strongly recommended for History majors planning to take more advanced courses in U.S. history. Cultural heritages, political institutions, economic developments, and social interactions which created contemporary society. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST13B"
  },
  {
    "course_code": "HIST 13C",
    "units": 5,
    "title": "History of the U.S. and Its Colonial Origins: 20th Century",
    "description": "Lecture, three hours; discussion, one hour. Strongly recommended for History majors planning to take more advanced courses in U.S. history. Cultural heritages, political institutions, economic developments, and social interactions which created contemporary society. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST13C"
  },
  {
    "course_code": "HIST 14",
    "units": 5,
    "title": "Atlantic World, 1492 to 1830",
    "description": "Lecture, three hours; discussion, one hour. Strongly recommended for History majors planning to take more advanced courses in history of any region bordering on Atlantic during period from 1500 to 1900. Exploration of idea of Atlantic world and few of major historical trends that shaped its history, including migration, slavery, imperial conflicts, and revolution. Atlantic history approach avoids national frameworks that assume creation of later national division in order to understand larger, integrated region, one that gave rise to later nation states. In reconsidering how past is studied, highlights key connections, interactions, and circuits that gave rise to modern world. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST14"
  },
  {
    "course_code": "HIST 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST19"
  },
  {
    "course_code": "HIST 20",
    "units": 5,
    "title": "World History to AD 600",
    "description": "Lecture, three hours; discussion, two hours. Examination of earliest civilizations of Asia, North Africa, and Europe—Mesopotamia, Egypt, Israel, India, China, Greece, and Rome—from development of settled agricultural communities until about AD 500, with focus on rise of cities, organization of society, nature of kingship, writing and growth of bureaucracy, varieties of religious expression, and linkage between culture and society. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST20"
  },
  {
    "course_code": "HIST 21",
    "units": 5,
    "title": "World History, circa 600 to 1760",
    "description": "Lecture, three hours; discussion, two hours. Outline of world history from rise of Islam to start of Industrial Revolution, structured around a broad chronological narrative of salient developments. Use of thematic and comparative approaches, with certain recurring themes and institutions that modulate from culture to culture. Reading of variety of contemporary accounts to look at way people perceived cultures outside their own. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST21"
  },
  {
    "course_code": "HIST 22",
    "units": 5,
    "title": "Contemporary World History, 1760 to Present",
    "description": "Lecture, three hours; discussion, two hours. Broad thematic survey of world history since the mid-18th century. Examination, through lecture and discussion, of global implications of imperialism, total war, nationalism, cultural change, decolonization, changes in women’s rights and roles, and eclipse of world communism. Designed to introduce students to historical study, help them understand issues and dilemmas facing the world today, and prepare them for more in-depth work in history of specific regions or countries of the world. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "Diversity - Arts and Architecture",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST22"
  },
  {
    "course_code": "HIST M60",
    "units": 5,
    "title": "Achaemenid Civilization and Empire of Alexander",
    "description": "(Same as Ancient Near East M60 and Iranian M60.) Lecture, three hours; discussion, one hour. Survey of period from circa 600 to 300 BCE, rise and fall of Achaemenid Persia, first world empire of antiquity, which was ended by Alexander the Great, whose campaigns were as transformative as they were violent. Alexander connected ancient Mediterranean and Near East as never before, ushering in new era and forever changing cultural landscape of ancient world. Focus on themes of ancient kingship and political ideology; comparative study of empires; administration and institutions; and religious and ethnic diversity in large, heterogeneous states. Emphasis on diversity critical to understanding political nuances of ancient world. Students gain broad knowledge of Achaemenid and Macedonian empires, facility with ancient primary sources, and development of analytical skills central to discipline of history that allow conceptualizing issues of diversity and othering in ancient world. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "equivalent_courses": [
      "HIST M60W",
      "IRANIAN M60W",
      "AN N EA M60W"
    ],
    "cross_listed": [
      "IRANIAN M60",
      "AN N EA M60"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM60"
  },
  {
    "course_code": "HIST M60W",
    "units": 5,
    "title": "Achaemenid Civilization and Empire of Alexander",
    "description": "(Same as Ancient Near East M60W and Iranian M60W.) Lecture, three hours; discussion, one hour. Requisite: English Composition 3. Not open for credit to students with credit for course M60. Survey of period from circa 600 to 300 BCE, rise and fall of Achaemenid Persia, first world empire of antiquity, which was ended by Alexander the Great, whose campaigns were as transformative as they were violent. Alexander connected ancient Mediterranean and Near East as never before, ushering in new era and forever changing cultural landscape of ancient world. Focus on themes of ancient kingship and political ideology; comparative study of empires; administration and institutions; and religious and ethnic diversity in large, heterogeneous states. Emphasis on diversity critical to understanding political nuances of ancient world. Students gain broad knowledge of Achaemenid and Macedonian empires, facility with ancient primary sources, and development of analytical skills central to discipline of history that allow conceptualizing issues of diversity and othering in ancient world. Satisfies Writing II requirement. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)",
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "equivalent_courses": [
      "AN N EA M60",
      "HIST M60",
      "IRANIAN M60"
    ],
    "cross_listed": [
      "AN N EA M60W",
      "IRANIAN M60W"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM60W"
  },
  {
    "course_code": "HIST 88",
    "units": 4,
    "title": "Sophomore Seminars: History",
    "description": "Seminar, three hours. Limited to maximum of 20 lower-division students. Readings and discussions designed to introduce students to current research in discipline. Culminating project may be required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST88"
  },
  {
    "course_code": "HIST 88GE",
    "units": 5,
    "title": "Sophomore Seminar: Special Topics in History",
    "description": "Seminar, four hours. Requisite: designated GE lecture course; see Schedule of Classes for specific requisite lecture and seminar topics. Designed for sophomores/juniors. Exploration of aspects of lecture topic through readings, images, and discussions. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "prerequisites": [],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST88GE"
  },
  {
    "course_code": "HIST 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST89"
  },
  {
    "course_code": "HIST 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST89HC"
  },
  {
    "course_code": "HIST 94",
    "units": 4,
    "title": "What Is History? An Introduction to Historical Thinking and Practice",
    "description": "Lecture, two hours; discussion, two hours. What is history, who is it that we study, how do we study, and why should we study history? Introduction to basic principles of historical inquiry. Exploration of how we come to know about the past and why it matters. In-depth examination of how the historian works and analysis of sources and visual matters, including site visits. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST94"
  },
  {
    "course_code": "HIST 96W",
    "units": 5,
    "title": "Introduction to Historical Practice",
    "description": "Seminar, three hours. Requisite: English Composition 3. Introduction to study of history, with emphasis on historical theory and research methods. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST96W"
  },
  {
    "course_code": "HIST 97",
    "units": 1,
    "title": "Historical Practices Adjunct Seminar",
    "description": "Seminar, one hour. Corequisite: any course from History 97A through 97O. Limited to History majors. Exploration of topics covered in courses 97A through 97O in greater depth through supplemental readings, discussions, or other activities. P/NP grading.",
    "prerequisites": [
      "HIST 97A",
      "HIST 97O"
    ],
    "corequisites": [
      "HIST 97A",
      "HIST 97O"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97"
  },
  {
    "course_code": "HIST 97A",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in Ancient History",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics course; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97A"
  },
  {
    "course_code": "HIST 97B",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in Medieval History",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics courses; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97B"
  },
  {
    "course_code": "HIST 97C",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in European History",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics courses; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97C"
  },
  {
    "course_code": "HIST 97D",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in U.S. History",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics courses; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97D"
  },
  {
    "course_code": "HIST 97E",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in Latin American History",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics courses; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97E"
  },
  {
    "course_code": "HIST 97F",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in Near Eastern History",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics courses; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97F"
  },
  {
    "course_code": "HIST 97G",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in East Asian History",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics courses; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97G"
  },
  {
    "course_code": "HIST 97I",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in History of Science/Technology",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics courses; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97I"
  },
  {
    "course_code": "HIST 97J",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in African History",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics courses; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97J"
  },
  {
    "course_code": "HIST 97K",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in History of Religion",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics courses; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97K"
  },
  {
    "course_code": "HIST 97L",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in Jewish History",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics courses; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97L"
  },
  {
    "course_code": "HIST 97M",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in Southeast Asian History",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics courses; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97M"
  },
  {
    "course_code": "HIST 97N",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in Indian History",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics courses; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97N"
  },
  {
    "course_code": "HIST 97O",
    "units": 4,
    "title": "Introduction to Historical Practice: Variable Topics in World History",
    "description": "Seminar, three hours. Discussion classes of no more than 15 students. Introduction to study of history, with emphasis on historical theory and research methods. Variable topics courses; consult Schedule of Classes for topics to be offered in specific term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST97O"
  },
  {
    "course_code": "HIST 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST99"
  },
  {
    "course_code": "HIST 100",
    "units": 4,
    "title": "History and Historians",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Study of historiography, including intellectual processes by which history is written, results of these processes, and sources and development of history. Attention also to representative historians. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST100"
  },
  {
    "course_code": "HIST 101",
    "units": 4,
    "title": "Topics in World History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of specific historical themes from world historical perspective. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST101"
  },
  {
    "course_code": "HIST C101A",
    "units": 4,
    "title": "Variable Topics: Interdisciplinary Studies",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Course C101A is not requisite to C101B. Designed for juniors/seniors. Topics may include gender, world history, masculinity, and economic history. May be repeated for credit with topic change. Concurrently scheduled with course C208A. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC101A"
  },
  {
    "course_code": "HIST C101B",
    "units": 4,
    "title": "Variable Topics: Interdisciplinary Studies",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Course C101A is not requisite to C101B. Designed for juniors/seniors. Topics may include gender, world history, masculinity, and economic history. May be repeated for credit with topic change. Concurrently scheduled with course C208B. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC101B"
  },
  {
    "course_code": "HIST 102A",
    "units": 4,
    "title": "Iran and Persianate World",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Development of model of Persianate world to bring together histories of Iran, India, and central Asia (including Afghanistan) between circa 1200 and 2000. Movement and interaction of different peoples between major cultural centers where Persian was used as common language of intellectual, religious, social, and political exchange. Weekly focus on one particular theme, with lecture material supplemented by translations of writings of princes, poets, tribesmen, travelers, and mystics who created Persian republic of letters between Shiraz, Samarqand, and Delhi, and even as far as Siberia and China. Examination of why and how various ethnic and professional groups made Persian into one of most important languages in world history. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST102A"
  },
  {
    "course_code": "HIST M103A",
    "units": 4,
    "title": "History of Ancient Egypt",
    "description": "(Same as Ancient Near East M103A.) Lecture, three hours; discussion, one hour (when scheduled). Course M103A is not requisite to M103B. Designed for juniors/seniors. Political and cultural institutions of ancient Egypt and ideas on which they were based. Chronological discussion of Prehistory, Old and Middle Kingdom. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M103A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM103A"
  },
  {
    "course_code": "HIST M103B",
    "units": 4,
    "title": "History of Ancient Egypt",
    "description": "(Same as Ancient Near East M103B.) Lecture, three hours; discussion, one hour (when scheduled). Course M103A is not requisite to M103B. Designed for juniors/seniors. Political and cultural institutions of ancient Egypt and ideas on which they were based. New Kingdom and Late period until 332 BC. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M103B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM103B"
  },
  {
    "course_code": "HIST M104A",
    "units": 4,
    "title": "History of Ancient Mesopotamia and Syria",
    "description": "(Same as Ancient Near East M104A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Political and cultural development of Fertile Crescent, including Palestine, from Late Uruk to neo-Babylonian period. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M104A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM104A"
  },
  {
    "course_code": "HIST M104B",
    "units": 4,
    "title": "Sumerians",
    "description": "(Same as Ancient Near East M104B.) Lecture, three hours. Designed for juniors/seniors. Overview of Sumer and related cultures of Greater Mesopotamia in 4th and 3rd millennia BCE, with focus on rich cultural history of region and integration of archaeological, art historical, and written records. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M104B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM104B"
  },
  {
    "course_code": "HIST M104C",
    "units": 4,
    "title": "Babylonians",
    "description": "(Same as Ancient Near East M104C.) Lecture, three hours. Designed for juniors/seniors. Overview of Babylonia and cultural history of region from late 3rd millennium BCE to invasion of Cyrus in 539 BCE, with focus on history and archaeology of region, urban structure, literature, and legal practices. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M104C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM104C"
  },
  {
    "course_code": "HIST M104D",
    "units": 4,
    "title": "Assyrians",
    "description": "(Same as Ancient Near East M104D.) Lecture, three hours. Designed for juniors/seniors. Overview of Assyrian cultural history from its origins to end of Neo-Assyrian period (circa 612 BCE), with focus on rise, mechanics, and decline of Neo-Assyrian Empire, which at its peak ruled ancient Near East from Zagros to Egypt. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M104D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM104D"
  },
  {
    "course_code": "HIST 105A",
    "units": 4,
    "title": "Survey of Middle East, 500 to Present: 500 to 1300",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Background and circumstances of rise of Islam, creation of Islamic Empire, and its development. Rise of Dynastic Successor States and Modern Nation States. Social, intellectual, political, and economic development. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST105A"
  },
  {
    "course_code": "HIST 105B",
    "units": 4,
    "title": "Survey of Middle East, 500 to Present: 1300 to 1700",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Background and circumstances of rise of Islam, creation of Islamic Empire, and its development. Rise of Dynastic Successor States and Modern Nation States. Social, intellectual, political, and economic development. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST105B"
  },
  {
    "course_code": "HIST 105C",
    "units": 4,
    "title": "Survey of Middle East, 500 to Present: 1700 to Present",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Background and circumstances of rise of Islam, creation of Islamic Empire, and its development. Rise of Dynastic Successor States and Modern Nation States. Social, intellectual, political, and economic development. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST105C"
  },
  {
    "course_code": "HIST M106",
    "units": 4,
    "title": "Premodern Islam",
    "description": "(Same as Religion M106A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of early development of Islam with special attention to doctrine of nature of God, human responsibility, guidance, revelation and religious authority, duties of believers, ritual, law, sectarian movements, mysticism, and popular religion. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M106A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM106"
  },
  {
    "course_code": "HIST 107A",
    "units": 4,
    "title": "Armenian History: Armenia in Ancient and Medieval Times, 2nd Millennium BC to AD 11th Century",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST107A"
  },
  {
    "course_code": "HIST 107B",
    "units": 4,
    "title": "Armenian History: Armenia from Cilician Kingdom through Periods of Foreign Domination and National Stirrings, 11th to 19th Centuries",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST107B"
  },
  {
    "course_code": "HIST 107C",
    "units": 4,
    "title": "Armenian History: Armenia in Modern and Contemporary Times, 19th and 20th Centuries",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Armenian question and genocide, national republic, Soviet Armenia, and dispersion. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST107C"
  },
  {
    "course_code": "HIST 107D",
    "units": 4,
    "title": "Introduction to Armenian Oral History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Uses and techniques of Armenian oral history; preinterview, interview, and postinterview procedures; methods of compilation and evaluation. Field assignments, interviews, and summaries and/or paper based on interviews. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST107D"
  },
  {
    "course_code": "HIST 107E",
    "units": 4,
    "title": "Caucasus under Russian and Soviet Rule",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of political, economic, social, and cultural history of Caucasus region since 1801. Georgian, Armenian, and Azerbaijani response to Russian and Soviet rule; nationality question and Soviet national republics. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST107E"
  },
  {
    "course_code": "HIST 108A",
    "units": 4,
    "title": "History of North Africa from Islamic Conquest",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of political, social, economic, and religious history of Islamic West (Maghrib) from Muslim conquest in 7th and 8th centuries CE until 1578. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST108A"
  },
  {
    "course_code": "HIST 108B",
    "units": 4,
    "title": "History of Islamic Iberia",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of political, social, economic, religious, artistic, and literary history of Islamic culture in Western Europe. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST108B"
  },
  {
    "course_code": "HIST M108C",
    "units": 4,
    "title": "Culture Area of Maghrib (North Africa)",
    "description": "(Same as Anthropology M166Q and Arabic M171.) Lecture, three hours. Designed for juniors/seniors. Introduction to North Africa, especially Morocco, Algeria, Tunisia, and Libya, also known as Maghrib or Tamazgha. Topics include changing notions of personal, tribal, ethnic, linguistic and religious identities; colonialism; gender and legal rights, changing representations of Islam, and religions in region’s public spaces. P/NP or letter grading.",
    "cross_listed": [
      "ANTHRO M166Q",
      "ARABIC M171"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM108C"
  },
  {
    "course_code": "HIST 109B",
    "units": 4,
    "title": "History of Israeli-Palestinian Conflict, 1881 to Present",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of origins of Arab-Israeli dispute from mid-19th century through founding of state of Israel and expulsion/flight of three quarters of million Palestinians from their homes. Exploration of social history of Palestine up to Zionist colonization, origins of Zionism and Palestinian nationalism, varieties of Zionism, Zionism and colonialism, seminal events and their consequent symbolic connotations Great Revolt and 1948 nakba (disaster), construction of national consensus in Israel, 1967 and its aftermath, intifada, and redefinition of conflict as result of Oslo. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST109B"
  },
  {
    "course_code": "HIST M110A",
    "units": 4,
    "title": "Iranian Civilization: History of Achaemenid Empire",
    "description": "(Same as Ancient Near East M110A and Iranian M110A.) Lecture, three hours; discussion, one hour (when scheduled). From end of Elam and rise of Medes to Macedonian conquest of Achaemenid Persia. Emphasis on political history, state structure, empire’s religions, and Greco-Persian interactions. Further accents on Cyrus’ empire and Darius’ world order, age of Persian Wars, Cyrus the Younger, Achaemenid Egypt, Alexander’s conquest. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M110A",
      "IRANIAN M110A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM110A"
  },
  {
    "course_code": "HIST M110B",
    "units": 4,
    "title": "Iranian Civilization: History of Arsacid (Parthian) Empire",
    "description": "(Same as Ancient Near East M110B and Iranian M110B.) Lecture, three hours; discussion, one hour (when scheduled). From Hellenistic rule in Persia to Sasanian conquest. Emphasis on political history, state structure, empire’s religions, interactions with Hellenistic and Roman worlds. Further accent on Parthian conquest of Iran and Mesopotamia, Seleucid demise and Arsacid hegemony in East, Arsacid-Roman wars, rise of Sasanians. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M110B",
      "IRANIAN M110B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM110B"
  },
  {
    "course_code": "HIST M110C",
    "units": 4,
    "title": "Iranian Civilization: History of Early Sasanian Empire—From Ardashir I to Rise of Peroz (circa 224-459 CE)",
    "description": "(Same as Ancient Near East M110C and Iranian M110C.) Lecture, three hours; discussion, one hour (when scheduled). From fall of Arsacids to Muslim conquest of Iran. Emphasis on political and economic history, evolution of state structure, empire’s religious landscape (Mazdism, Manicheism, Exilarchate, Church of Persia, Mazdakism), Persian and Roman/Byzantine interactions, Persia and East. Further accent on Persian-Roman conflicts and cooperation, Persia and Huns. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M110C",
      "AN N EA 224",
      "IRANIAN M110C",
      "IRANIAN 224"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM110C"
  },
  {
    "course_code": "HIST 111A",
    "units": 4,
    "title": "Topics in Middle Eastern History: Premodern",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of major issues in history of Middle East. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST111A"
  },
  {
    "course_code": "HIST 111B",
    "units": 4,
    "title": "Topics in Middle Eastern History: Early Modern",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of Istanbul in Ottoman period (1453 to 1923); relationship between history and literary imagination and view of history as dialogue between past and present; scholarly debate on urban history of early-modern Middle East; introduction to corpus of theories (world economy paradigm) through discussion of Ottoman port cities. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST111B"
  },
  {
    "course_code": "HIST 111C",
    "units": 4,
    "title": "Topics in Middle Eastern History: Modern",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Middle East underwent widespread social, economic, and cultural changes during 19th century that propelled society, at least portions of society and aspects of its social/cultural life, in entirely new direction. Examination of those changes to understand exactly what modernity meant for region. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST111C"
  },
  {
    "course_code": "HIST 112A",
    "units": 4,
    "title": "History of Ancient Mediterranean World",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of history of ancient East from earliest times to foundation of Persian Empire. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST112A"
  },
  {
    "course_code": "HIST 112B",
    "units": 4,
    "title": "History of Ancient Mediterranean World",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History and institutions of Greeks from their arrival to death of Alexander. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST112B"
  },
  {
    "course_code": "HIST 112BD",
    "units": 4,
    "title": "History of Ancient Mediterranean World: Greece",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of history of ancient Greek world from circa 2,000 to 300 BC and its legacy in modern times. Study of Minoan civilization on Crete and Mycenaean Greeks of mainland, through Dark Age, development of Greek city-states, achievements of Athens and Sparta in Archaic and Classical periods, and death of Alexander the Great of Macedon and emergence of Hellenistic Age. Exploration of legacy of ancient Greek civilization in later Greek history, and Roman, Byzantine, Turkish, and modern periods. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST112BD"
  },
  {
    "course_code": "HIST M112C",
    "units": 4,
    "title": "History of Ancient Mediterranean World",
    "description": "(Same as Classics M114A.) Lecture, five hours. Intensive on-site study of history and culture of ancient Rome from founding of city to conversion of Christianity. Part of UCLA Summer Travel Program. P/NP or letter grading.",
    "cross_listed": [
      "CLASSIC M114A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM112C"
  },
  {
    "course_code": "HIST 112D",
    "units": 4,
    "title": "History and Monuments of Ancient Greece: Field Studies",
    "description": "Fieldwork, three hours. Enforced corequisite: course 112B. Examination of history, art, and monuments of ancient Greece through daily lectures and field walks to museums and archaeological sites. Part of UCLA Summer Travel Program. P/NP or letter grading.",
    "prerequisites": [
      "HIST 112B"
    ],
    "corequisites": [
      "HIST 112B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST112D"
  },
  {
    "course_code": "HIST M112E",
    "units": 4,
    "title": "History and Monuments of Rome: Field Studies",
    "description": "(Same as Classics M114B.) Fieldwork, five hours. Enforced corequisite: course M112C. Examination of history, art, and monuments of ancient Rome through daily lectures and field walks to museums and archaeological sites. Field trips outside Rome to Pompeii, Hadrian’s Villa, and ancient Ostia. Reception and ruins of Roman antiquity in medieval, Renaissance, and modern eras explored in their historical context. Part of UCLA Summer Travel Program. P/NP or letter grading.",
    "prerequisites": [
      "HIST M112C"
    ],
    "corequisites": [
      "HIST M112C"
    ],
    "cross_listed": [
      "CLASSIC M114B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM112E"
  },
  {
    "course_code": "HIST 113A",
    "units": 4,
    "title": "History of Ancient Greece: Rise of Greek City-State",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Emphasis on archaic period and early classical age through Persian Wars. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST113A"
  },
  {
    "course_code": "HIST 113B",
    "units": 4,
    "title": "History of Ancient Greece: Classical Period",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Clash between Athens and Sparta, consequent rise of Macedonia, and aftermath of Alexander the Great. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST113B"
  },
  {
    "course_code": "HIST M113C",
    "units": 4,
    "title": "Ancient Historiography: Theory and Practice",
    "description": "(Same as Classics M133.) Lecture, three hours. Study of theory, practice, and development of writing history in cultures of ancient Greece and Rome. Focus is literary, centered on questions of genre and rhetoric. Encourages appreciation for how ancient historiography relates to other ancient genres (epic, biography, oratory). Readings may draw widely from various authors, including Herodotus, Thucydides, Livy, Tacitus, and others. P/NP or letter grading.",
    "cross_listed": [
      "CLASSIC M133"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM113C"
  },
  {
    "course_code": "HIST 114A",
    "units": 4,
    "title": "History of Rome to Death of Caesar",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Emphasis on development of imperialism and on constitutional and social struggles of late republic. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST114A"
  },
  {
    "course_code": "HIST 114B",
    "units": 4,
    "title": "History of Rome from Death of Caesar to Time of Constantine",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Early empire treated in more detail, supplemented by survey of social and economic changes in 3rd century. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST114B"
  },
  {
    "course_code": "HIST 114C",
    "units": 4,
    "title": "History of Rome: Transformation of Classical World",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Political, cultural, and religious history of Mediterranean in late antiquity, from crisis of Roman Empire in 3rd century to barbarian and Arab invasions and beginning of medieval states and societies in 7th century. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST114C"
  },
  {
    "course_code": "HIST 115",
    "units": 4,
    "title": "Topics in Ancient History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Introduction to topics in Greek and Roman history, including Roman law, ancient Greek and Roman slavery, world of Caesar Augustus, Greek democracy, and Alexander the Great. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST115"
  },
  {
    "course_code": "HIST 116A",
    "units": 4,
    "title": "Byzantine History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Political, socioeconomic, religious, and cultural continuity in millennial history of Byzantium. Reforms of Diocletian. Byzantium’s relations with Latin Europe, Slavs, Sassanids, Arabs, and Turks. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST116A"
  },
  {
    "course_code": "HIST 116B",
    "units": 4,
    "title": "Byzantine History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Political, socioeconomic, religious, and cultural continuity in millennial history of Byzantium. Reforms of Diocletian. Byzantium’s relations with Latin Europe, Slavs, Sassanids, Arabs, and Turks. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST116B"
  },
  {
    "course_code": "HIST M116C",
    "units": 4,
    "title": "Power and Imagination in Byzantium",
    "description": "(Same as Classics M170C.) Lecture, three hours; discussion, one hour (when scheduled). Requisites: courses 116A, 116B. Designed for juniors/seniors. Study of relations of authority and intelligentsia in highly centralized Byzantine Empire. Topics include criticism of emperor, iconoclasm, intellectual freedom, attempts at reform. Letter grading.",
    "prerequisites": [
      "HIST 116A",
      "HIST 116B"
    ],
    "cross_listed": [
      "CLASSIC M170C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM116C"
  },
  {
    "course_code": "HIST 119A",
    "units": 4,
    "title": "Medieval Europe, 400 to 1000",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Basic introduction to Western Europe from Latin antiquity to age of discovery, with emphasis on medieval use of Greco-Roman antiquity, history of manuscript book, and growth of literacy. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST119A"
  },
  {
    "course_code": "HIST 119B",
    "units": 4,
    "title": "Medieval Europe, 1000 to 1500",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Basic introduction to Western Europe from Latin antiquity to age of discovery, with emphasis on medieval use of Greco-Roman antiquity, history of manuscript book, and growth of literacy. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST119B"
  },
  {
    "course_code": "HIST 119C",
    "units": 4,
    "title": "Medieval Civilization: Mediterranean Heartlands",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of Western Mediterranean Europe, social/economic/cultural within political framework, including its relation with other cultures. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST119C"
  },
  {
    "course_code": "HIST 119D",
    "units": 4,
    "title": "Topics in Medieval History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Special topics in history of Middle Ages, including religion in society, justice and law, politics of war and diplomacy, economic upheaval and renewal, and cultural representations. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST119D"
  },
  {
    "course_code": "HIST 120A",
    "units": 4,
    "title": "East-Central Europe: Long 19th Century, 1780 to 1914",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Analysis of characteristics of peripheral 19th-century capitalism, effort to modernize and catch up, and factors and consequences of its partial failure in economy, politics, and culture. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST120A"
  },
  {
    "course_code": "HIST 120B",
    "units": 4,
    "title": "East-Central Europe: Short 20th Century, 1918 to 1990",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Analysis and interpretation of stormy history of crisis zone of Europe where wars, revolts and revolutions, and different types of extremisms led to historical detour: 70 years of departure from Western values and at last effort to turn back to them. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST120B"
  },
  {
    "course_code": "HIST 120C",
    "units": 4,
    "title": "East-Central Europe in Transition, 1988 to 1993",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. State-socialism and Soviet domination collapsed in East-Central Europe in 1989. Analysis of cause and consequence of collapse, as well as road of transformation in seven (now 12) countries of region; international circumstances and domestic political, social, and economic processes. Ideology of transition versus reality of democratization, marketization, and privatization; free choice versus determinant factors. Scenarios for future. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST120C"
  },
  {
    "course_code": "HIST 120D",
    "units": 4,
    "title": "Film and History: Central and Eastern Europe, 1945 to 1989",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Postwar history of central and eastern Europe (1945 to 1989), using eight Czech, Polish, and Hungarian films to explore life under state socialist modernization dictatorship. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST120D"
  },
  {
    "course_code": "HIST 121A",
    "units": 4,
    "title": "History of Modern Europe: Renaissance and Reformation, 1450 to 1660",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Reorganization of power, new forms of representation, and discourses about rule and obedience in Europe from mid-15th through 16th century; popular culture; peasant society; refashioning of religion and power; localization. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST121A"
  },
  {
    "course_code": "HIST 121B",
    "units": 4,
    "title": "History of Modern Europe: Baroque Culture and Absolutist Politics, 1600 to 1715",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Changing nature of state and social domination; redeployment of military violence; strategies of population discipline; absolutism and baroque culture; new forms of bureaucratic intervention; representation of family, sexuality, and body; witch persecutions. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST121B"
  },
  {
    "course_code": "HIST 121C",
    "units": 4,
    "title": "History of Modern Europe: Old Regime and Revolutionary Era, 1715 to 1815",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Enlightened absolutism and reform, challenge of new political and economic ideas, crisis of Old Regime, impact of French Revolution and Napoleonic empire. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST121C"
  },
  {
    "course_code": "HIST 121D",
    "units": 4,
    "title": "History of Modern Europe: Bourgeois Century, 1815 to 1914",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Restoration politics, Industrial Revolution, uprisings of 1848, unification of Germany and Italy, imperialism, rise of socialism, population growth, changes in social structure, origins of World War I. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST121D"
  },
  {
    "course_code": "HIST 121E",
    "units": 4,
    "title": "History of Modern Europe: Era of Total War, 1914 to 1945",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. World War I, interwar period, and World War II. Social, cultural, political, and economic aspects, with focus on strain between model of parliamentary democracy and dynamics of mass politics (e.g., Bolshevik Revolution, Italian Fascism, national socialism, and Spanish Civil War). P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST121E"
  },
  {
    "course_code": "HIST 121F",
    "units": 4,
    "title": "History of Modern Europe: World War II and Its Aftermath, 1939 to Present",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. World War II, origins and persistence of Cold War, reconstruction in West, de-Stalinization, decolonization, crisis of welfare state, background to and course of 1989 revolutions, current political configuration. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST121F"
  },
  {
    "course_code": "HIST 122A",
    "units": 4,
    "title": "Cultural and Intellectual History of Modern Europe, 15th Century",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Climates of taste and climates of opinion. Educational, moral, and religious attitudes; art, thought, and manners of time in historical context. Renaissance cultural and intellectual history of Europe. Central themes include comparative history of ideas, theory and practice of art and architecture, civic and religious humanism, religious experience, and new cultural genres of history and philological scholarship. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST122A"
  },
  {
    "course_code": "HIST 122B",
    "units": 4,
    "title": "Cultural and Intellectual History of Modern Europe, 16th Century",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Climates of taste and climates of opinion. Educational, moral, and religious attitudes; art, thought, and manners of time in historical context. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST122B"
  },
  {
    "course_code": "HIST 122C",
    "units": 4,
    "title": "Cultural and Intellectual History of Modern Europe, 17th Century",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Climates of taste and climates of opinion. Educational, moral, and religious attitudes; art, thought, and manners of time in historical context. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST122C"
  },
  {
    "course_code": "HIST 122D",
    "units": 4,
    "title": "Cultural and Intellectual History of Modern Europe, 18th Century",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Climates of taste and climates of opinion. Educational, moral, and religious attitudes; art, thought, and manners of time in historical context. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST122D"
  },
  {
    "course_code": "HIST M122E",
    "units": 4,
    "title": "Cultural and Intellectual History of Modern Europe, 19th Century",
    "description": "(Same as Art History M127C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Climates of taste and climates of opinion. Educational, moral, and religious attitudes; art, thought, and manners of time in historical context. P/NP or letter grading.",
    "cross_listed": [
      "ART HIS M127C",
      "Cultural and Intellectual History of Modern Europe, 19"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM122E"
  },
  {
    "course_code": "HIST 122F",
    "units": 4,
    "title": "Cultural and Intellectual History of Modern Europe, 20th Century",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Climates of taste and climates of opinion. Educational, moral, and religious attitudes; art, thought, and manners of time in historical context. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST122F"
  },
  {
    "course_code": "HIST 123A",
    "units": 4,
    "title": "War and Diplomacy in Europe, 1650 to 1815",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of military and diplomatic history, seen in relation to social and economic developments and growth of state. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST123A"
  },
  {
    "course_code": "HIST 123B",
    "units": 4,
    "title": "War and Diplomacy in Europe, 1815 to 1945",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Changing patterns of warfare and diplomatic attempts to contain Great Power rivalries; wars of national unification; imperialism; shifting balance of power and alliances; origins, course, and effects of two World Wars. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST123B"
  },
  {
    "course_code": "HIST 123C",
    "units": 4,
    "title": "War and Diplomacy in Europe, Cold War",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Relations of West, Soviet Union, and world from 1945 to 1991. Origins, development, and end of power-political, military, and ideological confrontations between superpowers and their allies and clients in Europe, Asia, and Latin America. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST123C"
  },
  {
    "course_code": "HIST 124A",
    "units": 4,
    "title": "History of France: France, 1500 to 1715",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Social history of 16th- and 17th-century France, including growth of monarchy, wars of religion, peasant uprisings, popular culture, Catholic resurgence, Louis XIV, and achievements in arts and literature. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST124A"
  },
  {
    "course_code": "HIST 124B",
    "units": 4,
    "title": "History of France: France, 1715 to 1871",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Ancien Régime and time of revolutions. Critical discourse leading to French Revolution, collapse of state, Napoleonic era, reconstruction of society through monarchies and revolutions of 19th century. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST124B"
  },
  {
    "course_code": "HIST 124C",
    "units": 4,
    "title": "History of France: Making of Modern France, 1871 to Present",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. From oligarchy to democratic bureaucracy in two wars and three republics. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST124C"
  },
  {
    "course_code": "HIST 125A",
    "units": 4,
    "title": "Baroque and Enlightenment Germany",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Development of state institutions, culture, and society in Central Europe from end of Thirty Years’ War to end of Napoleonic Wars. Consideration of absolutism as political system, and baroque and Enlightenment cultures as new discourses on power and hierarchy. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST125A"
  },
  {
    "course_code": "HIST 125B",
    "units": 4,
    "title": "Global German History in an Age of Empire, 1770s to 1914",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Introduction to diverse histories of German-speaking lands in central Europe from mid-18th century to First World War. Exploration of great variety of German communities and cultures across Europe and world. Identification of ways in which polycentric networks of German migration, science, travel, and trade helped to shape the age of empire. Examination of implications of Germans’ persistent interconnections with the broader world (including California) for understandings of the modern era. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST125B"
  },
  {
    "course_code": "HIST 125C",
    "units": 4,
    "title": "20th-Century Germany",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Transitions that Germany has faced during this century: two world wars, shift from monarchy to republic to national socialism to divided nation, and finally reunification. Consideration of political, social, economic, and cultural spheres. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST125C"
  },
  {
    "course_code": "HIST 125D",
    "units": 4,
    "title": "History of Low Countries",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of aspects of Dutch (and on occasion Belgian) history from medieval period to period after World War II, with emphasis on political and cultural history. Topics include Middle Ages, Dutch Republic in 17th and 18th centuries, Low Countries from 1830 to 1918, Netherlands and Belgium in context of Europe after 1945. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST125D"
  },
  {
    "course_code": "HIST 126",
    "units": 4,
    "title": "Europe in Age of Revolution, circa 1775 to 1815",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Period from revolt of Thirteen Colonies to French Revolution of 1789, and Napoleonic regime, viewing social and political changes unleashed by these revolutionary movements in comparative and transnational perspective. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST126"
  },
  {
    "course_code": "HIST M127A",
    "units": 4,
    "title": "History of Russia, Origins to Rise of Muscovy",
    "description": "(Same as Russian M118.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Kievan Rus’ and its culture, Appanage principalities and towns; Mongol invasion; unification of Russian state by Muscovy, Autocracy and its Servitors; serfdom. P/NP or letter grading.",
    "cross_listed": [
      "RUSSN M118"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM127A"
  },
  {
    "course_code": "HIST 127B",
    "units": 4,
    "title": "History of Russia: Imperial Russia from Peter the Great to Nicholas II",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Westernization of state and society; centralization at home and expansion abroad; peasant problem; beginnings of industrialization; movements of political and social protest; non-Russian peoples; political reforms and social changes; Revolution of 1905; Russia in World War I; fall of old regime. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST127B"
  },
  {
    "course_code": "HIST 127C",
    "units": 4,
    "title": "History of Russia: Revolutionary Russia and Soviet Union",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Revolutions of 1917, Civil War, consolidation of Bolshevik Regime; succession crisis and ascendancy of Stalin, collectivization and industrialization; foreign policy and World War II; death of Stalin, de-Stalinization, developments since; stagnation or stability? P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST127C"
  },
  {
    "course_code": "HIST 127D",
    "units": 4,
    "title": "History of Russia: Culture and Society in Imperial Russia",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Recommended preparation: course 127B or Russian 90A or 119. Designed for juniors/seniors. Thematic examination of culture and society in Russia during era of state-sponsored Westernization (1689 to 1917). Topics include nobility, peasantry, and village life from serfdom to postemancipation era, urban society, working-class life and thought, women, clergy, religion, popular culture, accommodation, and resistance. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST127D"
  },
  {
    "course_code": "HIST 128A",
    "units": 4,
    "title": "History of Italy, 1350 to 1559",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Most important social, economic, political, and cultural developments in history of Italy during later Middle Ages and Renaissance. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST128A"
  },
  {
    "course_code": "HIST 128B",
    "units": 4,
    "title": "History of Italy, 1559 to 1848",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Counter-Reformation and absolutism, Enlightenment reforms, revolutionary era, and first phase of Risorgimento. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST128B"
  },
  {
    "course_code": "HIST 128C",
    "units": 4,
    "title": "History of Italy, 1848 to Present",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Political, economic, social, diplomatic, and ideological developments. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST128C"
  },
  {
    "course_code": "HIST 129A",
    "units": 4,
    "title": "Social History of Spain and Portugal: Age of Silver in Spain and Portugal, 1479 to 1789",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Development of popular history in Iberian Peninsula. Emphasis on peasants and urban history, gold routes, slave trade, history of women, and development of different types of collective violence. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST129A"
  },
  {
    "course_code": "HIST 129B",
    "units": 4,
    "title": "Social History of Spain and Portugal: Rebellion and Revolution in Modern Spain and Portugal, 1789 to Present",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Spain’s position in Europe and its potentialities for social change discussed through investigations of urban history, agrarian social structure, history of women, problems of slow industrial development, imperialism, anarchism, and labor history. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST129B"
  },
  {
    "course_code": "HIST 130",
    "units": 4,
    "title": "History of European Political Thought",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Introduction to principal themes in history of European political thought from classical antiquity to close of early modern period. Study of outstanding contributions to history of social, political, and moral philosophy in texts of major thinkers such as Plato, Aristotle, Machiavelli, More, Hobbes, Locke, and Rousseau. Reconstruction of broad intellectual and ideological contexts from which their work emerged to help students make sense of works of political philosophy in their relevant historical setting and to know something about Athenian democracy and its critics, Roman republic and its empire, Renaissance, early modern European civil wars, American and French Revolutions, and Enlightenment. Focus on emergence of some crucial concepts during this period—ideas about state, self, rights, sovereignty, liberty, private property, and more—that define way we think about politics and society in modern world. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST130"
  },
  {
    "course_code": "HIST 131A",
    "units": 4,
    "title": "Marxist Theory and History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Course 131A is generally requisite to 131B. Designed for juniors/seniors. Introduction to Marxist philosophy and method; conception of historical stages; competing Marxist analyses of transition from feudalism to capitalist economy via reading Capital; theory of politics and state in relationship to historical interpretation of 19th-century European revolutions; capitalist crises. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST131A"
  },
  {
    "course_code": "HIST 131B",
    "units": 4,
    "title": "Marxist Theory and History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Course 131A is generally requisite to 131B. Designed for juniors/seniors. Introduction to Marxist philosophy and method; conception of historical stages; competing Marxist analyses of transition from feudalism to capitalist economy via reading Capital; theory of politics and state in relationship to historical interpretation of 19th-century European revolutions; capitalist crises. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST131B"
  },
  {
    "course_code": "HIST 132",
    "units": 4,
    "title": "Topics in European History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Integrated introduction to important aspects of European history, with emphasis on specific topic within broad framework. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST132"
  },
  {
    "course_code": "HIST M133A",
    "units": 4,
    "title": "History of Women in Europe, 800 to 1715",
    "description": "(Same as Gender Studies M133A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History of social, political, and cultural roles of women in Western Europe from early Middle Ages to 18th century. P/NP or letter grading.",
    "cross_listed": [
      "GENDER M133A",
      "History of Women in Europe, 800",
      "History of Women in Europe, 1715"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM133A"
  },
  {
    "course_code": "HIST M133B",
    "units": 4,
    "title": "History of Women in Europe, 1715 to Present",
    "description": "(Same as Gender Studies M133B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History of social, political, and cultural roles of women in Western Europe from 18th century to present. P/NP or letter grading.",
    "cross_listed": [
      "GENDER M133B",
      "History of Women in Europe, 1715"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM133B"
  },
  {
    "course_code": "HIST M133C",
    "units": 4,
    "title": "History of Prostitution",
    "description": "(Same as Gender Studies M133C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History of prostitution from ancient times to present. Topics include toleration in medieval Europe, impact of syphilis, birth of courtesan, regulation in 19th-century Europe, white slavery scare, and contemporary global sex trade. Readings include novels, primary sources, and testimony by sex workers. P/NP or letter grading.",
    "cross_listed": [
      "GENDER M133C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM133C"
  },
  {
    "course_code": "HIST 134B",
    "units": 4,
    "title": "Economic History of Europe, 1780 to 1914",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Analysis of emergence of European world economy, first Industrial Revolution, revolutionary changes in technology, demographic patterns, education, transportation, and interrelationship between Western core and European peripheries in process of industrialization. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST134B"
  },
  {
    "course_code": "HIST 134C",
    "units": 4,
    "title": "Economic History of Europe, 20th Century",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Changing European economy after World War I and II and in 1990s; impact of fourth and fifth Industrial Revolutions; Great Depressions of century during 1930s, 1970s, and 1980s; and changing modernization strategies; import-substituting industrialization in peripheries; Soviet modernization dictatorship in East Central Europe and its collapse; integration process of second half of century and rise of European Union; modernization model at end of century. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST134C"
  },
  {
    "course_code": "HIST 135A",
    "units": 4,
    "title": "Europe and World: Exploration and Conquest, 1400 to 1700",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. First phase of European expansion in Americas, Africa, and Eurasia. Analysis of motives and methods of expansion, differing patterns of European settlement, including plantation economy, and development of new commercial networks, including Atlantic slave trade. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST135A"
  },
  {
    "course_code": "HIST 135B",
    "units": 4,
    "title": "Europe and World: Colonialism, Slavery, and Revolution, 1700 to 1870",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Origins and gradual increase of European dominance of world trade, impact of European colonialism in New World, Africa, and Asia, influence of new revolutionary ideals that took shape in wake of Enlightenment of 18th century, and beginnings of industrialization. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST135B"
  },
  {
    "course_code": "HIST 135C",
    "units": 4,
    "title": "Europe and World: Imperialism and Postcolonialism, 1870 to Present",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of major European events and trends and their impact on world in modern period. Interrelationship of European and world history, from partition of Africa to founding of India and Pakistan. Global consequences of Cold War and new place of Europe in world. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST135C"
  },
  {
    "course_code": "HIST 136A",
    "units": 4,
    "title": "History of Britain: Tudor-Stuart Times, 1485 to 1715",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Analysis of British economy, society, and polity, with focus on dynamics of both stability and change. Political, socioeconomic, religious, and cultural history of Britain under Tudors and Stuarts. Topics include Reformation, transformation of economy, establishment of overseas colonies, 17th-century political upheavals and their impact on political and socioeconomic structures. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST136A"
  },
  {
    "course_code": "HIST 136B",
    "units": 4,
    "title": "History of Britain: Making of Modern Britain, 1715 to 1867",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Analysis of British economy, society, and polity, with focus on dynamics of both stability and change. Social, economic, political, and cultural history of Britain from Hanovarian revolution in politics to advent of mass democracy in mid-Victorian era. Themes include social change under pressure of industrialization, emergence of first British Empire, loss of America, shifts in religious and social position. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST136B"
  },
  {
    "course_code": "HIST 136C",
    "units": 4,
    "title": "History of Britain: Modern Britain since 1832",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Analysis of British economy, society, and polity, with focus on dynamics of both stability and change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST136C"
  },
  {
    "course_code": "HIST 137A",
    "units": 4,
    "title": "British Empire since 1783",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Political and economic development of British Empire, including evolution of colonial nationalism, development of commonwealth idea, and changes in British colonial policy. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST137A"
  },
  {
    "course_code": "HIST 137B",
    "units": 4,
    "title": "British Empire since 1783",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Political and economic development of British Empire, including evolution of colonial nationalism, development of commonwealth idea, and changes in British colonial policy. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST137B"
  },
  {
    "course_code": "HIST 138A",
    "units": 4,
    "title": "Colonial America, 1600 to 1763",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of molding of American society in English North America from 1600 to 1763. Emphasis on interaction of three converging cultures: Western European, West African, and American Indian. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST138A"
  },
  {
    "course_code": "HIST 138B",
    "units": 4,
    "title": "Revolutionary America, 1760 to 1800",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Inquiry into origins and consequences of American Revolution, nature of revolutionary process, creation of constitutional national government, and development of capitalist economy. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST138B"
  },
  {
    "course_code": "HIST 138C",
    "units": 4,
    "title": "U.S. History, 1800 to 1850",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Discussion of major social, political, economic, and cultural transformations of first half of 19th century and how these changes helped to drive wedge between North and South. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST138C"
  },
  {
    "course_code": "HIST 139A",
    "units": 4,
    "title": "U.S., Civil War and Reconstruction",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Rise of sectionalism, antislavery crusade; formation of Confederate States; war years; political and social reconstruction. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST139A"
  },
  {
    "course_code": "HIST 139B",
    "units": 4,
    "title": "U.S., 1875 to 1900",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. American political, social, and institutional history in period of great change. Emphasis on altering concepts of role of government and responses to that alteration. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST139B"
  },
  {
    "course_code": "HIST 140A",
    "units": 4,
    "title": "20th-Century U.S. History, 1900 to 1928",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Political, economic, intellectual, and cultural aspects of American democracy. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST140A"
  },
  {
    "course_code": "HIST 140B",
    "units": 4,
    "title": "20th-Century U.S. History, 1929 to 1960",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Political, economic, intellectual, and cultural aspects of American democracy. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST140B"
  },
  {
    "course_code": "HIST 140C",
    "units": 4,
    "title": "20th-Century U.S. History since 1960",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History of political, social, and diplomatic developments that have shaped U.S. since 1960. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST140C"
  },
  {
    "course_code": "HIST 141A",
    "units": 4,
    "title": "American Economic History, 1790 to 1910",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Roles of economic forces, institutions, individuals, and groups in promoting or impeding effective change in American economy from 1790 to 1910. During this period technical skeleton of modern industrial structure was formed. Why and how American economy evolved into dual economy, characterized by center of firms large in size and influence and periphery of smaller firms. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST141A"
  },
  {
    "course_code": "HIST 141B",
    "units": 4,
    "title": "American Economic History, 1910 to Present",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Dynamics of change in dual economy, with focus in greater detail on interrelationships between macro and micro developments in economy and on growing interdependency between U.S. and world economy from 1910 to present. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST141B"
  },
  {
    "course_code": "HIST 142A",
    "units": 4,
    "title": "Intellectual History of U.S.",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Principal ideas about humanity and God, nature and society, that have been at work in American history. Sources of these ideas, their connections with one another, their relationship to American life, and their expression in great documents of American thought. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST142A"
  },
  {
    "course_code": "HIST 142B",
    "units": 4,
    "title": "Intellectual History of U.S.",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Principal ideas about humanity and God, nature and society, that have been at work in American history. Sources of these ideas, their connections with one another, their relationship to American life, and their expression in great documents of American thought. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST142B"
  },
  {
    "course_code": "HIST M142C",
    "units": 4,
    "title": "History of Religion in U.S.",
    "description": "(Same as Religion M142C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Consideration of religious dimension of people’s experience in U.S. Examination of number of religious traditions that have been important in this country, with emphasis on relating developments in religion to other aspects of American culture. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "American History and Institutions"
    ],
    "cross_listed": [
      "RELIGN M142C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM142C"
  },
  {
    "course_code": "HIST 142D",
    "units": 4,
    "title": "American Popular Culture",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Recommended requisites: courses 13B, 13C. Designed for juniors/seniors. Survey of American cultural history since 1865, with emphasis on historical development of urban, consumer-oriented American mass culture that enveloped diverse groups of Americans as producers and consumers. Historical development of American popular culture according to changing set of political, economic, and social circumstances. Evolution of national and global framework for mass circulation of popular cultural expressions, as well as arrival of new technologies that enabled that development. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "HIST 13B",
      "HIST 13C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST142D"
  },
  {
    "course_code": "HIST 143A",
    "units": 4,
    "title": "Constitutional History of U.S.: Origins and Development of Constitutionalism in U.S.",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Particular emphasis on framing of Federal Constitution in 1787 and its subsequent interpretation. Judicial review, significance of Marshall Court, and effects of slavery and Civil War on Constitution. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST143A"
  },
  {
    "course_code": "HIST 143B",
    "units": 4,
    "title": "Constitutional History of U.S.: Constitutionalism since Civil War",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Particular emphasis on development of Supreme Court, due process revolution, Court and political questions, and fact of judicial supremacy within self-prescribed limits. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST143B"
  },
  {
    "course_code": "HIST 144",
    "units": 4,
    "title": "America in World",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Reconsideration of U.S. exceptionalist approach to national self-understanding by rethinking crucial aspects of American history in more international context that goes well beyond foreign relations and international affairs to reconceptualize aspects of American economic, intellectual, cultural, and social history. Consideration of transnational flows of people, ideas, goods, wealth, and politics, as well as comparative studies of all these things and more. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST144"
  },
  {
    "course_code": "HIST M144C",
    "units": 4,
    "title": "Critical Issues in U.S.-Philippine Relations",
    "description": "(Same as Asian American Studies M171D.) Lecture, three hours; discussion, one hour (when scheduled). Recommended preparation: courses 176A, 176B, 176C. Designed for juniors/seniors. Examination of complex interrelationship between U.S. colonialism, Philippine nationalism, history of Filipino Americans, and Philippine diaspora in 20th century. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "cross_listed": [
      "ASIA AM M171D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM144C"
  },
  {
    "course_code": "HIST 145A",
    "units": 4,
    "title": "U.S. Urban History: U.S. Cities—Overview",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Demographic, geographic, political, economic, and social development of U.S. cities in relation to broad trends in U.S. history as well as to their own more special histories. Emphasis on mastery of facts and chronology, and awareness of major theoretical issues and fundamental concepts in urban history. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST145A"
  },
  {
    "course_code": "HIST 145B",
    "units": 4,
    "title": "U.S. Urban History: Topics in U.S. Urban History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exploration of one aspect of U.S. urban history in depth without having to attend to basic chronology or geography. Topics include crime and police, urban economics, and urban government. Students do primary research papers based on local materials in addition to written examinations. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST145B"
  },
  {
    "course_code": "HIST 146A",
    "units": 4,
    "title": "American Working Class Movements",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Major episodes in social, trade union, and cultural history of American working class from Colonial times to present, with emphasis on both organized and unorganized labor, history of Knights of Labor, AFL-CIO, and development of labor politics. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST146A"
  },
  {
    "course_code": "HIST M146B",
    "units": 4,
    "title": "American Working Class Movements",
    "description": "(Formerly numbered 146B.) (Same as Labor Studies M105.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Major episodes in social, trade union, and cultural history of American working class from Colonial times to present, with emphasis on both organized and unorganized labor, history of Knights of Labor, AFL-CIO, and development of labor politics. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "LBR STD M105"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM146B"
  },
  {
    "course_code": "HIST 146C",
    "units": 4,
    "title": "Migrant Nation: How Mobility Shapes American Society, Politics, and Culture",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Thematic and chronological survey of immigration and internal migration, cultures of racial and ethnic stratification, migrant political activism, and policies that govern migration, citizenship, and exclusion in U.S. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST146C"
  },
  {
    "course_code": "HIST 146D",
    "units": 4,
    "title": "U.S. and Comparative Immigration History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Use of overlapping diaspora model that integrates North Atlantic (Europe), South Atlantic (Afro-Caribbean), Pacific (China/Japan/Hawaii), and Latin (Mexico to Brazil) worlds to provide chronological and analytic survey of American and comparative immigration from 1750 to present. Special focus on Southern California. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST146D"
  },
  {
    "course_code": "HIST M147C",
    "units": 4,
    "title": "History of Women in Colonial British America and Early U.S., 1600 to 1860",
    "description": "(Same as Gender Studies M147B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Introduction to major themes in history of early American women from initial confrontation of English and American Indian cultures in early 17th century to rise of women’s rights movement in mid-19th century. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "cross_listed": [
      "GENDER M147B",
      "GENDER 1600",
      "GENDER 1860"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM147C"
  },
  {
    "course_code": "HIST M147D",
    "units": 4,
    "title": "History of Women in U.S., 1860 to 1980",
    "description": "(Same as Gender Studies M147D.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Introduction to major themes in history of American women from abolition of slavery and Civil War to rise and consequences of second-wave feminism. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "cross_listed": [
      "GENDER M147D",
      "GENDER 1860",
      "GENDER 1980"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM147D"
  },
  {
    "course_code": "HIST M147E",
    "units": 4,
    "title": "History of Deaf Communities in America",
    "description": "(Same as American Sign Language M120.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Study of history and culture of deaf communities in America (circa 1800 to present) by exploring major events impacting deaf people, including development of sign language, deaf education, audism, politics of deafness, eugenics, deaf revolution movements, and role of hearing technology. Historical development of emergence, growth, and survival of America’s deaf community and development of deaf identity over time. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture"
    ],
    "cross_listed": [
      "ASL M120"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM147E"
  },
  {
    "course_code": "HIST 148",
    "units": 4,
    "title": "Introduction to Public/Applied History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. General survey of historical definitions of, and debates about, public and applied history, that is, history in non-academic settings across different periods and geographic regions. Survey supplemented with case studies drawn from historical research used to inform museum exhibitions, public policy, historic commemoration, digital projects, and documentary and popular media productions. Through assigned readings, analytical writing, and collaborative research, students engage with variety of approaches, tools, and media. Research on local historical topics to foster well-grounded understanding of how history is applied and interpreted in variety of places, settings, and media for variety of audiences and purposes. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST148"
  },
  {
    "course_code": "HIST 149A",
    "units": 4,
    "title": "North American Indian History, Precontact to 1830",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History of Native Americans from contact to present, with emphasis on historical dimensions of culture change, Indian political processes, and continuity of Native American cultures. Focus on selected Indian peoples in each period. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST149A"
  },
  {
    "course_code": "HIST 149B",
    "units": 4,
    "title": "North American Indian History, 1830 to Present",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History of Native Americans from contact to present, with emphasis on historical dimensions of culture change, Indian political processes, and continuity of Native American cultures. Focus on selected Indian peoples in each period. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST149B"
  },
  {
    "course_code": "HIST M150A",
    "units": 4,
    "title": "Comparative Slavery Systems",
    "description": "(Same as African American Studies M158A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of slavery experiences in various New World slave societies, with emphasis on outlining similarities and differences among legal status, treatment, and slave cultures of North American, Caribbean, and Latin American slave societies. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "cross_listed": [
      "AF AMER M158A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM150A"
  },
  {
    "course_code": "HIST M150B",
    "units": 4,
    "title": "Introduction to Afro-American History",
    "description": "(Same as African American Studies M158B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of Afro-American experience, with emphasis on three great transitions of Afro-American life: transition from Africa to New World slavery, transition from slavery to freedom, and transition from rural to urban milieus. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "AF AMER M158B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM150B"
  },
  {
    "course_code": "HIST M150C",
    "units": 4,
    "title": "Introduction to Afro-American History",
    "description": "(Same as African American Studies M158C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of Afro-American experience, with emphasis on three great transitions of Afro-American life: transition from Africa to New World slavery, transition from slavery to freedom, and transition from rural to urban milieus. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "cross_listed": [
      "AF AMER M158C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM150C"
  },
  {
    "course_code": "HIST M150D",
    "units": 4,
    "title": "Recent African American Urban History: Funk Music and Politics of Black Popular Culture",
    "description": "(Same as African American Studies M150D.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exploration of musical genre known as funk that emerged in its popular form during late 1960s and reached popular high point, in black culture, during 1970s. Funk, fusion of gospel, blues, jazz, rhythm and blues, soul, rock, and many other musical styles, offer students unique window into recent African American history. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "cross_listed": [
      "AF AMER M150D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM150D"
  },
  {
    "course_code": "HIST M150E",
    "units": 4,
    "title": "African American Nationalism in First Half of 20th Century",
    "description": "(Same as African American Studies M158E.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Critical examination of African American search in first half of 20th century for national/group cohesion through collectively built institutions, associations, organized protest movements, and ideological self-definition. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "cross_listed": [
      "AF AMER M158E",
      "African American Nationalism in First Half of 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM150E"
  },
  {
    "course_code": "HIST M151A",
    "units": 4,
    "title": "History of Chicano Peoples",
    "description": "(Same as Chicana/o and Central American Studies M159A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey lecture course on historical development of Mexican (Chicano) community and people of Mexican descent (Indio-Mestizo-Mulato) north of Rio through 17th, 18th, and 19th centuries, with special focus on labor and politics. Provides integrated understanding of change over time in Mexican community by inquiry into major formative historical forces affecting community. Social structure, economy, labor, culture, political organization, conflict, and international relations. Emphasis on social forces, class analysis, social, economic, and labor conflict, ideas, domination, and resistance. Developments related to historical events of significance occurring both in U.S. and Mexico. Lectures, special presentations, reading assignments, written examinations, library and field research, and submission of paper. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "cross_listed": [
      "CCAS M159A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM151A"
  },
  {
    "course_code": "HIST M151B",
    "units": 4,
    "title": "History of Chicano Peoples",
    "description": "(Same as Chicana/o and Central American Studies M159B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey lecture course on historical development of Mexican (Chicano) community and people of Mexican descent in U.S. through 20th century, with special focus on labor and politics. Provides integrated understanding of change over time in Mexican community by inquiry into major formative historical and policy issues affecting community. Within framework of domination and resistance, discussion deals with social structure, economy, labor, culture, political organization, conflict, and ideology. Developments related to historical events of significance occurring both in U.S. and Mexico. Lectures, special presentations, reading assignments, written examinations, library and/or field research, and submission of paper. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "cross_listed": [
      "CCAS M159B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM151B"
  },
  {
    "course_code": "HIST M151C",
    "units": 4,
    "title": "Understanding Whiteness in American History and Culture",
    "description": "(Same as Chicana/o and Central American Studies CM182.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History, construction, and representation of whiteness in American society. Readings and discussions trace evolution of white identity and explore its significance to historical construction of race class in American history. Letter grading.",
    "satisfies": [
      "American History and Institutions",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "CCAS CM182"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM151C"
  },
  {
    "course_code": "HIST M151D",
    "units": 4,
    "title": "Chicana Historiography",
    "description": "(Same as Chicana/o and Central American Studies M158 and Gender Studies M157.) Lecture, four hours. Examination of Chicana historiography, looking closely at how practice of writing of history has placed Chicanas into particular narratives. Using Chicana feminist approaches to study of history, revisiting of specific historical periods and moments such as Spanish Conquest, Mexican Period, American Conquest, Mexican Revolution, and Chicano Movement to excavate untold stories about women’s participation in and contribution to making of Chicana and Chicano history. P/NP or letter grading.",
    "cross_listed": [
      "CCAS M158",
      "GENDER M157"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM151D"
  },
  {
    "course_code": "HIST M151E",
    "units": 4,
    "title": "Latino Metropolis: Architecture and Urbanism in Americas",
    "description": "(Same as Chicana/o and Central American Studies M187 and Urban Planning M187.) Lecture, four hours. Introduction to history of architecture and urbanism in Americas, from fabled cities of Aztec empire to barrios of 21st-century Los Angeles and Miami. Emphasis on role of cities in Latina/Latino experience and uses of architecture and city planning to forge new social identities rooted in historical experiences of conquest, immigration, nationalization, and revolution. P/NP or letter grading.",
    "cross_listed": [
      "URBN PL M187",
      "CCAS M187"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM151E"
  },
  {
    "course_code": "HIST 152",
    "units": 4,
    "title": "Asians in American History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Study of politically troubling question of entry into U.S. of immigrants ineligible for citizenship and their citizen children in American history. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST152"
  },
  {
    "course_code": "HIST 153",
    "units": 4,
    "title": "American West",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Study of West as frontier and as region, in transit from Atlantic seaboard to Pacific, from 17th century to present. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST153"
  },
  {
    "course_code": "HIST 154",
    "units": 4,
    "title": "History of California",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Economic, social, intellectual, and political development of California from earliest times to present. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST154"
  },
  {
    "course_code": "HIST M155",
    "units": 4,
    "title": "History of Los Angeles",
    "description": "(Same as Chicana/o and Central American Studies M183.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Social, economic, cultural, and political development of Los Angeles and its environs from time of its founding to present. Emphasis on diverse peoples of area, changing physical environment, various interpretations of city, and Los Angeles’ place among American urban centers. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "cross_listed": [
      "CCAS M183"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM155"
  },
  {
    "course_code": "HIST 156",
    "units": 4,
    "title": "Topics in U.S. History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of specific historical themes and/or major issues in U.S. history. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST156"
  },
  {
    "course_code": "HIST 157A",
    "units": 4,
    "title": "Early Latin America",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Advanced survey of Latin American history from conquest to independence, with emphasis on society, culture, and ethnic aspects. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST157A"
  },
  {
    "course_code": "HIST 157B",
    "units": 4,
    "title": "Indians of Colonial Mexico",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of social and cultural history of Indians of Mexico, especially central Mexico, from time of European conquest until Mexican independence, with emphasis on internal view of Indian groups and patterns on basis of records produced by Indians themselves. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST157B"
  },
  {
    "course_code": "HIST 159",
    "units": 4,
    "title": "Latin America in 19th Century",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Intensive analysis of economic, social, and political problems of Latin American nations from their independence to around 1910. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST159"
  },
  {
    "course_code": "HIST 160A",
    "units": 4,
    "title": "Latin American Elitelore",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Elitelore (defined as oral or noninstitutionalized knowledge involving leaders’ conceptual and perceptual life history views) in contrast to folklore (followers’ traditional or popular views). Elitelore genres include oral history, literature, and cinema. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST160A"
  },
  {
    "course_code": "HIST 160B",
    "units": 4,
    "title": "Mexican Revolution since 1910",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of concept of permanent crisis to describe and explain structure of permanent revolution under one-party democracy. Analysis of unresolved colonial and 19th-century problems and crises that have influenced modern-day Mexico, if in modified form. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST160B"
  },
  {
    "course_code": "HIST 161",
    "units": 4,
    "title": "Topics in Latin American History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of major issues in history of Latin America. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST161"
  },
  {
    "course_code": "HIST 162A",
    "units": 4,
    "title": "Modern Brazil",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Selected topics in political, economic, social, and cultural development of Brazil, with emphasis on modernization and struggle for change, 1850 to present. Discussions, films, slides, and guest speakers supplement and complement lectures. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST162A"
  },
  {
    "course_code": "HIST 162B",
    "units": 4,
    "title": "Brazil and Atlantic World, 1500 to 1822",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exploration of development of colonial society in Brazil from discovery in 1500 to independence in 1822, placing it in context of Portugal’s overseas expansion in Asia, Africa, and Americas. Emphasis on Portuguese, indigenous, and African roots of modern Brazil. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST162B"
  },
  {
    "course_code": "HIST 162C",
    "units": 4,
    "title": "History of Argentina",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History of economic, political, social, and cultural developments that have shaped Argentina from colonial time to present. Emphasis on 19th-century development of agro-export economy and 20th-century formation of mass society. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST162C"
  },
  {
    "course_code": "HIST 164B",
    "units": 4,
    "title": "Topics in African History: Africa and Slave Trade",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Preparation: one prior course in African history at UCLA. Designed for juniors/seniors. Social, economic, political, and cultural impact of slave trade on African society, with emphasis on Atlantic trade without neglecting those of ancient Mediterranean, Islamic, and Indian Ocean worlds. Abolition and African diaspora. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST164B"
  },
  {
    "course_code": "HIST 164D",
    "units": 4,
    "title": "Topics in African History: Africa and Diaspora in Global and Comparative Perspective",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Preparation: one prior course in African history at UCLA. Designed for juniors/seniors. Forced migration of Africans through overseas slave trade was formative event of modern world. Exploration of that experience and its lasting consequences by placing it in its global context—African, American, European, Islamic, and Asian. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST164D"
  },
  {
    "course_code": "HIST 164E",
    "units": 4,
    "title": "Topics in African History: Africa, 1945 to Present",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Preparation: one prior course in African history at UCLA. Designed for juniors/seniors. History of Africa south of Sahara from end of World War II to present. Last phases of colonial rule in Africa, African nationalism, Pan-Africanism, liberation movements, and achievement of independence. Political, social, and economic change in colonies and in independent states of Africa. Neocolonialism, experiments in national development, apartheid in South Africa, ideological conflict in contemporary Africa, and Africa in world affairs since 1957. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST164E"
  },
  {
    "course_code": "HIST 165",
    "units": 4,
    "title": "Topics in African History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of specific historical themes and/or major issues in African history. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST165"
  },
  {
    "course_code": "HIST 165SL",
    "units": 4,
    "title": "Service Learning and Historical Understanding in South Africa",
    "description": "Fieldwork, six hours. Students participate in two service learning projects in South Africa to help them understand ongoing historical legacy of apartheid in South Africa, differences between urban and rural poverty, and link between rural poverty and urban overcrowding. Students work directly with families and children under guidance of local community organizers. Offered in summer only. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST165SL"
  },
  {
    "course_code": "HIST 166A",
    "units": 4,
    "title": "History of West Africa: West Africa, Earliest Times to 1800",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST166A"
  },
  {
    "course_code": "HIST 166B",
    "units": 4,
    "title": "History of West Africa: West Africa since 1800",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST166B"
  },
  {
    "course_code": "HIST 167A",
    "units": 4,
    "title": "History of Northeast Africa",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of history of Ethiopia, Sudan, and Somalia in regional context of northeast Africa from earliest times to present, with emphasis on economy and society, evolution of state, and significance of Christianity and Islam. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST167A"
  },
  {
    "course_code": "HIST 167B",
    "units": 4,
    "title": "History of East Africa",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of cultural diversity of east Africa from earliest times to growth of complex societies, its place within wider Indian Ocean system, and colonial conquest to gaining of independence and postcolonial challenges. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST167B"
  },
  {
    "course_code": "HIST 167C",
    "units": 4,
    "title": "History of Central Africa",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of history of central Africa from earliest times, with emphasis on establishment of agriculture, growth of trade, rise of states, and incorporation of region into world economy. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST167C"
  },
  {
    "course_code": "HIST 168A",
    "units": 4,
    "title": "History of Southern Africa, Origins to 1870",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Attention to social and economic as well as political aspects. Origins of South African peoples and their interactions to 1870. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST168A"
  },
  {
    "course_code": "HIST 168B",
    "units": 4,
    "title": "History of Southern Africa since 1870",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Attention to social and economic as well as political aspects. Interactions between inhabitants of southern Africa since 1870. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST168B"
  },
  {
    "course_code": "HIST 169A",
    "units": 4,
    "title": "Thought and Society in China to 1000",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Recommended preparation: course 11A. Designed for juniors/seniors. Elite and popular expressions of Chinese cultural life examined in readings and lectures. Focus on diversities of thought in classical legacy and their evolution under impact of Buddhism to 1000. Emphasis on intersections between intellectual life and social, political, and economic conditions. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST169A"
  },
  {
    "course_code": "HIST 169B",
    "units": 4,
    "title": "Thought and Society in China since 1000",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Recommended preparation: course 11B. Designed for juniors/seniors. Elite and popular expressions of Chinese cultural life from 1000 to 20th century. Emphasis on social, political, and economic conditions within which Chinese orthodox and heterodox values evolved and changed. Evaluation of iconoclasm of Chinese intellectual life in 20th century in light of earlier currents of thought. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST169B"
  },
  {
    "course_code": "HIST 170A",
    "units": 4,
    "title": "Culture and Power in Late Imperial China",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Recommended preparation: courses 11A, 11B. Designed for juniors/seniors. Analysis of relations of power and cultural expressions of dominance and resistance in late imperial China (1000 to 1700), with emphasis on interplay of economic forces, ideas, and social and political institutions. Examination of institutions of state, family, school, and city; idioms of folk religion, death, and afterlife; political, legal, and medical discourses of body, personhood, and social identity; love, sexuality, and private life. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST170A"
  },
  {
    "course_code": "HIST 170B",
    "units": 4,
    "title": "Selected Topics in Chinese History from 1500",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Recommended requisite: course 11B. Designed for juniors/seniors. Selected topics that may vary from year to year. Recent offerings include law, society, and culture; society and economy; and rural China. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "prerequisites": [
      "HIST 11B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST170B"
  },
  {
    "course_code": "HIST M170C",
    "units": 4,
    "title": "History of Women in China, AD 1000 to Present",
    "description": "(Same as Gender Studies M170C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Topics include women and family, women in Confucian ideology, women in literati culture, feminist movement, and women and communist revolution. P/NP or letter grading.",
    "cross_listed": [
      "GENDER M170C",
      "History of Women in China, AD 1000"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM170C"
  },
  {
    "course_code": "HIST 170D",
    "units": 4,
    "title": "20th-Century China",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Recommended preparation: course 11B. Designed for juniors/seniors. Political events and intellectual developments seen in context of social-economic trends; human agency, structural change, and historical conjunctures in 20th century. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST170D"
  },
  {
    "course_code": "HIST 170E",
    "units": 4,
    "title": "Economic History of China",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of development of Chinese economy and social, technological, intellectual, and political dynamics that produced distinctive patterns in evolution of China’s economy from antiquity to present day. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST170E"
  },
  {
    "course_code": "HIST 171",
    "units": 4,
    "title": "Variable Topics in Japanese History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Important topics in Japanese history, including political change, economic development, social questions, and popular culture, as well as media and arts, explored through extensive readings. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST171"
  },
  {
    "course_code": "HIST 172A",
    "units": 4,
    "title": "Japan—Ancient and Medieval History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Political, economic, and cultural development of Japan from prehistory to 1600. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST172A"
  },
  {
    "course_code": "HIST 172B",
    "units": 4,
    "title": "Japanese History: Early Modern, 1600 to 1868",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Political, economic, and cultural development of Japan from 1600 to 1868. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST172B"
  },
  {
    "course_code": "HIST 172C",
    "units": 4,
    "title": "Modern Japanese History, 1850 to 1945",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Investigation of meaning of modern “Japan” for newly national (and imperial) populace, and resistance to consequent radical upheavals in daily experience, both in Japan and Asia. Exploration of meaning of “modern” and fraught interplay of imperial and anticolonial ambitions in domestic and foreign politics. World War II experience and radical and conservative effects of Allied Occupation. Foregrounding of professional practice of history and historical creation of categories, practices, and perspectives that have become second nature (i.e., linear time, nation, and modern social norms). Topics also include gender, sexuality, aesthetics, fascism, eugenics and race, hygiene, bloodsucking, monsters, anarchism, time, colonialism, feminism, art, censorship, protest, and Cold War. Socratic-style discussion in lecture. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST172C"
  },
  {
    "course_code": "HIST 173A",
    "units": 4,
    "title": "Japanese Popular Culture",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Topics in 18th-, 19th-, and 20th-century Japanese history, including legacy of premodern satire in postmodern comic books, American culture in 1930s’ Japanese visual culture, gender in photography, and relationship of monster movies to postwar politics. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST173A"
  },
  {
    "course_code": "HIST M173B",
    "units": 4,
    "title": "Women in 20th-Century Japan",
    "description": "(Same as Gender Studies M173B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Japanese women in Japanese and world history through state documents, autobiographical voices, contemporary television, and other varying historical sources, including topics such as women and new political order (1900 to 1930), women, war, and empire (1930 to 1945), and women in consumer society (1980s to 1990s). P/NP or letter grading.",
    "cross_listed": [
      "GENDER M173B",
      "Women in 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM173B"
  },
  {
    "course_code": "HIST M173C",
    "units": 4,
    "title": "Shinto, Buddhism, and Japanese Folk Religion",
    "description": "(Same as Religion M173C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Social dimension of various Ways, great and little: Shinto’s connection with cultural nationalism, Buddhism’s medieval Reformation and Zen’s relation to warrior culture, folk religious aspects such as shamanism, ancestor worship, and millenarianism. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M173C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM173C"
  },
  {
    "course_code": "HIST 173D",
    "units": 4,
    "title": "Postwar Japanese History through Film",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exploration of postwar Japanese history through medium of film and film criticism. Much of postwar Japanese cinema can be seen as reflecting on and questioning place of Japan in world reshaped by catastrophic war and its lingering specter. Through screenings and critical discussion of select films spanning half-century following World War II, consideration of cultural, aesthetic, and sociopolitical significance of postwar as demarcated category in Japan. Reflection on ways in which filmic presentations of state of being postwar engaged with lived history, memory, and present time. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST173D"
  },
  {
    "course_code": "HIST 174A",
    "units": 4,
    "title": "Early History of India",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Introduction to civilization and institutions of India. Survey of history and culture of South Asian subcontinent from earliest times to founding of Mughal Empire. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST174A"
  },
  {
    "course_code": "HIST 174B",
    "units": 4,
    "title": "History of British India I",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of expansion of British rule, theories and practice of governance, constitution of India as oriental despotism, epistemological projects of state, and other modes by which British achieved conquest of knowledge. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST174B"
  },
  {
    "course_code": "HIST 174C",
    "units": 4,
    "title": "Contemporary South Asia",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Political economy of imperialism and Britain’s civilizing mission. Encounter, especially in terms of race and gender, between colonized and colonizers and to questions of resistance and nationalism. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST174C"
  },
  {
    "course_code": "HIST M174D",
    "units": 4,
    "title": "Indo-Islamic Interactions, 700 to 1750",
    "description": "(Same as Religion M174D.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Historical introduction to Muslim communities of what eventually became nations of India, Pakistan, and Bangladesh. Topics include social, political, religious, and cultural history. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M174D",
      "Islamic Interactions, 700",
      "Islamic Interactions, 1750"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM174D"
  },
  {
    "course_code": "HIST M174E",
    "units": 4,
    "title": "Indo-Islamic Interactions, 1750 to 1950",
    "description": "(Same as Religion M174E.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of interplay of factors that, from Christian missionaries to Islamic madrasa schools and colonial rebellions, gave shape to multifaceted Muslim reformation in context of colonial modernity. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M174E",
      "Islamic Interactions, 1750",
      "Islamic Interactions, 1950"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM174E"
  },
  {
    "course_code": "HIST 174F",
    "units": 4,
    "title": "Gandhi and Making of Modern India",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of life and ideas of Mahatma Gandhi, known world over as prophet of nonviolence and principal architect of Indian independence movement. Gandhi was also spiritual thinker, social reformer, critic of Western modernity, interpreter of Indian civilization, staunch supporter of Indian syncreticism, voluminous writer, and forerunner, not only in India, but of many great social and ecological movements of our times. Focus on Gandhi’s idea of satyagraha, resistance to oppression through truth (satya) and nonviolence (ahimsa), and his nonviolent campaigns against colonial rule, before moving to broader assessments of his life and thought, his critiques of modernity and industrial civilization, and his relationship to Indian nationalism. Discussion of feminist, Dalit (low-caste), Marxist, and modernist critiques of his ideas, and reflections on his place in modern India and global circulation of his ideas over last six decades. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST174F"
  },
  {
    "course_code": "HIST M174G",
    "units": 4,
    "title": "Indian Identity in U.S. and Diaspora",
    "description": "(Same as Asian American Studies M172A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History of overseas Indian communities; transformations of Hinduism in diaspora; emergence of new diasporic art forms such as bhangra rap and chutney music; relations between Indians and other racial and ethnic groups; Indian women as embodiment of Indian culture; diasporic identities. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "ASIA AM M172A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM174G"
  },
  {
    "course_code": "HIST 175A",
    "units": 4,
    "title": "Cultural and Political History of Contemporary South Asia",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Problem of modernity; partition of India and emergence of Pakistan; political, social, ecological, and women’s movements; struggle for rights and conflicts of identity among Muslims, Hindus, and Sikhs; terrorism in Sri Lanka and Punjab; public culture, popular cinema, and street life. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST175A"
  },
  {
    "course_code": "HIST 175C",
    "units": 4,
    "title": "Special Topics in Contemporary Indian History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Treatment of major issues in history of contemporary India. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST175C"
  },
  {
    "course_code": "HIST 176A",
    "units": 4,
    "title": "History of Southeast Asia to 1815",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Political and cultural history of peoples of Southeast Asia from earliest times to about 1815. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST176A"
  },
  {
    "course_code": "HIST 176B",
    "units": 4,
    "title": "History of Southeast Asia: Southeast Asia since 1815",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History of modern Southeast Asia, with emphasis on expansion of European influence in political and economic spheres, growth of nationalism, and process of decolonization. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST176B"
  },
  {
    "course_code": "HIST 176C",
    "units": 4,
    "title": "Philippine History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Social, cultural, and political history of Philippine societies from Spanish conquest through independence. Emphasis on questions of identity under colonialism, understanding Revolutions of 1896 and 1898, and politics of Philippine nationalist discourse. Readings include introduction to major issues in Philippine historiography and literature. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST176C"
  },
  {
    "course_code": "HIST 176E",
    "units": 4,
    "title": "Vietnam: Past and Present",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of history and culture of Vietnam from about 700 BC to present, including political, social, and economic developments as well as international relations in post-1954 period. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST176E"
  },
  {
    "course_code": "HIST 177A",
    "units": 4,
    "title": "National Histories of Southeast Asia",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Variable topics with focus on history of one or more of Southeast Asia’s nation-states: Indonesia, East Timor, Thailand, Cambodia, Burma, Laos, Malaysia, Singapore, Brunei, Philippines, Vietnam. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST177A"
  },
  {
    "course_code": "HIST 177B",
    "units": 4,
    "title": "Comparative Histories of Southeast Asia",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Variable topics with focus on history of Southeast Asia from thematic or comparative perspective. Topics may include history of human rights in Southeast Asia, gender and sexuality in island Southeast Asia, and economic history of Southeast Asia. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST177B"
  },
  {
    "course_code": "HIST M178",
    "units": 4,
    "title": "Introduction to History and Culture of Iranian Jews",
    "description": "(Same as Iranian M178 and Jewish Studies M178.) Lecture, three hours. Introduction to political, intellectual, cultural, and socioeconomic status of Iranian Jews. Exploration of history of Iranian Jews from ancient period throughout history, with focus on post-Middle Ages to present time. Topics, studied from perspective of Iranian cultural and intellectual history, include identity and status, religious tolerance versus forced conversion, Iranian Jewish emancipation, and dynamic symbiosis between Iranian Jews and other Iranians. P/NP or letter grading.",
    "cross_listed": [
      "IRANIAN M178",
      "JEWISH M178"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM178"
  },
  {
    "course_code": "HIST 179A",
    "units": 4,
    "title": "Variable Topics in History of Medicine",
    "description": "Lecture, three hours. Designed for juniors/seniors. Topics may include global health, biomedical technologies, gender and medicine, Chinese medicine, psychiatry and mental illness, medicine and empire, epidemics and infectious disease. May be repeated for maximum of 16 units with topic/instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST179A"
  },
  {
    "course_code": "HIST 179B",
    "units": 4,
    "title": "History of Medicine: Foundations of Modern Medicine",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Cultural, scientific, and social context that shaped modern medicine from Renaissance to Romantic era. Topics include establishment of anatomy, physiology, and modern clinical medicine, mapping of human body, medical approach to mental illness, rise of anatomo-clinical method at Paris School. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST179B"
  },
  {
    "course_code": "HIST 179C",
    "units": 4,
    "title": "Medicine and Society in 20th-Century America",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Sociohistorical look at changes in medical science, health and disease, and treatment practices in 20th century within context of development of hospitals and research institutions and of changing American society. Particular topics include antibodies and other wonder drugs, cancer research and treatment, mental illness, patient activism, and genetic medicine. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST179C"
  },
  {
    "course_code": "HIST 180A",
    "units": 4,
    "title": "Topics in History of Science",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Topics may include science and colonialism, science and religion, environmental history, science in Enlightenment, development of theory of evolution, science and public policy, public nature of science. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST180A"
  },
  {
    "course_code": "HIST M180B",
    "units": 4,
    "title": "Historical Perspectives on Gender and Science",
    "description": "(Same as Gender Studies M180B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Historical cases illustrating how gender enters practices and concepts of science. Topics include gendered conceptions of nature, persona of man of science, role of women in scientific revolution, scientific investigations of women and feminine. P/NP or letter grading.",
    "cross_listed": [
      "GENDER M180B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM180B"
  },
  {
    "course_code": "HIST 180C",
    "units": 4,
    "title": "Science and Technology in 20th Century",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Development of science and technology and their impact on society. Industrialization, global scientific community, social Darwinism, atomic bomb and nuclear proliferation, Cold War and American science, environmentalism, molecular biology and genetic engineering. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST180C"
  },
  {
    "course_code": "HIST M181",
    "units": 4,
    "title": "Topics in Jewish History",
    "description": "(Same as Jewish Studies M181.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of major issues in Jewish history. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M181"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM181"
  },
  {
    "course_code": "HIST M181SL",
    "units": 4,
    "title": "Jewish Thought, Politics, and Ethics: From Theory to Practice",
    "description": "(Same as Jewish Studies M181SL.) Lecture, three hours; fieldwork, two hours. Designed for juniors/seniors. History of Los Angeles, with special emphasis on pivotal roles Jews have played in shaping Los Angeles and role that Los Angeles has played in reshaping of Jewish identities, communities, and cultures. Exploration of themes related to regionalism in American Jewish history, comparative immigration and migration patterns, and frontiers and borderlands, while providing overview of historical methodologies and interpretation. Examination of ethical and methodological implications of writing history in digital age and learning how to read and analyze these new media works as primary and secondary historical texts. Opportunity to contribute to body of historical work related to Los Angeles Jewish history through required service work with community partners and development of digital public history projects. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M181SL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM181SL"
  },
  {
    "course_code": "HIST M182A",
    "units": 4,
    "title": "Ancient Jewish History",
    "description": "(Same as Jewish Studies M182A and Religion M182A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of social, political, and religious developments. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M182A",
      "RELIGN M182A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM182A"
  },
  {
    "course_code": "HIST M182B",
    "units": 4,
    "title": "Medieval Jewish History",
    "description": "(Same as Jewish Studies M182B and Religion M182B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exploration of unfolding of Jewish history from rise of Christianity to expulsion of Jews from Spain in 1492. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M182B",
      "RELIGN M182B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM182B"
  },
  {
    "course_code": "HIST M182C",
    "units": 4,
    "title": "Modern Jewish History",
    "description": "(Same as Jewish Studies M182C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of early modern Jewish history beginning with enormously repercussive expulsion of Jews from Spain in 1492, followed by transformations in Jewish society and identity over five centuries in Europe and Middle East, and concluding with nationalism. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M182C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM182C"
  },
  {
    "course_code": "HIST 183A",
    "units": 4,
    "title": "Third Reich and Jews",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History of modern anti-Semitic ideologies and movements. Rise of national socialism in Germany. Development and execution of Nazi anti-Jewish policy to outbreak of World War II. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST183A"
  },
  {
    "course_code": "HIST 183B",
    "units": 4,
    "title": "Third Reich and Jews",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Second World War. Implementation of Nazi plans for extermination of Jews in Nazi-dominated Europe. Life in Nazi-imposed ghettos. Forms of Jewish resistance. Fate of Jewish populations in occupied territories. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST183B"
  },
  {
    "course_code": "HIST M184A",
    "units": 4,
    "title": "Jewish Civilization: Encounter with Great World Cultures",
    "description": "(Same as Jewish Studies M184A and Religion M184A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exploration of dynamic and millennia-old interaction of Jews with great world cultures. Creative adaptations that have lent Jewish culture its distinct and various forms. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M184A",
      "JEWISH M184A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM184A"
  },
  {
    "course_code": "HIST M184B",
    "units": 4,
    "title": "History of Anti-Semitism",
    "description": "(Same as Jewish Studies M184B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of origins and historical development of anti-Semitism. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M184B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM184B"
  },
  {
    "course_code": "HIST M184C",
    "units": 4,
    "title": "American Jewish Experience",
    "description": "(Same as Jewish Studies M184C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Experience of Jews in America, both historical and contemporary. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M184C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM184C"
  },
  {
    "course_code": "HIST M184D",
    "units": 4,
    "title": "History of Zionism and State of Israel",
    "description": "(Same as Jewish Studies M184D.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of history of State of Israel from 1948 to present. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M184D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM184D"
  },
  {
    "course_code": "HIST 185A",
    "units": 4,
    "title": "History of Religions: Myth",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Nature and function of myth in history of religion and culture. Examples selected from nonliterate as well as from other Asian and European traditions. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST185A"
  },
  {
    "course_code": "HIST 185B",
    "units": 4,
    "title": "Religions of South and Southeast Asia",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Topics vary from year to year and include religion of Veda; Brahmanism; (later) Hinduism. Consult Schedule of Classes for specifics. May be taken independently for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST185B"
  },
  {
    "course_code": "HIST 185C",
    "units": 4,
    "title": "Religions of South and Southeast Asia",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Topics vary from year to year and include Buddhism in India; religions of Java and Bali; nonliterate traditions of India and Southeast Asia. Consult Schedule of Classes for specifics. May be taken independently for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST185C"
  },
  {
    "course_code": "HIST M185D",
    "units": 4,
    "title": "Religions of Ancient Near East",
    "description": "(Same as Ancient Near East M185D and Religion M185D.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Main polytheistic systems of ancient Near East, with emphasis on Mesopotamia and Syria and with reference to religion of ancient Israel: varying concepts of divinity, hierarchies of gods, prayer and cult, magics, wisdom, and moral conduct. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M185D",
      "AN N EA M185D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM185D"
  },
  {
    "course_code": "HIST 185E",
    "units": 4,
    "title": "Special Topics in History of Religions",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Topics announced in Schedule of Classes and include ancient Germanic cults; Renaissance mysticism; mystics of low countries; goddesses; religion in secular age. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST185E"
  },
  {
    "course_code": "HIST M185F",
    "units": 4,
    "title": "History of Early Christians",
    "description": "(Same as Religion M186A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Christian movement from its origins to circa 160 CE, stressing its continuity/discontinuity with Judaism, various responses to Jesus of Nazareth, writings produced during this period, movement’s encounters with its religious, social, and political world, and methods of research. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M186A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM185F"
  },
  {
    "course_code": "HIST M185G",
    "units": 4,
    "title": "Religious Environment of Early Christians",
    "description": "(Same as Religion M186B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Rich variety in religious practice and thought in Mediterranean world of 1st century CE as in context of developing Christian movement. Topics include Pharisees, Qumran, Philo, Stoics, Epicureans, traditional Greek and Roman religions, mysteries, astrology, magic, gnosticism, and emperor-worship. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M186B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM185G"
  },
  {
    "course_code": "HIST M185I",
    "units": 4,
    "title": "Jesus of Nazareth in Historical Research",
    "description": "(Same as Religion M186C.) Lecture, three hours; discussion, one hour (when scheduled). Recommended preparation: course M185F. Designed for juniors/seniors. Stimulated by significant post-Enlightenment historical evaluations, students are led into firsthand knowledge (in translation) of various multilayered sources for reconstruction of life, teaching, and initial impact of Jesus of Nazareth in his social, economic, political, and religious contexts. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M186C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM185I"
  },
  {
    "course_code": "HIST M186A",
    "units": 4,
    "title": "Women and Gender, Prehistory to 1792",
    "description": "(Same as Gender Studies M186A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exploration of history of women, gender, and sexuality from prehistory to 1792. First half deals with period before written history and asks when did gender appear? How and why did patriarchy develop? Topics include evolution of women’s bodies, appearance of gender, women’s contribution to Neolithic revolution, significance of Goddess artifacts, creation myths, and women and sexuality in different religions. Consideration of effects of European conquest on Mesoamerican women, women’s power in monarchies, gender dimensions of Atlantic slavery, and first manifestations of feminist consciousness in second half. Objects or texts created by women examined or read throughout. P/NP or letter grading.",
    "cross_listed": [
      "GENDER M186A",
      "Women and Gender, Prehistory to 1792"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM186A"
  },
  {
    "course_code": "HIST M186B",
    "units": 4,
    "title": "Global Feminism, 1850 to Present",
    "description": "(Same as Gender Studies M186B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Introduction to movements for women’s rights (educational, political, economic, sexual, and reproductive) around world and over one and one half centuries. P/NP or letter grading.",
    "cross_listed": [
      "GENDER M186B",
      "Global Feminism, 1850"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM186B"
  },
  {
    "course_code": "HIST 187A",
    "units": 4,
    "title": "Variable Topics Historiography Proseminar: Ancient History",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST187A"
  },
  {
    "course_code": "HIST 187B",
    "units": 4,
    "title": "Variable Topics Historiography Proseminar: Medieval",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST187B"
  },
  {
    "course_code": "HIST 187C",
    "units": 4,
    "title": "Variable Topics Historiography Proseminar: Europe",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST187C"
  },
  {
    "course_code": "HIST 187D",
    "units": 4,
    "title": "Variable Topics Historiography Proseminar: U.S.",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST187D"
  },
  {
    "course_code": "HIST 187E",
    "units": 4,
    "title": "Variable Topics Historiography Proseminar: Latin America",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST187E"
  },
  {
    "course_code": "HIST 187F",
    "units": 4,
    "title": "Variable Topics Historiography Proseminar: Near East",
    "description": "Seminar, three hours. Proseminars on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST187F"
  },
  {
    "course_code": "HIST 187G",
    "units": 4,
    "title": "Variable Topics Historiography Proseminar: East Asia",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST187G"
  },
  {
    "course_code": "HIST 187I",
    "units": 4,
    "title": "Variable Topics Historiography Proseminar: Science/Technology",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST187I"
  },
  {
    "course_code": "HIST 187J",
    "units": 4,
    "title": "Variable Topics Historiography Proseminar: Africa",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST187J"
  },
  {
    "course_code": "HIST C187K",
    "units": 4,
    "title": "Topics in Historiography: History of Religions",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. May be concurrently scheduled with course C200P. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC187K"
  },
  {
    "course_code": "HIST 187L",
    "units": 4,
    "title": "Variable Topics Historiography Proseminar: Jewish",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST187L"
  },
  {
    "course_code": "HIST 187M",
    "units": 4,
    "title": "Variable Topics Historiography Proseminar: Southeast Asia",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST187M"
  },
  {
    "course_code": "HIST C187N",
    "units": 4,
    "title": "Topics in Historiography: India",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. May be concurrently scheduled with course C200K. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC187N"
  },
  {
    "course_code": "HIST C187O",
    "units": 4,
    "title": "Topics in Historiography: World History",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. May be concurrently scheduled with course C200F. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC187O"
  },
  {
    "course_code": "HIST C187P",
    "units": 4,
    "title": "Topics in Historiography: Theory of History",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. May be concurrently scheduled with course C200Q. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC187P"
  },
  {
    "course_code": "HIST C187R",
    "units": 4,
    "title": "Topics in Historiography: Japan",
    "description": "Seminar, three hours. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated once for credit. May be concurrently scheduled with course C200M. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC187R"
  },
  {
    "course_code": "HIST 188",
    "units": 2,
    "title": "Special Courses in History",
    "description": "Lecture, two hours. Overview of various career paths for students with degrees in history. Helps students develop academic and professional skills in preparation for life after UCLA. Focus on ways in which one can apply historical concepts, research methodologies, and analytical skills to range of careers. Guest speakers discuss how they have applied their history degrees to their work outside of academia. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST188"
  },
  {
    "course_code": "HIST 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST188SA"
  },
  {
    "course_code": "HIST 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HIST 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST188SB"
  },
  {
    "course_code": "HIST 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HIST 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST188SC"
  },
  {
    "course_code": "HIST 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST189"
  },
  {
    "course_code": "HIST 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST189HC"
  },
  {
    "course_code": "HIST 191A",
    "units": 4,
    "title": "Capstone Seminar: History—Ancient History",
    "description": "Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Organized on topics basis with reading, discussion, and development of culminating project. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST191A"
  },
  {
    "course_code": "HIST 191B",
    "units": 4,
    "title": "Capstone Seminar: History—Medieval",
    "description": "Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Organized on topics basis with reading, discussion, and development of culminating project. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST191B"
  },
  {
    "course_code": "HIST 191C",
    "units": 4,
    "title": "Capstone Seminar: History—Europe",
    "description": "Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Organized on topics basis with reading, discussion, and development of culminating project. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST191C"
  },
  {
    "course_code": "HIST C191D",
    "units": 4,
    "title": "Topics in History: U.S.",
    "description": "Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Reading and discussion of selected topics, and development of culminating project. May be repeated once for credit. May be concurrently scheduled with course C201H. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC191D"
  },
  {
    "course_code": "HIST M191DC",
    "units": 8,
    "title": "CAPPP Washington, DC, Research Seminars",
    "description": "(Same as Communication M191DC, Political Science M191DC, Public Affairs M191DC, and Sociology M191DC.) Seminar, three hours. Limited to CAPPP Program students. Seminars for undergraduate students in Center for American Politics and Public Policy’s program in Washington, DC. Focus on development and execution of original empirical research based on experiences from Washington, DC—based field placements. Study of variety of qualitative methods (observation, interviewing, etc.), with comparison to quantitative analysis. Examination of features of solid and significant research; intensive writing. Letter grading.",
    "cross_listed": [
      "SOCIOL M191DC",
      "POL SCI M191DC",
      "PUB AFF M191DC",
      "COMM M191DC"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM191DC"
  },
  {
    "course_code": "HIST 191E",
    "units": 4,
    "title": "Capstone Seminar: History—Latin America",
    "description": "Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Organized on topics basis with reading, discussion, and development of culminating project. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST191E"
  },
  {
    "course_code": "HIST C191F",
    "units": 4,
    "title": "Topics in History: Near East",
    "description": "Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Reading and discussion of selected topics, and development of culminating project. May be repeated once for credit. May be concurrently scheduled with course C201J. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC191F"
  },
  {
    "course_code": "HIST 191G",
    "units": 4,
    "title": "Capstone Seminar: History—East Asia",
    "description": "Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Organized on topics basis with reading, discussion, and development of culminating project. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST191G"
  },
  {
    "course_code": "HIST 191I",
    "units": 4,
    "title": "Capstone Seminar: History—Science/Technology",
    "description": "Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Organized on topics basis with reading, discussion, and development of culminating project. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST191I"
  },
  {
    "course_code": "HIST C191J",
    "units": 4,
    "title": "Topics in History: Africa",
    "description": "(Formerly numbered 191J.) Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Reading and discussion of selected topics, and development of culminating project. May be repeated once for credit. May be concurrently scheduled with course C201N. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC191J"
  },
  {
    "course_code": "HIST C191K",
    "units": 4,
    "title": "Topics in History: History of Religions",
    "description": "Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Reading and discussion of selected topics, and development of culminating project. May be repeated once for credit. May be concurrently scheduled with course C201P. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC191K"
  },
  {
    "course_code": "HIST C191L",
    "units": 4,
    "title": "Topics in History: Jewish History",
    "description": "(Formerly numbered 191L.) Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Reading and discussion of selected topics, and development of culminating project. May be repeated once for credit. May be concurrently scheduled with course C201R. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC191L"
  },
  {
    "course_code": "HIST 191M",
    "units": 4,
    "title": "Capstone Seminar: History—Southeast Asia",
    "description": "Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Organized on topics basis with reading, discussion, and development of culminating project. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST191M"
  },
  {
    "course_code": "HIST C191N",
    "units": 4,
    "title": "Topics in History: India",
    "description": "(Formerly numbered 191N.) Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Reading and discussion of selected topics, and development of culminating project. May be repeated once for credit. May be concurrently scheduled with course C201K. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC191N"
  },
  {
    "course_code": "HIST C191O",
    "units": 4,
    "title": "Topics in History: World",
    "description": "Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Reading and discussion of selected topics, and development of culminating project. May be repeated once for credit. May be concurrently scheduled with course C201W. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC191O"
  },
  {
    "course_code": "HIST C191P",
    "units": 4,
    "title": "Topics in History: Theory of History",
    "description": "(Formerly numbered 191P.) Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Reading and discussion of selected topics, and development of culminating project. May be repeated once for credit. May be concurrently scheduled with course C201Q. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC191P"
  },
  {
    "course_code": "HIST 191Q",
    "units": 4,
    "title": "Capstone Seminar: History—Digital History",
    "description": "Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Organized on topics basis with reading, discussion, and development of culminating project. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST191Q"
  },
  {
    "course_code": "HIST C191R",
    "units": 4,
    "title": "Topics in History: Japan",
    "description": "(Formerly numbered 191R.) Seminar, three hours. Designed for seniors. Limited to 15 students meeting with faculty member. Reading and discussion of selected topics, and development of culminating project. May be repeated once for credit. May be concurrently scheduled with course C201M. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC191R"
  },
  {
    "course_code": "HIST M194DC",
    "units": 4,
    "title": "Quarter in Washington, DC, Research Seminar",
    "description": "(Same as Political Science M194DC and Sociology M194DC.) Seminar, three hours. Limited to Quarter in Washington students and other students enrolled in UC Washington Center programs. Seminars for undergraduate students in Center for American Politics and Public Policy’s program in Washington, DC. Focus on development and execution of original empirical research based on experiences from Washington, DC-based field placements. Study of variety of qualitative methods (observation, interviewing, etc.), with comparison to quantitative analysis. Examination of features of solid and significant research; intensive writing. Letter grading.",
    "cross_listed": [
      "POL SCI M194DC",
      "SOCIOL M194DC"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM194DC"
  },
  {
    "course_code": "HIST 195",
    "units": 4,
    "title": "Community or Corporate Internships in History",
    "description": "Tutorial, to be arranged; fieldwork, 8 to 10 hours. Limited to juniors/seniors. Internship in applied/public history setting coordinated through Public History Initiative. Students meet on regular basis with faculty supervisor, provide periodic reports of their experience, and write final research paper. Four units may be applied toward major requirements. Individual contract with supervising faculty member required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST195"
  },
  {
    "course_code": "HIST 195CE",
    "units": 4,
    "title": "Community and Corporate Internships in History",
    "description": "Tutorial, to be arranged; fieldwork, eight to 10 hours. Limited to juniors/seniors. Internship in corporate, governmental, or nonprofit setting coordinated through Center for Community Engagement. Students complete weekly written assignments, attend biweekly meetings with graduate student instructor, and write final research paper. Faculty mentor and graduate student instructor construct series of reading assignments that examine issues related to internship site. May be repeated for credit with consent of Center for Community Engagement. No more than 8 units may be applied toward major; units applied must be taken for letter grade. May not be applied toward concentration or distribution requirements. Individual contract with supervising faculty member required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST195CE"
  },
  {
    "course_code": "HIST M195DC",
    "units": 4,
    "title": "Quarter in Washington, DC, Internships",
    "description": "(Same as Community Engagement and Social Change M195DC, Political Science M195DC, Public Affairs M195DC, and Sociology M195DC.) Tutorial, four hours. Limited to junior/senior Quarter in Washington program students. Internships in Washington, DC, through Center for American Politics and Public Policy. Students meet on regular basis with instructor and provide periodic reports of their experience. Individual contract with supervising faculty member required. P/NP grading.",
    "cross_listed": [
      "POL SCI M195DC",
      "SOCIOL M195DC",
      "PUB AFF M195DC",
      "CESC M195DC"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM195DC"
  },
  {
    "course_code": "HIST 197",
    "units": 4,
    "title": "Individual Studies in History",
    "description": "Tutorial, three hours. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST197"
  },
  {
    "course_code": "HIST 198A",
    "units": 4,
    "title": "Honors Research in History",
    "description": "Tutorial, to be arranged. Course 198A is requisite to 198B, which is requisite to 198C. Limited to juniors/seniors. Development of honors thesis or comprehensive research project under direct supervision of faculty member. May be repeated for maximum of 16 units. Individual contract required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST198A"
  },
  {
    "course_code": "HIST 198B",
    "units": 4,
    "title": "Honors Research in History",
    "description": "Tutorial, to be arranged. Requisite: course 198A. Limited to juniors/seniors. Continued development of honors thesis or comprehensive research project under direct supervision of faculty member. May be repeated for maximum of 16 units. Individual contract required. In Progress grading (credit to be given only on completion of course 198C).",
    "prerequisites": [
      "HIST 198A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST198B"
  },
  {
    "course_code": "HIST 198C",
    "units": 4,
    "title": "Honors Research in History",
    "description": "Tutorial, to be arranged. Requisite: course 198B. Limited to juniors/seniors. Completion of honors thesis or comprehensive research project under direct supervision of faculty member. May be repeated for maximum of 16 units. Individual contract required. Letter grading.",
    "prerequisites": [
      "HIST 198B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST198C"
  },
  {
    "course_code": "HIST 199",
    "units": 4,
    "title": "Directed Research in History",
    "description": "Tutorial, three hours. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit; History majors limited to 8 units. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST199"
  },
  {
    "course_code": "HIST 200A",
    "units": 4,
    "title": "Advanced Historiography: Ancient Greece",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200A"
  },
  {
    "course_code": "HIST 200B",
    "units": 4,
    "title": "Advanced Historiography: Ancient Rome",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200B"
  },
  {
    "course_code": "HIST 200C",
    "units": 4,
    "title": "Advanced Historiography: Medieval",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200C"
  },
  {
    "course_code": "HIST 200D",
    "units": 4,
    "title": "Advanced Historiography: Europe",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200D"
  },
  {
    "course_code": "HIST C200F",
    "units": 4,
    "title": "Topics in Historiography: World History",
    "description": "Seminar, three hours. Designed for graduate students. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated for credit. May be concurrently scheduled with course C187O. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC200F"
  },
  {
    "course_code": "HIST 200H",
    "units": 4,
    "title": "Advanced Historiography: U.S.",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200H"
  },
  {
    "course_code": "HIST 200I",
    "units": 4,
    "title": "Advanced Historiography: Latin America",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200I"
  },
  {
    "course_code": "HIST 200J",
    "units": 4,
    "title": "Advanced Historiography: Near East",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200J"
  },
  {
    "course_code": "HIST C200K",
    "units": 4,
    "title": "Topics in Historiography: India",
    "description": "Seminar, three hours. Designed for graduate students. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated for credit. May be concurrently scheduled with course C187N. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC200K"
  },
  {
    "course_code": "HIST 200L",
    "units": 4,
    "title": "Advanced Historiography: China",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200L"
  },
  {
    "course_code": "HIST C200M",
    "units": 4,
    "title": "Topics in Historiography: Japan",
    "description": "Seminar, three hours. Designed for graduate students. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated for credit. May be concurrently scheduled with course C187R. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC200M"
  },
  {
    "course_code": "HIST 200N",
    "units": 4,
    "title": "Advanced Historiography: Africa",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200N"
  },
  {
    "course_code": "HIST 200O",
    "units": 4,
    "title": "Advanced Historiography: Science/Technology",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200O"
  },
  {
    "course_code": "HIST C200P",
    "units": 4,
    "title": "Topics in Historiography: History of Religions",
    "description": "(Formerly numbered 200P.) Seminar, three hours. Designed for graduate students. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated for credit. May be concurrently scheduled with course C187K. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC200P"
  },
  {
    "course_code": "HIST C200Q",
    "units": 4,
    "title": "Topics in Historiography: Theory of History",
    "description": "Seminar, three hours. Designed for graduate students. Proseminar on historiography involving close reading and critical discussion of secondary scholarship and primary sources on selected topics. Reading, discussion, and analytical writing culminating in one or several historiographical essays. May be repeated for credit. May be concurrently scheduled with course C187P. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC200Q"
  },
  {
    "course_code": "HIST 200R",
    "units": 4,
    "title": "Advanced Historiography: Jewish History",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200R"
  },
  {
    "course_code": "HIST 200S",
    "units": 4,
    "title": "Advanced Historiography: Armenia and Caucasus",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200S"
  },
  {
    "course_code": "HIST 200T",
    "units": 4,
    "title": "Advanced Historiography: Southeast Asia",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200T"
  },
  {
    "course_code": "HIST 200U",
    "units": 4,
    "title": "Advanced Historiography: Psychohistory",
    "description": "Seminar, three hours. May be repeated for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200U"
  },
  {
    "course_code": "HIST M200V",
    "units": 4,
    "title": "Advanced Historiography: African American",
    "description": "(Same as African American Studies M200A.) Seminar, three hours. May be repeated for credit. S/U or letter grading.",
    "cross_listed": [
      "AF AMER M200A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM200V"
  },
  {
    "course_code": "HIST M200W",
    "units": 4,
    "title": "Advanced Historiography: American Indian Peoples",
    "description": "(Same as American Indian Studies M203.) Lecture, 90 minutes; seminar, 90 minutes. Introduction to culture-histories of North American Indians and review of Indian concepts of history. Stereotypical approach to content and methodologies related to Indian past that is interdisciplinary and multicultural in its scope. Letter grading.",
    "cross_listed": [
      "AM IND M203"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM200W"
  },
  {
    "course_code": "HIST 200X",
    "units": 4,
    "title": "Advanced Historiography: Oral History",
    "description": "Seminar, three hours. Introduction to practice, method, and theory of oral history.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200X"
  },
  {
    "course_code": "HIST 200Y",
    "units": 4,
    "title": "Advanced Historiography: Application of Economics to History",
    "description": "Discussion, three hours.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200Y"
  },
  {
    "course_code": "HIST 200Z",
    "units": 4,
    "title": "Advanced Historiography: Chicano",
    "description": "Discussion, three hours. Graduate survey of leading literature in Chicano history, with emphasis on new methodological and theoretical approaches in the field.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST200Z"
  },
  {
    "course_code": "HIST 201A",
    "units": 4,
    "title": "Topics in History: Ancient Greece",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201A"
  },
  {
    "course_code": "HIST 201B",
    "units": 4,
    "title": "Topics in History: Ancient Rome",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201B"
  },
  {
    "course_code": "HIST 201C",
    "units": 4,
    "title": "Topics in History: Medieval",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201C"
  },
  {
    "course_code": "HIST 201D",
    "units": 4,
    "title": "Topics in History: Early Modern Europe",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201D"
  },
  {
    "course_code": "HIST 201E",
    "units": 4,
    "title": "Topics in History: Modern Europe",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201E"
  },
  {
    "course_code": "HIST 201F",
    "units": 4,
    "title": "Topics in History: Russia/Eastern Europe",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201F"
  },
  {
    "course_code": "HIST 201G",
    "units": 4,
    "title": "Topics in History: Britain",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201G"
  },
  {
    "course_code": "HIST C201H",
    "units": 4,
    "title": "Topics in History: U.S.",
    "description": "Seminar, three hours. Designed for graduate students. Reading and discussion of selected topics. May be repeated for credit. May be concurrently scheduled with course C191D. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC201H"
  },
  {
    "course_code": "HIST 201I",
    "units": 4,
    "title": "Topics in History: Latin America",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201I"
  },
  {
    "course_code": "HIST C201J",
    "units": 4,
    "title": "Topics in History: Near East",
    "description": "Seminar, three hours. Designed for graduate students. Reading and discussion of selected topics. May be repeated for credit. May be concurrently scheduled with course C191F. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC201J"
  },
  {
    "course_code": "HIST C201K",
    "units": 4,
    "title": "Topics in History: India",
    "description": "(Formerly numbered 201K.) Seminar, three hours. Designed for graduate students. Reading and discussion of selected topics. May be repeated for credit. May be concurrently scheduled with course C191N. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC201K"
  },
  {
    "course_code": "HIST 201L",
    "units": 4,
    "title": "Topics in History: China",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201L"
  },
  {
    "course_code": "HIST C201M",
    "units": 4,
    "title": "Topics in History: Japan",
    "description": "(Formerly numbered 201M.) Seminar, three hours. Designed for graduate students. Reading and discussion of selected topics. May be repeated for credit. May be concurrently scheduled with course C191R. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC201M"
  },
  {
    "course_code": "HIST C201N",
    "units": 4,
    "title": "Topics in History: Africa",
    "description": "(Formerly numbered 201N.) Seminar, three hours. Designed for graduate students. Reading and discussion of selected topics. May be repeated for credit. May be concurrently scheduled with course C191J. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC201N"
  },
  {
    "course_code": "HIST 201O",
    "units": 4,
    "title": "Topics in History: Science/Technology",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201O"
  },
  {
    "course_code": "HIST C201P",
    "units": 4,
    "title": "Topics in History: History of Religions",
    "description": "Seminar, three hours. Designed for graduate students. Reading and discussion of selected topics. May be repeated for credit. May be concurrently scheduled with course C191K. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC201P"
  },
  {
    "course_code": "HIST C201Q",
    "units": 4,
    "title": "Topics in History: Theory of History",
    "description": "(Formerly numbered 201Q.) Seminar, three hours. Designed for graduate students. Reading and discussion of selected topics. May be repeated for credit. May be concurrently scheduled with course C191P. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC201Q"
  },
  {
    "course_code": "HIST C201R",
    "units": 4,
    "title": "Topics in History: Jewish History",
    "description": "(Formerly numbered 201R.) Seminar, three hours. Designed for graduate students. Reading and discussion of selected topics. May be repeated for credit. May be concurrently scheduled with course C191L. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC201R"
  },
  {
    "course_code": "HIST 201S",
    "units": 4,
    "title": "Topics in History: Armenia and Caucasus",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201S"
  },
  {
    "course_code": "HIST 201T",
    "units": 4,
    "title": "Topics in History: Southeast Asia",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201T"
  },
  {
    "course_code": "HIST 201U",
    "units": 4,
    "title": "Topics in History: Psychohistory",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201U"
  },
  {
    "course_code": "HIST 201V",
    "units": 4,
    "title": "Topics in History: Digital History",
    "description": "Seminar, three hours. Graduate course involving reading, lecturing, and discussion of selected topics. May be repeated for credit. When concurrently scheduled with course 191, undergraduates must obtain consent of instructor to enroll. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST201V"
  },
  {
    "course_code": "HIST C201W",
    "units": 4,
    "title": "Topics in History: World",
    "description": "Seminar, three hours. Designed for graduate students. Reading and discussion of selected topics. May be repeated for credit. May be concurrently scheduled with course C191O. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC201W"
  },
  {
    "course_code": "HIST 202A",
    "units": 4,
    "title": "Seminar: Comparative Modern Economic History",
    "description": "Seminar, three hours. Course 202A is requisite to 202B. Designed for graduate students. Study of problems of modern economics in the 19th and 20th centuries, including such topics as industrialization, growth, demography, development, and economic change. In Progress grading (credit to be given only on completion of course 202B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST202A"
  },
  {
    "course_code": "HIST 202B",
    "units": 4,
    "title": "Seminar: Comparative Modern Economic History",
    "description": "Seminar, three hours. Requisite: course 202A. Designed for graduate students. Study of problems of modern economics in the 19th and 20th centuries, including such topics as industrialization, growth, demography, development, and economic change. Letter grading.",
    "prerequisites": [
      "HIST 202A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST202B"
  },
  {
    "course_code": "HIST 203A",
    "units": 4,
    "title": "Social Theory and Comparative History",
    "description": "Seminar, three and one half hours every other week. Introduction to historically rooted social theory and theoretically sensitive history, following program of Center for Social Theory and Comparative History. May be taken independently for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST203A"
  },
  {
    "course_code": "HIST 203B",
    "units": 4,
    "title": "Social Theory and Comparative History",
    "description": "Seminar, three and one half hours every other week. Introduction to historically rooted social theory and theoretically sensitive history, following program of Center for Social Theory and Comparative History. May be taken independently for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST203B"
  },
  {
    "course_code": "HIST 203C",
    "units": 4,
    "title": "Theories in Cultural History",
    "description": "Seminar, three hours. Introduction to social, linguistic, semiotic, or other new interpretive theories and practices developed in other fields and applied to historical material. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST203C"
  },
  {
    "course_code": "HIST 204A",
    "units": 4,
    "title": "Departmental Seminar: Approaches, Methods, Debates, Practices",
    "description": "Seminar, three hours. Required of all first-year departmental graduate students. Introduction to range of important methodological approaches and theoretical debates about writing of history that are influential across fields, geographical contexts, and temporal periods to stimulate conversation and connection across fields, inviting students to think collectively and expansively about study and praxis of history. Introduction to sampling of scholarship produced by department faculty members with whom students may work. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST204A"
  },
  {
    "course_code": "HIST 204B",
    "units": 4,
    "title": "Departmental Seminar: Many Professions of History",
    "description": "Seminar, three hours. Professional development seminar with practicum component. Focus primarily on exploring and demonstrating ways in which skills of historians are transferable to variety of professions and exercised in diverse ways and roles. Discussion of actual and possible roles and responsibilities of historians in 21st-century society. Examination of where historians have been, where they are now, where they can be, and where they should be as highly educated, actively engaged members of society. Collaborative project required. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST204B"
  },
  {
    "course_code": "HIST 205A",
    "units": 1,
    "title": "History Department Professional Development Seminar",
    "description": "Seminar, one hour. Course 205A is requisite to 205B. Limited to history doctoral students. Introduction to issues in professional development of students in History PhD program. In Progress grading (credit to be given only on completion of course 205B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST205A"
  },
  {
    "course_code": "HIST 205B",
    "units": 1,
    "title": "History Department Professional Development Seminar",
    "description": "Seminar, one hour. Requisite: course 205A. Limited to history doctoral students. Introduction to issues in professional development of students in History PhD program. S/U grading.",
    "prerequisites": [
      "HIST 205A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST205B"
  },
  {
    "course_code": "HIST 206A",
    "units": 4,
    "title": "Seminar: Near East History",
    "description": "Seminar, three hours. Course 206A is requisite to 206B. In Progress grading (credit to be given only on completion of course 206B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST206A"
  },
  {
    "course_code": "HIST 206B",
    "units": 4,
    "title": "Seminar: Near East History",
    "description": "Seminar, three hours. Requisite: course 206A. Letter grading.",
    "prerequisites": [
      "HIST 206A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST206B"
  },
  {
    "course_code": "HIST C208A",
    "units": 4,
    "title": "Variable Topics: Interdisciplinary Studies",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Course C208A is not requisite to C208B. Topics may include gender, world history, masculinity, and economic history. May be repeated for credit with topic change. Concurrently scheduled with course C101A. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC208A"
  },
  {
    "course_code": "HIST C208B",
    "units": 4,
    "title": "Variable Topics: Interdisciplinary Studies",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Course C208A is not requisite to C208B. Topics may include gender, world history, masculinity, and economic history. May be repeated for credit with topic change. Concurrently scheduled with course C101B. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTC208B"
  },
  {
    "course_code": "HIST M210",
    "units": 4,
    "title": "Topics in Ancient Iranian History",
    "description": "(Same as Ancient Near East M208 and Iranian M210.) Seminar, three hours. Varying topics on Elamite, Achaemenid, Arsacid, and Sasanian history. May be repeated for credit. S/U or letter grading.",
    "cross_listed": [
      "AN N EA M208",
      "IRANIAN M210"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM210"
  },
  {
    "course_code": "HIST 211A",
    "units": 4,
    "title": "Seminar: Armenian History",
    "description": "Seminar, three hours. Course 211A is requisite to 211B. In Progress grading (credit to be given only on completion of course 211B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST211A"
  },
  {
    "course_code": "HIST 211B",
    "units": 4,
    "title": "Seminar: Armenian History",
    "description": "Seminar, three hours. Requisite: course 211A. Letter grading.",
    "prerequisites": [
      "HIST 211A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST211B"
  },
  {
    "course_code": "HIST 212",
    "units": 4,
    "title": "Methods in Armenian Oral History",
    "description": "Seminar, three hours. Uses and techniques of Armenian oral history; preinterview, interview, and postinterview procedures; methods of compilation and evaluation. Field assignments, interviews, and summaries and/or paper based on interviews. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST212"
  },
  {
    "course_code": "HIST 213A",
    "units": 4,
    "title": "History of Women, Men, Sexuality",
    "description": "Seminar, three hours. Readings include historiography and theory, as well as classic and new historical studies drawn widely from U.S., European, Latin American, Middle Eastern, and Asian history to have diversity of interests and perspectives represented and discussed. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST213A"
  },
  {
    "course_code": "HIST 213B",
    "units": 4,
    "title": "History of Women, Men, Sexuality",
    "description": "Seminar, three hours. Enforced requisite: course 213A. Research, analysis, drafting, and rewriting of student final papers. S/U or letter grading.",
    "prerequisites": [
      "HIST 213A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST213B"
  },
  {
    "course_code": "HIST 213C",
    "units": 4,
    "title": "History of Women, Men, and Sexuality Historiography",
    "description": "Seminar, three hours. Limited to graduate students. Exposure to newest branch of gender history: study of masculinity. Focus not on men per se, but on values, practices, and texts that constitute masculinity as one gender. Readings focus on broad range of chronological periods from antiquity to 20th century and geographical areas including Americas, Asia, Europe, and Middle East. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST213C"
  },
  {
    "course_code": "HIST 213D",
    "units": 4,
    "title": "Women's and Gender History",
    "description": "Seminar, three hours. Limited to graduate students. Focus on history of women and gender. Content is international, with emphasis on transnational histories and approaches. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST213D"
  },
  {
    "course_code": "HIST 214",
    "units": 4,
    "title": "Topics in World History",
    "description": "Seminar, three hours. Graduate seminar utilizing world-historical perspective to examine variety of broad themes in human history. Topics vary annually. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST214"
  },
  {
    "course_code": "HIST 215A",
    "units": 4,
    "title": "Seminar: Ancient History",
    "description": "Seminar, three hours. Course 215A is requisite to 215B. In Progress grading (credit to be given only on completion of course 215B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST215A"
  },
  {
    "course_code": "HIST 215B",
    "units": 4,
    "title": "Seminar: Ancient History",
    "description": "Seminar, three hours. Requisite: course 215A. Letter grading.",
    "prerequisites": [
      "HIST 215A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST215B"
  },
  {
    "course_code": "HIST 216A",
    "units": 4,
    "title": "Seminar: Byzantine History",
    "description": "Seminar, three hours. Course 216A is requisite to 216B. In Progress grading (credit to be given only on completion of course 216B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST216A"
  },
  {
    "course_code": "HIST 216B",
    "units": 4,
    "title": "Seminar: Byzantine History",
    "description": "Seminar, three hours. Requisite: course 216A. Letter grading.",
    "prerequisites": [
      "HIST 216A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST216B"
  },
  {
    "course_code": "HIST 217",
    "units": 4,
    "title": "Sources and Handbooks of Medieval History",
    "description": "Seminar, three hours. Preparation: reading knowledge of German or French. Introduction to types of medieval source materials and the handbooks needed to use them.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST217"
  },
  {
    "course_code": "HIST M218",
    "units": 4,
    "title": "Paleography of Latin and Vernacular Manuscripts, 900 to 1500",
    "description": "(Same as Classics M218, English M215, and French M210.) Lecture, three hours; discussion, two hours. Introduction to history of Latin and vernacular manuscript book from 900 to 1500 to (1) train students to make informed judgments with regard to place and date of origin, (2) provide training in accurate reading and transcription of later medieval scripts, and (3) examine manuscript book as witness to changing society that produced it. Focus on relationship between Latin manuscripts and vernacular manuscripts with regard to their respective presentation of written texts. S/U or letter grading.",
    "cross_listed": [
      "FRNCH M210",
      "Paleography of Latin and Vernacular Manuscripts, 900",
      "Paleography of Latin and Vernacular Manuscripts, 1500",
      "CLASSIC M218",
      "Paleography of Latin and Vernacular Manuscripts, 900",
      "Paleography of Latin and Vernacular Manuscripts, 1500",
      "ENGL M215",
      "Paleography of Latin and Vernacular Manuscripts, 900",
      "Paleography of Latin and Vernacular Manuscripts, 1500"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM218"
  },
  {
    "course_code": "HIST 221A",
    "units": 4,
    "title": "Seminar: Medieval History",
    "description": "Seminar, three hours. Course 221A is requisite to 221B. In Progress grading (credit to be given only on completion of course 221B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST221A"
  },
  {
    "course_code": "HIST 221B",
    "units": 4,
    "title": "Seminar: Medieval History",
    "description": "Seminar, three hours. Requisite: course 221A. Letter grading.",
    "prerequisites": [
      "HIST 221A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST221B"
  },
  {
    "course_code": "HIST 225",
    "units": 4,
    "title": "Colloquium for Entering Graduate Students in Modern European History",
    "description": "Seminar, three hours. Normally limited to and required of all modern European history graduate students. Introduction to topics, methods, and historiography of modern European history.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST225"
  },
  {
    "course_code": "HIST 226A",
    "units": 4,
    "title": "Seminar: Italian Renaissance",
    "description": "Seminar, three hours. Course 226A is requisite to 226B. In Progress grading (credit to be given only on completion of course 226B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST226A"
  },
  {
    "course_code": "HIST 226B",
    "units": 4,
    "title": "Seminar: Italian Renaissance",
    "description": "Seminar, three hours. Requisite: course 226A. Letter grading.",
    "prerequisites": [
      "HIST 226A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST226B"
  },
  {
    "course_code": "HIST 227A",
    "units": 4,
    "title": "Seminar: Reformation",
    "description": "Seminar, three hours. Course 227A is requisite to 227B. In Progress grading (credit to be given only on completion of course 227B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST227A"
  },
  {
    "course_code": "HIST 227B",
    "units": 4,
    "title": "Seminar: Reformation",
    "description": "Seminar, three hours. Requisite: course 227A. Letter grading.",
    "prerequisites": [
      "HIST 227A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST227B"
  },
  {
    "course_code": "HIST 229A",
    "units": 4,
    "title": "Seminar: Early Modern European History",
    "description": "Seminar, three hours. Course 229A is requisite to 229B. In Progress grading (credit to be given only on completion of course 229B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST229A"
  },
  {
    "course_code": "HIST 229B",
    "units": 4,
    "title": "Seminar: Early Modern European History",
    "description": "Seminar, three hours. Requisite: course 229A. Letter grading.",
    "prerequisites": [
      "HIST 229A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST229B"
  },
  {
    "course_code": "HIST M230A",
    "units": 4,
    "title": "Seminar: Modern European History",
    "description": "(Same as Art History M230B.) Seminar, three hours. Course M230A is enforced requisite to M230B. May be repeated for credit with consent of adviser. In Progress grading (credit to be given only on completion of course M230B).",
    "cross_listed": [
      "ART HIS M230B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM230A"
  },
  {
    "course_code": "HIST M230B",
    "units": 4,
    "title": "Seminar: Modern European History",
    "description": "(Same as Art History M230C.) Seminar, three hours. Enforced requisite: course M230A. May be repeated for credit with consent of adviser. Letter grading.",
    "prerequisites": [
      "HIST M230A"
    ],
    "cross_listed": [
      "ART HIS M230C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM230B"
  },
  {
    "course_code": "HIST 231A",
    "units": 4,
    "title": "Seminar: Modern European Intellectual and Cultural History",
    "description": "Seminar, three hours. Course 231A is requisite to 231B. In Progress grading (credit to be given only on completion of course 231A).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST231A"
  },
  {
    "course_code": "HIST 231B",
    "units": 4,
    "title": "Seminar: Modern European Intellectual and Cultural History",
    "description": "Seminar, three hours. Requisite: course 231A. Letter grading.",
    "prerequisites": [
      "HIST 231A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST231B"
  },
  {
    "course_code": "HIST 232A",
    "units": 4,
    "title": "Seminar: French History of 19th and 20th Centuries",
    "description": "Seminar, three hours. Course 232A is requisite to 232B. In Progress grading (credit to be given only on completion of course 232B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST232A"
  },
  {
    "course_code": "HIST 232B",
    "units": 4,
    "title": "Seminar: French History of 19th and 20th Centuries",
    "description": "Seminar, three hours. Requisite: course 232A. Letter grading.",
    "prerequisites": [
      "HIST 232A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST232B"
  },
  {
    "course_code": "HIST 233A",
    "units": 4,
    "title": "Seminar: Russian/Soviet History",
    "description": "Seminar, three hours. Course 233A is requisite to 233B. In Progress grading (credit to be given only on completion of course 233B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST233A"
  },
  {
    "course_code": "HIST 233B",
    "units": 4,
    "title": "Seminar: Russian/Soviet History",
    "description": "Seminar, three hours. Requisite: course 233A. Letter grading.",
    "prerequisites": [
      "HIST 233A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST233B"
  },
  {
    "course_code": "HIST 234A",
    "units": 4,
    "title": "Seminar: Modern History of Spain, Portugal, and Italy",
    "description": "Seminar, three hours. Course 234A is requisite to 234B. In Progress grading (credit to be given only on completion of course 234B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST234A"
  },
  {
    "course_code": "HIST 234B",
    "units": 4,
    "title": "Seminar: Modern History of Spain, Portugal, and Italy",
    "description": "Seminar, three hours. Requisite: course 234A. Letter grading.",
    "prerequisites": [
      "HIST 234A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST234B"
  },
  {
    "course_code": "HIST 235A",
    "units": 4,
    "title": "Economic History of Europe, 1780 to 1939",
    "description": "Seminar, three hours. Course 235A is requisite to 235B. Analysis of internationalization of European world economy, emergence of Western core and its relation with European peripheries. Comparative analysis on different regions, stressing main characteristics of postwar European economy. In Progress grading (credit to be given only on completion of course 235B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST235A"
  },
  {
    "course_code": "HIST 235B",
    "units": 4,
    "title": "Economic History of Europe, 1780 to 1939",
    "description": "Seminar, three hours. Requisite: course 235A. Analysis of internationalization of European world economy, emergence of Western core and its relation with European peripheries. Comparative analysis on different regions, stressing main characteristics of postwar European economy. Letter grading.",
    "prerequisites": [
      "HIST 235A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST235B"
  },
  {
    "course_code": "HIST 235C",
    "units": 4,
    "title": "Economic History of 20th-Century Europe",
    "description": "Seminar, three hours. Course 235C is requisite to 235D. Cyclical trend, various economic regimes, and integration process of Europe. In Progress grading (credit to be given only on completion of course 235D).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST235C"
  },
  {
    "course_code": "HIST 235D",
    "units": 4,
    "title": "Economic History of 20th-Century Europe",
    "description": "Seminar, three hours. Requisite: course 235C. Cyclical trend, various economic regimes, and integration process of Europe. Letter grading.",
    "prerequisites": [
      "HIST 235C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST235D"
  },
  {
    "course_code": "HIST M236A",
    "units": 4,
    "title": "Proseminar: Political Psychology",
    "description": "(Same as Political Science M261A and Psychology M228A.) Seminar, three hours. Introduction to political psychology: psychobiography, personality and politics, mass attitudes, group conflict, political communication, and elite decision making.",
    "cross_listed": [
      "PSYCH M228A",
      "POL SCI M261A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM236A"
  },
  {
    "course_code": "HIST 236B",
    "units": 4,
    "title": "Seminar: Psychohistory",
    "description": "Seminar, three hours. Course 236B is requisite to 236C. Exploration of individual and group psychological processes and their uses in historical research. In Progress grading (credit to be given only on completion of course 236C).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST236B"
  },
  {
    "course_code": "HIST 236C",
    "units": 4,
    "title": "Seminar: Psychohistory",
    "description": "Seminar, three hours. Requisite: course 236B. Exploration of individual and group psychological processes and their uses in historical research. Letter grading.",
    "prerequisites": [
      "HIST 236B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST236C"
  },
  {
    "course_code": "HIST 239A",
    "units": 4,
    "title": "Seminar: English History—Middle Ages",
    "description": "Seminar, three hours. Course 239A is requisite to 239B. In Progress grading (credit to be given only on completion of course 239B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST239A"
  },
  {
    "course_code": "HIST 239B",
    "units": 4,
    "title": "Seminar: English History—Middle Ages",
    "description": "Seminar, three hours. Requisite: course 239A. Letter grading.",
    "prerequisites": [
      "HIST 239A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST239B"
  },
  {
    "course_code": "HIST 240A",
    "units": 4,
    "title": "Seminar: English History—Modern History",
    "description": "Seminar, three hours. Course 240A is requisite to 240B. In Progress grading (credit to be given only on completion of course 240B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST240A"
  },
  {
    "course_code": "HIST 240B",
    "units": 4,
    "title": "Seminar: English History—Modern History",
    "description": "Seminar, three hours. Requisite: course 240A. Letter grading.",
    "prerequisites": [
      "HIST 240A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST240B"
  },
  {
    "course_code": "HIST 241A",
    "units": 4,
    "title": "Seminar: German History",
    "description": "Seminar, three hours. Course 241A is requisite to 241B. Designed for graduate students. In Progress grading (credit to be given only on completion of course 241B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST241A"
  },
  {
    "course_code": "HIST 241B",
    "units": 4,
    "title": "Seminar: German History",
    "description": "Seminar, three hours. Requisite: course 241A. Designed for graduate students. Letter grading.",
    "prerequisites": [
      "HIST 241A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST241B"
  },
  {
    "course_code": "HIST 242",
    "units": 2,
    "title": "Colloquium: European History",
    "description": "Designed for graduate students. Forum for critical discussion of work of students and invited scholars. Presentation of student dissertation prospectuses during their third or fourth year in residence. S/U grading for students presenting papers.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST242"
  },
  {
    "course_code": "HIST 244A",
    "units": 4,
    "title": "Seminar: British Empire History",
    "description": "Seminar, three hours. Course 244A is requisite to 244B. In Progress grading (credit to be given only on completion of course 244B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST244A"
  },
  {
    "course_code": "HIST 244B",
    "units": 4,
    "title": "Seminar: British Empire History",
    "description": "Seminar, three hours. Requisite: course 244A. Letter grading.",
    "prerequisites": [
      "HIST 244A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST244B"
  },
  {
    "course_code": "HIST 245",
    "units": 4,
    "title": "Colloquium: U.S. History",
    "description": "Seminar, three hours. Normally limited to and required of all entering graduate students in U.S. history. Critical introduction to historical method, with emphasis on new methodological and conceptual approaches, use of source materials, and current state of U.S. historiography.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST245"
  },
  {
    "course_code": "HIST 246A",
    "units": 4,
    "title": "Introduction to U.S. History: Colonial Period",
    "description": "Seminar, three hours. Graduate survey of significant literature dealing with U.S. history from the Colonial period to the present. Each course may be taken independently for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST246A"
  },
  {
    "course_code": "HIST 246B",
    "units": 4,
    "title": "Introduction to U.S. History: 1790 to 1900",
    "description": "Seminar, three hours. Graduate survey of significant literature dealing with U.S. history from the Colonial period to the present. Each course may be taken independently for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST246B"
  },
  {
    "course_code": "HIST 246C",
    "units": 4,
    "title": "Introduction to U.S. History: 20th Century",
    "description": "Seminar, three hours. Graduate survey of significant literature dealing with U.S. history from the Colonial period to the present. Each course may be taken independently for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST246C"
  },
  {
    "course_code": "HIST 247A",
    "units": 4,
    "title": "Seminar: Early American History",
    "description": "Seminar, three hours. Course 247A is requisite to 247B. In Progress grading (credit to be given only on completion of course 247B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST247A"
  },
  {
    "course_code": "HIST 247B",
    "units": 4,
    "title": "Seminar: Early American History",
    "description": "Seminar, three hours. Requisite: course 247A. Letter grading.",
    "prerequisites": [
      "HIST 247A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST247B"
  },
  {
    "course_code": "HIST M248",
    "units": 4,
    "title": "Anthropology and History of Mediterranean",
    "description": "(Same as Anthropology M248 and Near Eastern Languages M248.) Seminar, three hours. Introduction to historical and anthropological writings about Mediterranean. Draws on variety of classic and contemporary theories, histories, and ethnographies about Mediterranean Sea. Topics include geographical and imaginary boundaries, Mediterranean honor/shame concepts, colonial and post-colonial Mediterranean, Levantinism, thalassology, Mediterraneanism, French Mediterraneans, Jewish Mediterranean, colonial and post-colonial sea and migrants and mobilities. Focus on critical history of anthropological study of Mediterranean and scholarly literature that emphasizes southern shores of Mediterranean. Letter grading.",
    "cross_listed": [
      "NR EAST M248",
      "ANTHRO M248"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM248"
  },
  {
    "course_code": "HIST 249A",
    "units": 4,
    "title": "Seminar: Jacksonian America",
    "description": "Seminar, three hours. Course 249A is requisite to 249B. In Progress grading (credit to be given only on completion of course 249B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST249A"
  },
  {
    "course_code": "HIST 249B",
    "units": 4,
    "title": "Seminar: Jacksonian America",
    "description": "Seminar, three hours. Requisite: course 249A. Letter grading.",
    "prerequisites": [
      "HIST 249A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST249B"
  },
  {
    "course_code": "HIST 250A",
    "units": 4,
    "title": "Seminar: U.S. History of Middle 19th Century",
    "description": "Seminar, three hours. Course 250A is requisite to 250B. In Progress grading (credit to be given only on completion of course 250B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST250A"
  },
  {
    "course_code": "HIST 250B",
    "units": 4,
    "title": "Seminar: U.S. History of Middle 19th Century",
    "description": "Seminar, three hours. Requisite: course 250A. Letter grading.",
    "prerequisites": [
      "HIST 250A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST250B"
  },
  {
    "course_code": "HIST 251A",
    "units": 4,
    "title": "Collaborative Research Seminar: American History",
    "description": "Seminar, three hours. Course 251A is requisite to 251B. Research seminar taught jointly by two faculty members. Common readings and development of individual research projects. In Progress grading (credit to be given only on completion of course 251B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST251A"
  },
  {
    "course_code": "HIST 251B",
    "units": 4,
    "title": "Collaborative Research Seminar: American History",
    "description": "Seminar, three hours. Requisite: course 251A. Research seminar taught jointly by two faculty members. Research, writing, and critical discussion of draft papers. Letter grading.",
    "prerequisites": [
      "HIST 251A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST251B"
  },
  {
    "course_code": "HIST 252A",
    "units": 4,
    "title": "Seminar: Recent U.S. History to 1930",
    "description": "Seminar, three hours. Course 252A is requisite to 252B. In Progress grading (credit to be given only on completion of course 252B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST252A"
  },
  {
    "course_code": "HIST 252B",
    "units": 4,
    "title": "Seminar: Recent U.S. History to 1930",
    "description": "Seminar, three hours. Requisite: course 252A. Letter grading.",
    "prerequisites": [
      "HIST 252A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST252B"
  },
  {
    "course_code": "HIST 253A",
    "units": 4,
    "title": "Seminar: Recent U.S. History since 1930",
    "description": "Seminar, three hours. Course 253A is requisite to 253B. In Progress grading (credit to be given only on completion of course 253B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST253A"
  },
  {
    "course_code": "HIST 253B",
    "units": 4,
    "title": "Seminar: Recent U.S. History since 1930",
    "description": "Seminar, three hours. Requisite: course 253A. Letter grading.",
    "prerequisites": [
      "HIST 253A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST253B"
  },
  {
    "course_code": "HIST 254A",
    "units": 4,
    "title": "Seminar: U.S. Social and/or Intellectual History",
    "description": "Seminar, three hours. Course 254A is requisite to 254B. In Progress grading (credit to be given only on completion of course 254B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST254A"
  },
  {
    "course_code": "HIST 254B",
    "units": 4,
    "title": "Seminar: U.S. Social and/or Intellectual History",
    "description": "Seminar, three hours. Requisite: course 254A. Letter grading.",
    "prerequisites": [
      "HIST 254A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST254B"
  },
  {
    "course_code": "HIST 255A",
    "units": 4,
    "title": "Business Enterprise and American Culture",
    "description": "Seminar, three hours. Course 255A is requisite to 255B. In Progress grading (credit to be given only on completion of course 255B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST255A"
  },
  {
    "course_code": "HIST 255B",
    "units": 4,
    "title": "Business Enterprise and American Culture",
    "description": "Seminar, three hours. Requisite: course 255A. Letter grading.",
    "prerequisites": [
      "HIST 255A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST255B"
  },
  {
    "course_code": "HIST 256A",
    "units": 4,
    "title": "Seminar: America in World",
    "description": "Seminar, three hours. Course 256A is requisite to 256B. In Progress grading (credit to be given only on completion of course 256B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST256A"
  },
  {
    "course_code": "HIST 256B",
    "units": 4,
    "title": "Seminar: America in World",
    "description": "Seminar, three hours. Requisite: course 256A. Letter grading.",
    "prerequisites": [
      "HIST 256A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST256B"
  },
  {
    "course_code": "HIST M256C",
    "units": 4,
    "title": "Political Economy of Race",
    "description": "(Same as African American Studies M200B.) Seminar, four hours. Examination of historiography of history of capitalism and history of African diaspora, especially in their overlapping concerns with organization of race and racial states in contemporary world, development of modern imperialism—and emergence of global Black resistance to both. Themes and topics considered may include capitalism and question of slavery; law, regulations, and legal pluralism in organization of markets and nations; uneven development and nature of Black sovereignty; history of regimes of gender and sexuality in social and capital reproduction; modalities of capital accumulation and production of space; racial violence and territorial expansion; emancipation and growth of empire; history of finance capital and its discourses of debt; capitalism and history of anti-Blackness; racism, neoliberalism, and governmentality; and emergence and content of Black radical tradition and its critiques of racial capitalism. S/U or letter grading.",
    "cross_listed": [
      "AF AMER M200B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM256C"
  },
  {
    "course_code": "HIST 257A",
    "units": 4,
    "title": "Seminar: U.S. Urban History",
    "description": "Seminar, three hours. Course 257A is requisite to 257B. In Progress grading (credit to be given only on completion of course 257B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST257A"
  },
  {
    "course_code": "HIST 257B",
    "units": 4,
    "title": "Seminar: U.S. Urban History",
    "description": "Seminar, three hours. Requisite: course 257A. Letter grading.",
    "prerequisites": [
      "HIST 257A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST257B"
  },
  {
    "course_code": "HIST 258A",
    "units": 4,
    "title": "Seminar: Working Class History",
    "description": "Seminar, three hours. Course 258A is requisite to 258B. In Progress grading (credit to be given only on completion of course 258B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST258A"
  },
  {
    "course_code": "HIST 258B",
    "units": 4,
    "title": "Seminar: Working Class History",
    "description": "Seminar, three hours. Requisite: course 258A. Letter grading.",
    "prerequisites": [
      "HIST 258A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST258B"
  },
  {
    "course_code": "HIST M259A",
    "units": 4,
    "title": "History of Women",
    "description": "(Same as Gender Studies M259A.) Seminar, three hours. Course M259A is requisite to M259B. History of women’s social and political issues seen in U.S. and comparative context. In Progress grading (credit to be given only on completion of course M259B).",
    "cross_listed": [
      "GENDER M259A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM259A"
  },
  {
    "course_code": "HIST M259B",
    "units": 4,
    "title": "History of Women",
    "description": "(Same as Gender Studies M259B.) Seminar, three hours. Requisite: course M259A. History of women’s social and political issues seen in U.S. and comparative context. Letter grading.",
    "prerequisites": [
      "HIST M259A"
    ],
    "cross_listed": [
      "GENDER M259B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM259B"
  },
  {
    "course_code": "HIST 260A",
    "units": 4,
    "title": "Seminar: Native American History",
    "description": "Seminar, three hours. Course 260A is requisite to 260B. In Progress grading (credit to be given only on completion of course 260B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST260A"
  },
  {
    "course_code": "HIST 260B",
    "units": 4,
    "title": "Seminar: Native American History",
    "description": "Seminar, three hours. Requisite: course 260A. Letter grading.",
    "prerequisites": [
      "HIST 260A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST260B"
  },
  {
    "course_code": "HIST M260C",
    "units": 4,
    "title": "Native American Revitalization Movements",
    "description": "(Same as Anthropology M238.) Lecture, two hours; discussion, one hour. Examination of revitalization movements among native peoples of North America (north of Mexico). Specific revitalization includes Handsome Lake, 1870 and 1890 Ghost Dances, and Peyote Religion. Letter grading.",
    "cross_listed": [
      "ANTHRO M238"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM260C"
  },
  {
    "course_code": "HIST 261A",
    "units": 4,
    "title": "Seminar: Afro-American History",
    "description": "Seminar, three hours. Course 261A is requisite to 261B. Social and political history of Afro-Americans, including emphasis on development and structure of race relations in America; racial concepts and dilemmas, black and white. In Progress grading (credit to be given only on completion of course 261B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST261A"
  },
  {
    "course_code": "HIST 261B",
    "units": 4,
    "title": "Seminar: Afro-American History",
    "description": "Seminar, three hours. Requisite: course 261A. Social and political history of Afro-Americans, including emphasis on development and structure of race relations in America; racial concepts and dilemmas, black and white. Letter grading.",
    "prerequisites": [
      "HIST 261A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST261B"
  },
  {
    "course_code": "HIST 262A",
    "units": 4,
    "title": "Seminar: Chicano History",
    "description": "Seminar, three hours. Course 262A is requisite to 262B. In Progress grading (credit to be given only on completion of course 262B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST262A"
  },
  {
    "course_code": "HIST 262B",
    "units": 4,
    "title": "Seminar: Chicano History",
    "description": "Seminar, three hours. Requisite: course 262A. Letter grading.",
    "prerequisites": [
      "HIST 262A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST262B"
  },
  {
    "course_code": "HIST 263A",
    "units": 4,
    "title": "Seminar: History of American West",
    "description": "Seminar, three hours. Course 263A is requisite to 263B. In Progress grading (credit to be given only on completion of course 263B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST263A"
  },
  {
    "course_code": "HIST 263B",
    "units": 4,
    "title": "Seminar: History of American West",
    "description": "Seminar, three hours. Requisite: course 263A. Letter grading.",
    "prerequisites": [
      "HIST 263A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST263B"
  },
  {
    "course_code": "HIST M264",
    "units": 4,
    "title": "History of American Education",
    "description": "(Same as Education M201C.) Discussion, three hours. History of educational thought and of social forces impinging on American education from 1880s to present. Analysis of relation between these ideas and forces, and aims and practices of American education today. S/U or letter grading.",
    "cross_listed": [
      "EDUC M201C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM264"
  },
  {
    "course_code": "HIST M265",
    "units": 4,
    "title": "Graduate Writing: Form, Process, and Thought",
    "description": "(Same as East Asian Studies M265.) Seminar, three hours. Designed for East Asian Studies MA students and East Asia-focused doctoral students, but open to all graduate students. Focus on essential skill and craft of graduate-level writing. Consideration of everything from basics about process—drafts and editing—to professional-level questions of relation of form to content, and of writing for broader publics. Specific skills and techniques are connected with the fundamental theories and principles at stake in academic inquiry, and student capacities to participate fully in disciplinary and interdisciplinary work are built. May be repeated once for credit. S/U or letter grading.",
    "cross_listed": [
      "EA STDS M265"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM265"
  },
  {
    "course_code": "HIST 266A",
    "units": 4,
    "title": "Seminar: Colonial Latin American History",
    "description": "Seminar, three hours. Course 266A is requisite to 266B. In Progress grading (credit to be given only on completion of course 266B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST266A"
  },
  {
    "course_code": "HIST 266B",
    "units": 4,
    "title": "Seminar: Colonial Latin American History",
    "description": "Seminar, three hours. Requisite: course 266A. Letter grading.",
    "prerequisites": [
      "HIST 266A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST266B"
  },
  {
    "course_code": "HIST M266C",
    "units": 4,
    "title": "Analyzing Historical Texts",
    "description": "(Same as Indo-European Studies M238 and Linguistics M238.) Seminar, four hours. Designed for graduate students. Analysis of linguistic structure and ethnohistorical context of legal and other documents written by native-speaking scribes and translators. Topics include paleographic technique and text analysis software. May be repeated for credit. S/U grading.",
    "cross_listed": [
      "LING M238",
      "I E STD M238"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM266C"
  },
  {
    "course_code": "HIST 267A",
    "units": 4,
    "title": "Seminar: Latin American History, 19th and 20th Centuries",
    "description": "Seminar, three hours. Course 267A is requisite to 267B. In Progress grading (credit to be given only on completion of course 267B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST267A"
  },
  {
    "course_code": "HIST 267B",
    "units": 4,
    "title": "Seminar: Latin American History, 19th and 20th Centuries",
    "description": "Seminar, three hours. Requisite: course 267A. Letter grading.",
    "prerequisites": [
      "HIST 267A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST267B"
  },
  {
    "course_code": "HIST M268A",
    "units": 4,
    "title": "Seminar: Recent Latin American History",
    "description": "(Same as Latin American Studies M268A.) Seminar, three hours. Course M268A is requisite to M268B. Reading knowledge of Spanish and Portuguese normally required. Seminar devoted to selected topics of interdisciplinary nature. In Progress grading (credit to be given only on completion of course M268B).",
    "cross_listed": [
      "LATN AM M268A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM268A"
  },
  {
    "course_code": "HIST M268B",
    "units": 4,
    "title": "Seminar: Recent Latin American History",
    "description": "(Same as Latin American Studies M268B.) Seminar, three hours. Requisite: course M268A. Reading knowledge of Spanish and Portuguese normally required. Seminar devoted to selected topics of interdisciplinary nature. Letter grading.",
    "prerequisites": [
      "HIST M268A"
    ],
    "cross_listed": [
      "LATN AM M268B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM268B"
  },
  {
    "course_code": "HIST 275A",
    "units": 4,
    "title": "Colloquium: African History",
    "description": "Seminar, three hours. Designed for all entering and continuing graduate students in African history. Source identification, research methodologies, historiographical traditions, historical interpretation, approaches to teaching, and research design. Forum for critical discussion of dissertation prospectuses and work in progress. May be taken independently for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST275A"
  },
  {
    "course_code": "HIST 275B",
    "units": 4,
    "title": "Colloquium: African History",
    "description": "Seminar, three hours. Designed for all entering and continuing graduate students in African history. Source identification, research methodologies, historiographical traditions, historical interpretation, approaches to teaching, and research design. Forum for critical discussion of dissertation prospectuses and work in progress. May be taken independently for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST275B"
  },
  {
    "course_code": "HIST M280",
    "units": 2,
    "title": "China Studies: Discipline, Methods, Debates",
    "description": "(Same as Chinese M202.) Seminar, two hours. Introduction to study of China as practiced in humanities and social sciences disciplines. S/U grading.",
    "cross_listed": [
      "CHIN M202"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM280"
  },
  {
    "course_code": "HIST M281",
    "units": 4,
    "title": "China—Seminar: Classical Historiography and Readings in Classical Studies",
    "description": "(Same as Chinese M201.) Discussion, three hours. Preparation: two years of classical Chinese or working knowledge of classical Chinese. Readings in historiography and selected genres of historical documents. Letter grading.",
    "cross_listed": [
      "CHIN M201"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM281"
  },
  {
    "course_code": "HIST 282A",
    "units": 4,
    "title": "Seminar: Chinese History",
    "description": "Seminar, three hours. Course 282A is requisite to 282B. In Progress grading (credit to be given only on completion of course 282B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST282A"
  },
  {
    "course_code": "HIST 282B",
    "units": 4,
    "title": "Seminar: Chinese History",
    "description": "Seminar, three hours. Requisite: course 282A. Letter grading.",
    "prerequisites": [
      "HIST 282A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST282B"
  },
  {
    "course_code": "HIST 285A",
    "units": 4,
    "title": "Seminar: Japanese History",
    "description": "Seminar, three hours. Course 285A is requisite to 285B. In Progress grading (credit to be given only on completion of course 285B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST285A"
  },
  {
    "course_code": "HIST 285B",
    "units": 4,
    "title": "Seminar: Japanese History",
    "description": "Seminar, three hours. Requisite: course 285A. Letter grading.",
    "prerequisites": [
      "HIST 285A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST285B"
  },
  {
    "course_code": "HIST M286",
    "units": 4,
    "title": "Japan in Age of Empire",
    "description": "(Same as Anthropology M247P and Asian M292.) Seminar, three hours. Designed for graduate students. Since late 19th century, Japan expanded its empire into East and Southeast Asia. Coverage of that period and array of anthropological studies conducted in Japan’s colonies and occupied areas in this hardly explored area of study of colonialism. S/U or letter grading.",
    "cross_listed": [
      "ANTHRO M247P",
      "ASIAN M292"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM286"
  },
  {
    "course_code": "HIST M287",
    "units": 2,
    "title": "Central Asian Studies: Discipline, Methods, Debates",
    "description": "(Same as Anthropology M247Q and Near Eastern Languages M287.) Seminar, two hours. Introduction to study of central Asia as practiced in humanities and social sciences disciplines. S/U grading.",
    "cross_listed": [
      "NR EAST M287",
      "ANTHRO M247Q"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM287"
  },
  {
    "course_code": "HIST 288A",
    "units": 4,
    "title": "Seminar: South Asia",
    "description": "Seminar, three hours. Course 288A is requisite to 288B. In Progress grading (credit to be given only on completion of course 288B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST288A"
  },
  {
    "course_code": "HIST 288B",
    "units": 4,
    "title": "Seminar: South Asia",
    "description": "Seminar, three hours. Requisite: course 288A. Letter grading.",
    "prerequisites": [
      "HIST 288A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST288B"
  },
  {
    "course_code": "HIST 289A",
    "units": 4,
    "title": "Seminar: Southeast Asia",
    "description": "Seminar, three hours. Course 289A is requisite to 289B. In Progress grading (credit to be given only on completion of course 289B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST289A"
  },
  {
    "course_code": "HIST 289B",
    "units": 4,
    "title": "Seminar: Southeast Asia",
    "description": "Seminar, three hours. Requisite: course 289A. Letter grading.",
    "prerequisites": [
      "HIST 289A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST289B"
  },
  {
    "course_code": "HIST 291A",
    "units": 4,
    "title": "Seminar: Jewish History",
    "description": "Seminar, three hours. Course 291A is requisite to 291B. Studies in intellectual and social history of Jewish people from ancient times to modern period. In Progress grading (credit to be given only on completion of course 291B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST291A"
  },
  {
    "course_code": "HIST 291B",
    "units": 4,
    "title": "Seminar: Jewish History",
    "description": "Seminar, three hours. Requisite: course 291A. Studies in intellectual and social history of Jewish people from ancient times to modern period. Letter grading.",
    "prerequisites": [
      "HIST 291A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST291B"
  },
  {
    "course_code": "HIST 293A",
    "units": 4,
    "title": "Seminar: History of Religions",
    "description": "Seminar, three hours. Course 293A is requisite to 293B. In Progress grading (credit to be given only on completion of course 293B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST293A"
  },
  {
    "course_code": "HIST 293B",
    "units": 4,
    "title": "Seminar: History of Religions",
    "description": "Seminar, three hours. Requisite: course 293A. Letter grading.",
    "prerequisites": [
      "HIST 293A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST293B"
  },
  {
    "course_code": "HIST 294A",
    "units": 4,
    "title": "Western Science, Religion, and Political Economy, 1600 to 1830",
    "description": "Seminar, three hours. Study of science integrated within matrix of religious belief commonplace in early modern Europe and, to a lesser extent, in American colonies. Examination of relationship of both cultural matrices to political and economic change. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST294A"
  },
  {
    "course_code": "HIST 294B",
    "units": 4,
    "title": "Western Science, Religion, and Political Economy, 1600 to 1830",
    "description": "Seminar, three hours. Study of science integrated within matrix of religious belief commonplace in early modern Europe and, to a lesser extent, in American colonies. Examination of relationship of both cultural matrices to political and economic change. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST294B"
  },
  {
    "course_code": "HIST 295",
    "units": 4,
    "title": "Theories of Scientific Change",
    "description": "Seminar, three hours. Historical and philosophical perspectives on science, focusing on rationality of scientific change and logic and psychology of scientific discovery. Readings and seminar-style discussions of such authors as Popper, Kuhn, Toulmin, Lakatos, Holton, Buchdahl, Feyerabend, and others.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST295"
  },
  {
    "course_code": "HIST 297A",
    "units": 4,
    "title": "Seminar: History of Science",
    "description": "Seminar, three hours. Course 297A is requisite to 297B. In Progress grading (credit to be given only on completion of course 297B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST297A"
  },
  {
    "course_code": "HIST 297B",
    "units": 4,
    "title": "Seminar: History of Science",
    "description": "Seminar, three hours. Requisite: course 297A. Letter grading.",
    "prerequisites": [
      "HIST 297A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST297B"
  },
  {
    "course_code": "HIST M299",
    "units": 6,
    "title": "Interdisciplinary American Studies",
    "description": "(Same as English M299.) Discussion, four hours. Readings, discussion, and papers on common theme, team-taught by faculty members from different departments. Topics vary according to participating faculty. May be repeated for credit with consent of instructors. S/U or letter grading.",
    "cross_listed": [
      "ENGL M299"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/HISTM299"
  },
  {
    "course_code": "HIST 490",
    "units": 4,
    "title": "Writing Workshop for Graduate Students",
    "description": "Tutorial, three hours. Writing workshop on students’ papers-in-progress. Analysis and group discussion of rhetorical and stylistic principles, illustrated in students’ own and in professional historians’ work, help students improve their own writing. May be repeated once. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST490"
  },
  {
    "course_code": "HIST 495",
    "units": 4,
    "title": "Teaching History",
    "description": "Seminar, to be arranged. Designed for graduate students. Required of all new teaching assistants. Lectures, readings, discussions, and practice teaching sessions within the structure of a seminar. Students receive unit credit toward full-time equivalence but not toward the nine-course requirement for MA degree. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST495"
  },
  {
    "course_code": "HIST 501",
    "units": 2,
    "title": "Cooperative Program",
    "description": "Preparation: consent of UCLA graduate adviser and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST501"
  },
  {
    "course_code": "HIST 596",
    "units": 1,
    "title": "Directed Studies",
    "description": "Limited to graduate students. Individual directed reading arranged with professor. MA candidates may take this course only once. Number of times PhD candidates may take this course is subject to consent of graduate studies committee. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST596"
  },
  {
    "course_code": "HIST 597",
    "units": 1,
    "title": "Directed Studies for Graduate Examinations",
    "description": "Preparation for comprehensive examination or PhD qualifying examinations. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST597"
  },
  {
    "course_code": "HIST 599",
    "units": 1,
    "title": "PhD Research and Writing",
    "description": "Preparation: advancement to PhD candidacy. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/HIST599"
  }
]