[
  {
    "course_code": "I E STD 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD19"
  },
  {
    "course_code": "I E STD M20",
    "units": 5,
    "title": "Visible Language: Study of Writing",
    "description": "(Same as Asian M20, Near Eastern Languages M20, Slavic M20, and Southeast Asian M20.) Lecture, three hours; discussion, one hour. Consideration of concrete means of language representation in writing systems. Earliest representations of language known are those of Near East dating to end of 4th millennium BC. While literate civilizations of Egypt, Indus Valley, China, and Mesoamerica left little evidence of corresponding earliest developments, their antiquity and, in case of China and Mesoamerica, their evident isolation mark these centers as loci of independent developments in writing. Basic characteristics of early scripts, assessment of modern alphabetic writing systems, and presentation of conceptual basis of semiotic language representation. Origins and development of early non-Western writing systems. How Greco-Roman alphabet arose in 1st millennium BC and how it compares to other modern writing systems. P/NP or letter grading.",
    "satisfies": [
      "General Education - Philosophical & Linguistic Analysis (Arts & Humanities)"
    ],
    "cross_listed": [
      "NR EAST M20",
      "SEASIAN M20",
      "SLAVC M20",
      "ASIAN M20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTDM20"
  },
  {
    "course_code": "I E STD M70",
    "units": 5,
    "title": "Language and Evolution",
    "description": "(Same as Linguistics M4.) Lecture, three hours; discussion, one hour. Homo Sapiens is only species on Earth with capacity to create infinite number of utterances from small inventory of speech sounds. How and why our species developed this ability is question of fundamental scientific and humanistic importance. Survey of origin of human language from number of intellectual perspectives, including linguistics, anthropology, and evolutionary biology. Exploration of relationship between language faculty and linguistic theory. P/NP or letter grading.",
    "satisfies": [
      "General Education - Philosophical & Linguistic Analysis (Arts & Humanities)"
    ],
    "cross_listed": [
      "LING M4"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTDM70"
  },
  {
    "course_code": "I E STD 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD89"
  },
  {
    "course_code": "I E STD 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD89HC"
  },
  {
    "course_code": "I E STD 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD99"
  },
  {
    "course_code": "I E STD 131",
    "units": 4,
    "title": "European Archaeology, Neolithic to Bronze Age",
    "description": "Lecture, four hours. Survey of European cultures from beginning of food-producing economy in 7th millennium BC to beginning of Bronze Age in 3rd millennium BC. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD131"
  },
  {
    "course_code": "I E STD 132",
    "units": 4,
    "title": "European Archaeology: The Bronze Age",
    "description": "Requisite: course 131. Survey of European cultures from around 3000 BC to the period of destruction of the Mycenaean culture about 1200 BC. Aegean area and rest of Europe.",
    "prerequisites": [
      "I E STD 131"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD132"
  },
  {
    "course_code": "I E STD 140",
    "units": 4,
    "title": "Food in Language and Myth",
    "description": "Lecture, three hours; discussion, one hour. Introduction to study of food in fields of linguistics and mythology. What is special about language used to talk about food, what is history of food words, and how does language impact appreciation of food? How do myths and narratives revolving around food function in different cultures? Students explore history of food words and learn how to analyze food myths. Students become aware of how language in food is manipulated and how to tell more effective stories about food. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD140"
  },
  {
    "course_code": "I E STD M150",
    "units": 5,
    "title": "Introduction to Indo-European Linguistics",
    "description": "(Same as Linguistics M150.) Lecture, four hours; discussion, one hour (when scheduled). Enforced requisite: Linguistics 1 or 20. Indo-European languages (ancient and modern), including their relationships, chief characteristics, writing systems, and sociolinguistic contexts; nature of reconstructed Indo-European proto-language and proto-culture. One or more Indo-European languages may be investigated in detail. P/NP or letter grading.",
    "prerequisites": [
      "LING 1",
      "LING 20"
    ],
    "cross_listed": [
      "LING M150"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTDM150"
  },
  {
    "course_code": "I E STD C160",
    "units": 4,
    "title": "Indo-European Comparative Mythology and Poetics",
    "description": "Seminar, three hours. Preparation: familiarity with at least one ancient Indo-European language. Comparison of major Indo-European mythological and poetic traditions and reconstruction of their common sources. Topics include divinities and their names; symbolic systems in social context; myths, folk narratives, belief systems; relations with other traditions; literary continuations of mythopoetic material. Concurrently scheduled with course C260. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTDC160"
  },
  {
    "course_code": "I E STD M168A",
    "units": 4,
    "title": "Elementary Hittite",
    "description": "(Formerly numbered M168.) (Same as Ancient Near East M168A.) Lecture, three hours. Recommended preparation: knowledge of language with case system. Introduction to Hittite grammar by series of graded lessons covering morphology and syntax, followed by readings of selected texts from variety of genres. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M168A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTDM168A"
  },
  {
    "course_code": "I E STD M168B",
    "units": 4,
    "title": "Elementary Hittite",
    "description": "(Same as Ancient Near East M168B.) Lecture, three hours. Recommended requisite: course M168A. Readings of selected Hittite texts from variety of genres and historical periods. Individual topics in synchronic and historical grammar of Hittite and in history and culture of Hittites are treated in detail. P/NP or letter grading.",
    "prerequisites": [
      "I E STD M168A"
    ],
    "cross_listed": [
      "AN N EA M168B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTDM168B"
  },
  {
    "course_code": "I E STD M172",
    "units": 4,
    "title": "Elementary Luwian",
    "description": "(Same as Ancient Near East M172.) Lecture, three hours. Recommended preparation: knowledge of language with case system. Introduction to Luwian grammar through lectures covering morphology and syntax, and readings of selected hieroglyphic and cuneiform texts. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M172"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTDM172"
  },
  {
    "course_code": "I E STD 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD189"
  },
  {
    "course_code": "I E STD 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD189HC"
  },
  {
    "course_code": "I E STD 200",
    "units": 2,
    "title": "Proseminar: Indo-European Studies",
    "description": "Seminar, two hours every other week. Required of graduate Indo-European studies students during first year. Introduction to graduate-level research in Indo-European studies. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD200"
  },
  {
    "course_code": "I E STD 205",
    "units": 4,
    "title": "Indo-European Phonology",
    "description": "Lecture, three hours. Requisites: course M150, Linguistics 110. Study of proto-Indo-European phonology and its historical development into most important of oldest attested descendant languages. S/U or letter grading.",
    "prerequisites": [
      "I E STD M150",
      "LING 110"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD205"
  },
  {
    "course_code": "I E STD 210",
    "units": 4,
    "title": "Indo-European Morphology",
    "description": "Lecture, three hours. Comparative study of proto-Indo-European nominal and verbal morphology and its historical development into most important of oldest attested descendant languages. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD210"
  },
  {
    "course_code": "I E STD 215",
    "units": 4,
    "title": "Indo-European Syntax",
    "description": "Lecture, three hours. Requisite: course 210. Comparative and historical study of syntax in proto-Indo-European and most important of oldest attested descendant languages. S/U or letter grading.",
    "prerequisites": [
      "I E STD 210"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD215"
  },
  {
    "course_code": "I E STD M222A",
    "units": 4,
    "title": "Vedic",
    "description": "(Same as Iranian M222A and South Asian M222A.) Lecture, three hours. Preparation: knowledge of Sanskrit equivalent to South Asian 110C. Characteristics of Vedic dialect and readings in Rig-Vedic hymns. May not be repeated for credit. S/U or letter grading.",
    "cross_listed": [
      "S ASIAN M222A",
      "IRANIAN M222A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTDM222A"
  },
  {
    "course_code": "I E STD M222B",
    "units": 4,
    "title": "Vedic",
    "description": "(Same as Iranian M222B and South Asian M222B.) Lecture, three hours. Preparation: knowledge of Sanskrit equivalent to South Asian 110C. Characteristics of Vedic dialect and readings in Rig-Vedic hymns. May be repeated for credit. S/U or letter grading.",
    "cross_listed": [
      "IRANIAN M222B",
      "S ASIAN M222B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTDM222B"
  },
  {
    "course_code": "I E STD M230A",
    "units": 4,
    "title": "Old Iranian",
    "description": "(Same as Iranian M230A.) Lecture, four hours. Studies in grammars and texts of Old Persian and Avestan. Comparative considerations. May not be repeated for credit. S/U or letter grading.",
    "cross_listed": [
      "IRANIAN M230A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTDM230A"
  },
  {
    "course_code": "I E STD M230B",
    "units": 4,
    "title": "Old Iranian",
    "description": "(Same as Iranian M230B.) Lecture, four hours. Studies in grammars and texts of Old Persian and Avestan. Comparative considerations. May be repeated for credit. S/U or letter grading.",
    "cross_listed": [
      "IRANIAN M230B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTDM230B"
  },
  {
    "course_code": "I E STD M238",
    "units": 4,
    "title": "Analyzing Historical Texts",
    "description": "(Same as History M266C and Linguistics M238.) Seminar, four hours. Designed for graduate students. Analysis of linguistic structure and ethnohistorical context of legal and other documents written by native-speaking scribes and translators. Topics include paleographic technique and text analysis software. May be repeated for credit. S/U grading.",
    "cross_listed": [
      "HIST M266C",
      "LING M238"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTDM238"
  },
  {
    "course_code": "I E STD 240",
    "units": 2,
    "title": "Comparative and Historical Grammar of Anatolian",
    "description": "Lecture, three hours. Requisites: courses M150, M168A. Survey of comparative and historical grammar of Anatolian languages, with special focus on its implications for Indo-European reconstruction and for language change broadly. Grammatical features are observed in context through readings of representative texts from Anatolian languages including Hittite, Luwian, Lycian, and Palaic. S/U or letter grading.",
    "prerequisites": [
      "I E STD M150",
      "I E STD M168A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD240"
  },
  {
    "course_code": "I E STD 250A",
    "units": 4,
    "title": "European Archaeology",
    "description": "Seminar, three hours. Studies in ancient European archaeological materials and their relationship to Near East, Western Siberia, and Central Asia. May be repeated for credit. In Progress grading (credit to be given only on completion of course 250B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD250A"
  },
  {
    "course_code": "I E STD 250B",
    "units": 4,
    "title": "European Archaeology",
    "description": "Seminar, three hours. Studies in ancient European archaeological materials and their relationship to Near East, Western Siberia, and Central Asia. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD250B"
  },
  {
    "course_code": "I E STD C260",
    "units": 4,
    "title": "Indo-European Comparative Mythology and Poetics",
    "description": "Seminar, three hours. Preparation: ability to read original sources in at least one ancient Indo-European language. Comparison of major Indo-European mythological and poetic traditions and reconstruction of their common sources. Topics include divinities and their names; symbolic systems in social context; myths, folk narratives, belief systems; relations with other traditions; literary continuations of mythopoetic material. Concurrently scheduled with course C160. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTDC260"
  },
  {
    "course_code": "I E STD 280A",
    "units": 2,
    "title": "Seminar: Indo-European Linguistics",
    "description": "Seminar, three hours. Requisite: course 210. Selected topics in Indo-European comparative grammar for advanced graduate students. S/U or letter grading.",
    "prerequisites": [
      "I E STD 210"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD280A"
  },
  {
    "course_code": "I E STD 280B",
    "units": 2,
    "title": "Seminar: Indo-European Linguistics",
    "description": "Seminar, three hours. Requisite: course 210. Selected topics in Indo-European comparative grammar for advanced graduate students. S/U or letter grading.",
    "prerequisites": [
      "I E STD 210"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD280B"
  },
  {
    "course_code": "I E STD 281A",
    "units": 2,
    "title": "Seminar: Indo-European Linguistics",
    "description": "Seminar, three hours. Requisite: course 210. Selected topics in Indo-European comparative grammar for advanced graduate students. May be repeated for credit. S/U or letter grading.",
    "prerequisites": [
      "I E STD 210"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD281A"
  },
  {
    "course_code": "I E STD 281B",
    "units": 2,
    "title": "Seminar: Indo-European Linguistics",
    "description": "Seminar, three hours. Requisite: course 210. Selected topics in Indo-European comparative grammar for advanced graduate students. May be repeated for credit. S/U or letter grading.",
    "prerequisites": [
      "I E STD 210"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD281B"
  },
  {
    "course_code": "I E STD 596",
    "units": 2,
    "title": "Directed Individual Studies",
    "description": "Tutorial, to be arranged. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD596"
  },
  {
    "course_code": "I E STD 597",
    "units": 2,
    "title": "Preparation for PhD Qualifying Examinations",
    "description": "Tutorial, to be arranged. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD597"
  },
  {
    "course_code": "I E STD 599",
    "units": 2,
    "title": "Research for PhD Dissertation",
    "description": "Tutorial, to be arranged. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IESTD599"
  }
]