[
  {
    "course_code": "INF STD 10",
    "units": 5,
    "title": "Information and Power",
    "description": "Lecture, four hours. Introduction to core concepts of information and power and relation between them in range of social, economic, political, cultural, technological, and institutional contexts. Topics include markets and economies; cultural and media institutions; state interests in information; conflict and warfare; information organization, classification, and access; power and technology infrastructure; and intellectual freedom. Letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD10"
  },
  {
    "course_code": "INF STD 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD19"
  },
  {
    "course_code": "INF STD 20",
    "units": 5,
    "title": "Digital Cultures and Societies",
    "description": "Lecture, four hours. Examination of social and cultural contexts of global digital networks and systems. Exploration of ethical, infrastructural, and political questions raised at intersection of technologies and cultures. Topics include data surveillance, algorithms, artificial intelligence (AI) systems, digital economies and labor, social media revolutions, indigenous and non-Western uses of technology, digital media literacies, and more. Letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD20"
  },
  {
    "course_code": "INF STD 30",
    "units": 5,
    "title": "Internet and Society",
    "description": "Lecture, four hours. Introduction to key historical and sociotechnical developments that have given rise to today's Internet and related information and communication technologies, from networked computing and telecommunications in 20th century to contemporary digital networks and platforms. Focus on economic, political, and cultural consequences of those developments and technologies in society today. Letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD30"
  },
  {
    "course_code": "INF STD 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD89"
  },
  {
    "course_code": "INF STD 97",
    "units": 4,
    "title": "Variable Topics in Information Studies",
    "description": "Seminar, four hours. Designed for freshmen/sophomores, but open to all undergraduate students. Exploration of changing set of basic concepts and issues in study of information, information technology, and society and culture at introductory level. May be repeated for credit with consent of instructor. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD97"
  },
  {
    "course_code": "INF STD 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD99"
  },
  {
    "course_code": "INF STD C115",
    "units": 4,
    "title": "Introduction to Information Literacies",
    "description": "Lecture, four hours. Foundational introduction to current and historical role and impact of information literacy—ability to identify, locate, critically evaluate, use, and create information effectively and ethically, for personal and scholarly uses. Topics include theory and practice related to impact of economic, legal, and social/environmental issues on development of, access to, use, and assessment of information, currently and historically; developing and refining information researching questions; conducting effective information researching; distinguishing among and critically evaluating information researching tools such as Google and databases, as well as types of items, such as ads, opinions, and factual studies; documenting sources used in information researching; effectively helping others learn information researching and critical thinking in support of equity and inclusivity; and designing, creating, and assessing online educational learning objects as positive contributions to addressing social/environmental issues. Concurrently scheduled with course C215. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTDC115"
  },
  {
    "course_code": "INF STD 118",
    "units": 5,
    "title": "Data and Ethics in Society",
    "description": "Seminar, four hours; discussion, one hour. Exploration of moral, social, political, and ethical ramifications of choices we make at different stages in social construction of data. Includes cultivating critical analysis of processes of data collection, data mining, data storage, and deployment of data affected by variety of different communities, publics, nation-states, and individuals. Students learn basics of ethical and socially just frameworks to assess range of data-driven projects and platforms. Students gain understanding of social, historical, and political dilemmas of big data, algorithmic decision-making, predictive analytics, and distinct challenges associated with ethical, civil-, human-, and sovereign-rights models of engaging modern digital information era. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD118"
  },
  {
    "course_code": "INF STD M121",
    "units": 5,
    "title": "Introduction to Media Literacies",
    "description": "(Same as Education M121.) Seminar, four hours. Exploration of relationships between media, technology, and popular culture. Students guided to analyze media representations, question process of normalizing dominant ideologies, and create counter-hegemonic media messages. Through application of critical media literacy framework, students expand notions of literacy to be more inclusive of all types of texts; and deepen their abilities to question power of word, image, and sound-bite to represent social and environmental injustice. Letter grading.",
    "cross_listed": [
      "EDUC M121"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTDM121"
  },
  {
    "course_code": "INF STD M135",
    "units": 5,
    "title": "Environmental Justice through Lens of Media and Education",
    "description": "(Same as Education M135.) Seminar, four hours. Exploration of human relationships with natural world, historically and today. Students take critical look at ways information has been shaped, audiences positioned, and movements manipulated to promote commercial interests over public good. Exploration of progressive movements that have in past challenged—and currently challenge—neoliberal agendas, extractive policies, and unsustainable practices. Letter grading.",
    "cross_listed": [
      "EDUC M135"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTDM135"
  },
  {
    "course_code": "INF STD M137",
    "units": 4,
    "title": "Critical Digital Media Literacies",
    "description": "(Same as Education M137.) Lecture, four hours. Students question relationships with digital media and information society and explore how media and information communication technologies are improving society, strengthening democracy, and opening up opportunities for challenging hegemony and promoting social transformation. Problematization of social media and questioning of ways it is being used to surveil, capture data, spread hate, mislead, distract, and destabilize democracies. Students analyze media representations, question process of normalizing dominant ideologies, and create counter-hegemonic media messages. Combines theoretical foundations of cultural studies and critical pedagogy with practical applications of new digital media and technology, as well as traditional print-based means of communication. Exploration of media representations of race, class, gender, sexual orientation, and other identity markers. Students analyze and create media projects related to education. Letter grading.",
    "cross_listed": [
      "EDUC M137"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTDM137"
  },
  {
    "course_code": "INF STD 139",
    "units": 1,
    "title": "Letterpress Laboratory",
    "description": "Laboratory, one hour. Hands-on printing experience in letterpress shop designed to give students in information studies, design, or other disciplines understanding of printing process. Basic instruction provided, and students work on group project for duration of term. May be repeated twice. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD139"
  },
  {
    "course_code": "INF STD 180",
    "units": 4,
    "title": "Special Topics in Information Studies",
    "description": "Lecture, three hours; discussion, one hour. Designed for juniors/seniors. Selected topics or issues related to social, cultural, economic, or political aspects of information and information systems. Consult Schedule of Classes for topics and instructors. May be repeated once for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD180"
  },
  {
    "course_code": "INF STD 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD188SA"
  },
  {
    "course_code": "INF STD 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "INF STD 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD188SB"
  },
  {
    "course_code": "INF STD 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "INF STD 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD188SC"
  },
  {
    "course_code": "INF STD 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD189"
  },
  {
    "course_code": "INF STD 199",
    "units": 2,
    "title": "Directed Research in Information Studies",
    "description": "Tutorial, one hour. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD199"
  },
  {
    "course_code": "INF STD 200",
    "units": 4,
    "title": "Information in Society",
    "description": "Lecture, two hours; discussion, two hours. Examination of processes by which information and knowledge are created, integrated, disseminated, organized, used, and preserved. Topics include history of communication technologies, evolution of literacy, development of information professions, and social issues related to information access. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD200"
  },
  {
    "course_code": "INF STD 201",
    "units": 4,
    "title": "Ethics, Diversity, and Change in Information Professions",
    "description": "Lecture, two hours; discussion, two hours. Service learning course that serves as forum to discuss, learn, and understand ethical challenges of multicultural information society that shape societal, professional community, and individual views and impact professional practice, decision making, and public policy. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD201"
  },
  {
    "course_code": "INF STD 202",
    "units": 4,
    "title": "History of Books and Literacy Technologies",
    "description": "Lecture, two hours; discussion, 90 minutes. Issues in history of books, writing, and literacy technologies. Investigation of invention of writing, diverse cultural concepts of literacy, earliest use of systematic notation systems in Mesopotamia, and current development of devices and practices that shape contemporary concepts of book of future. Discussion of historical development of technology (tablets, scrolls, codices, illumination and illustration techniques, paper and mass production, photography, digital tools), institutions (libraries, printing and publishing industries), cultural issues and politics (publishing, censorship, colonialism, globalization), formats and styles (type design, graphic design, aesthetics), and some important figures and events in book history. Focused on Western traditions, but not to exclusion of developments in Asia, Near East, Islamic empire, and elsewhere, and questions of cultural diffusion and diversity encouraged. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD202"
  },
  {
    "course_code": "INF STD 203",
    "units": 4,
    "title": "Seminar: Intellectual Freedom and Information Policy Issues",
    "description": "Seminar, four hours. Investigation of concept of intellectual freedom, information policy issues, civil liberties and civil rights, censorship, and other restraints on access to information. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD203"
  },
  {
    "course_code": "INF STD 206",
    "units": 4,
    "title": "Introduction to Economics of Information",
    "description": "Seminar, three and one half hours. Introduction to key concepts, scholars, and studies in economics of information. Topics include economic value and measurement of information, information industries and markets, public goods theories of knowledge and information, network externalities, consequences of intellectual property regimes, information and economic development, information work and occupations, information and organizational processes, productivity paradox, and sectoral analyses of national and global information economies. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD206"
  },
  {
    "course_code": "INF STD 208",
    "units": 4,
    "title": "Scholarly Communication and Bibliometrics",
    "description": "Lecture, four hours. Preparation: one inferential statistics course. Survey of current theory, method, and empirical studies at intersection of scholarly communication and bibliometrics, seeking to understand flow of ideas through published record, whether in print, electronic form, or other media. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD208"
  },
  {
    "course_code": "INF STD 210",
    "units": 4,
    "title": "Global Media and Information",
    "description": "Lecture, three and one half hours. Question of what diversity and culture mean in era of distributed networks and massive technological diffusion looms. Part of this involves problem of how to work with differing ways of knowing, with differing ontologies. It is now widely accepted that global cultures and communities differ in way they practice knowledge, understanding, and making meaning of their worlds. How we draw boundaries around culture and community has become increasingly complicated, as culture becomes increasingly mediated and community has elements of local place and global imagination. How are political, economic, and cultural identities being shaped in global media culture? How does this shape nature of how power functions? How does this impact heritage, economy, politics, and identity? Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD210"
  },
  {
    "course_code": "INF STD 211",
    "units": 4,
    "title": "Artifacts and Cultures",
    "description": "Lecture, two hours; discussion, two hours. Exploration of social, cultural, and technical practices through which meanings, memories, ideas, and knowledge-claims are generated. Concepts are recorded, reproduced, mediated, collected, and appropriated; they are sometimes forged, stolen, or subverted and are often shared, juxtaposed, exhibited, communicated, interpreted, remixed, or repurposed. Their formats may be oral and written, verbal and pictorial, aural and visual, and inscriptive and performative. Artifacts are single-medium and multimedia, static and dynamic, numerical and narrative, scholarly and popular, and analog and digital. They constitute documents, records, data sets, and cultural objects through which information and evidence are authored, published, collocated, exchanged, preserved, and accessed. Examination of these artifacts and their properties, types, and relationships: media, formats, genres, materials, states, contents, components, subjects, structures, functions, aesthetic qualities, roles, costs, affordances, and use values. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD211"
  },
  {
    "course_code": "INF STD 212",
    "units": 4,
    "title": "Values and Communities in Information Professions",
    "description": "Lecture, two hours; discussion, two hours. Forum to discuss, understand, and critique value systems and power structures embedded in information and work in diverse societies. Exploration of importance of thinking locally, from grassroots, in design, evaluation, and engagement with information institutions and technologies, ranging from archives and libraries to Internet. Aspects of information society that shape and are shaped by cultural, societal, professional, community, and individual values, including exploration of impact of such values on professional practice, decision making, and public policy. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD212"
  },
  {
    "course_code": "INF STD 213",
    "units": 4,
    "title": "Current Issues in Librarianship",
    "description": "Lecture, two and one half hours; discussion, one hour. Overview of historical and evolving conceptual foundations of librarianship, including professional associations, key practices, social context of library services, and current issues in library studies. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD213"
  },
  {
    "course_code": "INF STD 214",
    "units": 4,
    "title": "Informatics: Principles and Practices",
    "description": "Lecture, three and one half hours. Theories, principles, and professional practices of informatics, including social analysis of information systems, values and design, infrastructural dynamics, user experience, and prospective analysis. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD214"
  },
  {
    "course_code": "INF STD C215",
    "units": 4,
    "title": "Introduction to Information Literacies",
    "description": "(Formerly numbered 448.) Lecture, four hours. Foundational introduction to current and historical role and impact of information literacy—ability to identify, locate, critically evaluate, use, and create information effectively and ethically, for personal and scholarly uses. Topics include theory and practice related to impact of economic, legal, and social/environmental issues on development of, access to, use, and assessment of information, currently and historically; developing and refining information researching questions; conducting effective information researching; distinguishing among and critically evaluating information researching tools such as Google and databases, as well as types of items, such as ads, opinions, and factual studies; documenting sources used in information researching; effectively helping others learn information researching and critical thinking in support of equity and inclusivity; and designing, creating, and assessing online educational learning objects as positive contributions to addressing social/environmental issues. Concurrently scheduled with course C115. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTDC215"
  },
  {
    "course_code": "INF STD 226",
    "units": 4,
    "title": "Indigenous Librarianship",
    "description": "Lecture, three hours. Exploration of trends and topics in indigenous librarianship (IL), emerging branch of library and information science. Exploration of IL as category of social research that seeks to understand how particularities of sociohistorical, economic, political, and cultural conditions of indigenous communities shape perspectives and practices of collection, organization, preservation, and dissemination of knowledge. Investigation of practices associated with IL, focusing on means of revitalizing indigenous library institutions and knowledge systems; and on procedures and norms to guide responsible and respectful care for materials with indigenous content that are preserved outside of indigenous communities. Recommended for students doing interdisciplinary research with advocacy focus; and for those interested in working with tribal communities and/or collections containing indigenous materials. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD226"
  },
  {
    "course_code": "INF STD 227",
    "units": 4,
    "title": "Information Services in Culturally Diverse Communities",
    "description": "Lecture, four hours. Issues in provision of information services in multiethnic and multilingual society. Understanding role of information institutions in promoting cultural diversity and preserving ethnic heritage. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD227"
  },
  {
    "course_code": "INF STD 228",
    "units": 4,
    "title": "Assessment, Measurement, and Evaluation of Information Organizations and Services",
    "description": "Lecture, four hours. Introduction to assessment and evaluation as formal processes of inquiry with individual components. Demonstration of use of evidence gathered for planning, decision making, and accountability in information organizations. Review and implementation of various methods appropriate to design of assessment and evaluation studies. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD228"
  },
  {
    "course_code": "INF STD M229C",
    "units": 2,
    "title": "Introduction to Slavic Bibliography",
    "description": "(Same as Slavic M229.) Lecture, two hours. Introduction to Slavic and East European bibliography for the humanities and social sciences. Emphasis to be determined by requirements and background of enrolled students. Topics include relevant library terminology and concepts; survey of languages and transliteration systems; acquisition of Slavic and East European library materials; Slavic and East European scholarship in the West; relevant reference sources, archival resources, and research methods; survey of online databases; compilation of bibliographies. S/U grading.",
    "cross_listed": [
      "SLAVC M229"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTDM229C"
  },
  {
    "course_code": "INF STD 233",
    "units": 4,
    "title": "Records and Information Resources Management",
    "description": "Lecture, three hours. Introduction to records and information resources management in corporate, government, and other organizational settings, including analysis of organizational information flow, classification and filing systems, records retention scheduling, records protection and security, reprographics and image management technology, and litigation support. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD233"
  },
  {
    "course_code": "INF STD 234",
    "units": 4,
    "title": "Contemporary Children's Literature",
    "description": "Lecture, four hours. Reading interests and correlative types of literature surveyed with reference to growth and development of children. Emphasis on role of librarian in responding to needs and abilities of children through individualized reading guidance. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD234"
  },
  {
    "course_code": "INF STD M238",
    "units": 4,
    "title": "Environmental Protection of Collections for Museums, Libraries, and Archives",
    "description": "(Same as Conservation M240.) Lecture, two hours; laboratory, two hours. Requisite: course 432. Review of environmental and biological agents of deterioration, including light, temperature, relative humidity, pollution, insects, and fungi. Emphasis on monitoring to identify agents and understanding of materials sensitivities, along with protective measures for collections. Letter grading.",
    "prerequisites": [
      "INF STD 432"
    ],
    "cross_listed": [
      "CLT HTG M240"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTDM238"
  },
  {
    "course_code": "INF STD 239",
    "units": 1,
    "title": "Letterpress Laboratory",
    "description": "Laboratory, two hours. Hands-on printing experience in letterpress shop designed to give students in information studies, design, or other disciplines understanding of printing process. Basic instruction provided, and students work on group project for duration of term. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD239"
  },
  {
    "course_code": "INF STD 240",
    "units": 4,
    "title": "Management of Digital Records",
    "description": "Lecture, three hours. Introduction to long-term management of digital administrative, information, communications, imaging, or research systems and records. Topics include electronic recordkeeping, enterprise and risk management, systems analysis and design, metadata development, data preservation, and technological standards and policy development. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD240"
  },
  {
    "course_code": "INF STD 241",
    "units": 4,
    "title": "Digital Preservation",
    "description": "Lecture, three and one half hours. Nature of digital media and networking necessitates reformulation of traditional concepts such as authenticity, authorship, and originals; information systems and metadata that are specifically designed to manage preservation process; new ethical, rights, and collaborative frameworks; and economic, legal, and policy tools with which to manage digital information over long term. Introduction to strategies, techniques, and standards, as well as continuing challenges related to preserving born-digital/born-networked/digitized materials (e.g., electronic records, digital archives, video games, scientific simulations, digital humanities environments, sound and moving image materials, social media and personal digital archives). Implications for digital preservation of new technologies and their applications. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD241"
  },
  {
    "course_code": "INF STD M244",
    "units": 4,
    "title": "Collection Management for Archives, Libraries, and Museums",
    "description": "(Same as Conservation M244.) Lecture, two hours; fieldwork, two hours. How conservators work together with curators, collections managers, mount makers, designers, and registrars to permit collections to be both accessed and preserved. Letter grading.",
    "cross_listed": [
      "CLT HTG M244"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTDM244"
  },
  {
    "course_code": "INF STD 245",
    "units": 4,
    "title": "Information Access",
    "description": "Lecture, two hours; discussion, one hour. Requisites: courses 200, 260. Provides fundamental knowledge and skills enabling information professionals to link users with information. Overview of structure of literature in different fields; information-seeking behavior of user groups; communication with users; development of search strategies using print and electronic sources. Letter grading.",
    "prerequisites": [
      "INF STD 200",
      "INF STD 260"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD245"
  },
  {
    "course_code": "INF STD 246",
    "units": 4,
    "title": "Information-Seeking Behavior",
    "description": "Lecture, three hours; discussion, one hour. Study of factors and influences, both individual and social, associated with human beings needing, using, and acting on information. Topics include information theory, human information processing, information flow among social and occupational groups, and research on information needs and uses. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD246"
  },
  {
    "course_code": "INF STD 250",
    "units": 4,
    "title": "Techniques and Issues in Information Access",
    "description": "Lecture, four hours. Requisite: course 245. General reference materials (not specific to subject access), with advanced work in reference process and in cognitive and behavioral aspects of inquirers and expert reference librarians. Letter grading.",
    "prerequisites": [
      "INF STD 245"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD250"
  },
  {
    "course_code": "INF STD M253",
    "units": 4,
    "title": "Medical Knowledge Representation",
    "description": "(Same as Bioengineering M226.) Seminar, four hours; outside study, eight hours. Designed for graduate students. Issues related to medical knowledge representation and its application in healthcare processes. Topics include data structures used for representing knowledge (conceptual graphs, frame-based models), different data models for representing spatio-temporal information, rule-based implementations, current statistical methods for discovery of knowledge (data mining, statistical classifiers, and hierarchical classification), and basic information retrieval. Review of work in constructing ontologies, with focus on problems in implementation and definition. Common medical ontologies, coding schemes, and standardized indices/terminologies (SNOMED, UMLS). Letter grading.",
    "cross_listed": [
      "BIOENGR M226"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTDM253"
  },
  {
    "course_code": "INF STD M254",
    "units": 4,
    "title": "Medical Information Infrastructures and Internet Technologies",
    "description": "(Same as Bioengineering M227.) Lecture, four hours; outside study, eight hours. Designed for graduate students. Introduction to networking, communications, and information infrastructures in medical environment. Exposure to basic concepts related to networking at several levels: low-level (TCP/IP, services), medium-level (network topologies), and high-level (distributed computing, Web-based services) implementations. Commonly used medical communication protocols (HL7, DICOM) and current medical information systems (HIS, RIS, PACS). Advances in networking, such as wireless health systems, peer-to-peer topologies, grid/cloud computing. Introduction to security and encryption in networked environments. Letter grading.",
    "cross_listed": [
      "BIOENGR M227"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTDM254"
  },
  {
    "course_code": "INF STD M255",
    "units": 4,
    "title": "Medical Decision Making",
    "description": "(Same as Bioengineering M228.) Lecture, four hours; outside study, eight hours. Designed for graduate students. Overview of issues related to medical decision making. Introduction to concept of evidence-based medicine and decision processes related to process of care and outcomes. Basic probability and statistics to understand research results and evaluations, and algorithmic methods for decision-making processes (Bayes theorem, decision trees). Study design, hypothesis testing, and estimation. Focus on technical advances in medical decision support systems and expert systems, with review of classic and current research. Introduction to common statistical and decision-making software packages to familiarize students with current tools. Letter grading.",
    "cross_listed": [
      "BIOENGR M228"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTDM255"
  },
  {
    "course_code": "INF STD 260",
    "units": 4,
    "title": "Description and Access",
    "description": "Lecture, three and one half hours. Social, cultural, and technical practices—formal and informal, institutional and personal—through which documents, records, and other forms of information are organized and represented. Design, development, and evaluation of techniques and tools, including data models, metadata schemata, search engines, and management systems in support of curatorship, stewardship, discovery, and use. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD260"
  },
  {
    "course_code": "INF STD 262A",
    "units": 4,
    "title": "Data Management and Practice",
    "description": "Lecture, three and one half hours. Designed for MLIS and PhD students. Survey of landscape of data practices and services, including data-intensive research methods; social studies of data practices; comparisons between disciplines; management of data by research teams, data centers, libraries, and archives; practices of data sharing and reuse; and introduction to national and international policy for stewardship of data. Assessment of data archiving needs of one research community and group project to develop real data management plan in partnership with UCLA researchers in other academic departments. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD262A"
  },
  {
    "course_code": "INF STD 262B",
    "units": 4,
    "title": "Data Curation and Policy",
    "description": "Lecture, three and one half hours. Designed for MLIS students. Continuation of course 262A to address topics of data curation and policy in more depth. Data selection and appraisal, archives and repositories, economics of data management, data citation and metrics, technologies for data access and curation, provenance, intellectual property, policy roles of multiple stakeholders in data, and institutional challenges in curation and stewardship of research data. Assessment of data archives and repositories and group project to curate actual data of UCLA researchers in other academic departments. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD262B"
  },
  {
    "course_code": "INF STD 270",
    "units": 4,
    "title": "Systems and Infrastructures",
    "description": "Lecture, four hours. Social, cultural, and technical practices through which information and media infrastructures—networks, systems, technologies, algorithms, interfaces, standards, institutions, bureaucracies, markets—are designed, built, maintained, and evaluated. Ways in which information infrastructures both shape and are shaped by governmental policy, institutional decision making, socioeconomic trends, labor movements, technical advances, and professional and personal value systems, at levels ranging from local to global. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD270"
  },
  {
    "course_code": "INF STD 271",
    "units": 4,
    "title": "Introduction to Computer Systems and Programming",
    "description": "Lecture, three and one half hours. Introduction to computer programming and survey of foundational computer science topics, including boolean logic, computer architecture, operating systems, algorithms, networks, and databases. Focus on practical skills for manipulating library and archive metadata, such as searching, sorting, regular expressions, writing database queries, calling application program interface (API), and handling multiple serialization formats (XML, JSON, CSV, Excel). Emphasis on working with standard metadata encodings, such as MARC and EAD. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD271"
  },
  {
    "course_code": "INF STD 272",
    "units": 4,
    "title": "Human/Computer Interaction",
    "description": "Lecture, four hours. Survey of social, behavioral, design, and evaluation issues in human/computer interaction, with readings from several disciplines. Extensive use of technology demonstrations and class discussions. Recommended for students in any discipline involved in design or implementation of information technologies. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD272"
  },
  {
    "course_code": "INF STD 274",
    "units": 4,
    "title": "Database Management Systems",
    "description": "Lecture, three hours; laboratory, two hours. Theories, principles, and practicalities of database systems, including data models, retrieval mechanisms, evaluation methods, and storage, efficiency, and security considerations. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD274"
  },
  {
    "course_code": "INF STD 275",
    "units": 4,
    "title": "Community Media and Design",
    "description": "Lecture, two hours; laboratory, two hours. Information professionals, scholars, activists, and information creators/designers/architects focus on questions of culture and community to engage students in understanding information resources as cultural objects. Role of cultural heritage institutions within dynamics presented, but most fundamentally on how communities in partnership with information professionals can create, author, and represent information on their own and within their own terms. How new media can begin to serve as tool of empowerment rather than stratification. Study of impacts of technology on larger scales through readings and introductory sketches. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD275"
  },
  {
    "course_code": "INF STD 278",
    "units": 4,
    "title": "Information and Visualization",
    "description": "Lecture, two hours; discussion, 90 minutes. Access to and analysis of information through visualization has become increasingly prevalent as digital tools have made creation of such visualizations easier and more popular. Many software tools for such visualizations come from statistical packages; others come from GIS or spatial mapping, while others are more diagrammatic in design. Basic organization of graphical user interfaces depends on visualization of function, structure of and assumptions about user experience, and other graphical features that embody models of information in daily use. What are ways in which organization of visualization presents arguments about knowledge? What historical and critical tools can be brought into useful dialog with contemporary visualizations? Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD278"
  },
  {
    "course_code": "INF STD 279",
    "units": 4,
    "title": "User Experience Design",
    "description": "Seminar, four hours. Preparation: at least one course from 246, 272, 276, 277, 455. Requisites: courses 200, 260. Content varies from term to term to allow emphasis on specialized topics such as vocabulary control, file design, indexing, classification, text processing, measurement of relevance, evaluation of information systems, and social and policy issues related to information technology and services. Letter grading.",
    "prerequisites": [
      "INF STD 200",
      "INF STD 260"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD279"
  },
  {
    "course_code": "INF STD 280",
    "units": 4,
    "title": "Social Science Research Methodology for Information Studies",
    "description": "Lecture, four hours. Understanding of nature, uses, and practice of research appropriate to information studies. Identification of research problems and design and evaluation of research. Social science quantitative and qualitative methods. Emphasis on inquiry methodology and empirical research. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD280"
  },
  {
    "course_code": "INF STD 281",
    "units": 4,
    "title": "Historical Methodology of Information Studies",
    "description": "Lecture, four hours. Requisite: course 200. Introduction to historical research as it relates to library and information science. Identification of key primary and secondary source material for writing history in field. Critical analysis of selected histories of various areas in the profession. Problem-oriented approach. Letter grading.",
    "prerequisites": [
      "INF STD 200"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD281"
  },
  {
    "course_code": "INF STD 282",
    "units": 4,
    "title": "Design as Research Method",
    "description": "Seminar, three and one half hours. Theories, principles, and application of design as methods for discovery, exploration, and evaluation of user requirements, functionality, values, and system structure. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD282"
  },
  {
    "course_code": "INF STD 285",
    "units": 4,
    "title": "Oral History Principles and Practice",
    "description": "Seminar, three and one half hours. Oral history is structured practice of recording and preserving first-hand information, and making it available to others. Study covers principles and practice of oral history, with strong focus on ethics of recording life stories for long-term preservation and public access. Overview of how oral histories have been collected and disseminated. Focus on best practices for digital audio and video oral history recordings, in both in-person and remote scenarios. Students conduct and process one oral history interview. Students have opportunity to engage with open-source digital oral history collections to review challenges and opportunities of dissemination strategies such as exhibits, publications, and social media campaigns. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD285"
  },
  {
    "course_code": "INF STD 287",
    "units": 4,
    "title": "Ethnographic Research Methods",
    "description": "Seminar, three and one half hours. Introduction to ethnographic research with focus on theory; techniques of engagement (fieldwork, participant observation, interviewing, textual/visual analysis, focus groups, etc.); and analysis and presentation of data. Critical examination of aspects and approaches to doing ethnography, especially in library and information science institutions or organizations; and uses of ethnography in information research. Hands-on exploration of particular methods for gathering, analysis, and presentation of ethnographic material. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD287"
  },
  {
    "course_code": "INF STD 288",
    "units": 2,
    "title": "Research Apprenticeship Course",
    "description": "Seminar, two hours. Use of mentorship model of training graduate students in information studies, with focus on development of graduate student research topics. Assignment of common readings related to these topics; students have opportunity to offer and receive feedback. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD288"
  },
  {
    "course_code": "INF STD 289",
    "units": 4,
    "title": "Seminar: Special Issues in Information Studies",
    "description": "Seminar, three and one half hours. Identification, analysis, and discussion of critical intellectual, social, and technological issues facing the profession. Topics may include (but not limited to) expert systems, literacy, electronic networks, youth at risk, information literacy, historical bibliography, preservation of electronic media, etc. May be repeated with topic change. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD289"
  },
  {
    "course_code": "INF STD 290",
    "units": 1,
    "title": "Research Seminar: Information Studies",
    "description": "Seminar, one to two hours. Designed for PhD students. Emphasis on recent contributions to theory, research, and methodology. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD290"
  },
  {
    "course_code": "INF STD 291A",
    "units": 4,
    "title": "Doctoral Seminar: Theoretical Traditions in Information Studies",
    "description": "Seminar, four hours. Nature of information studies—ontological, epistemological, and ethical accounts of information and of information arts and sciences. Conceptions, theories, and models of information; information-related artifacts, agents, contexts, institutions, practices, properties, values, and related phenomena. Interdisciplinary context—subfields of information studies and cognate disciplines. Frameworks for theory construction, such as critical theory, discourse analysis, hermeneutics, phenomenology, semiotics, social epistemology. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD291A"
  },
  {
    "course_code": "INF STD 291B",
    "units": 4,
    "title": "Special Topics in Theory of Information Studies",
    "description": "Seminar, four hours. Topics include information and evidence—record-keeping and memory-making, personal and community identity, accountability and trust. Information and design—design and implementation of information systems and services, information aesthetics. Information retrieval and knowledge organization. Information seeking, access, and use—contexts, techniques, needs, barriers. Information and power—groups, ideologies, identities, structures. Information and value—information ethics, evaluation of information services. Information policy and law—processes, institutions, players, stakes. Information institutions and professions—domains, ecologies, cultures, communities. Economics, geography, history, philosophy, politics, sociology of information. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD291B"
  },
  {
    "course_code": "INF STD 291C",
    "units": 4,
    "title": "Special Topics in Theory of Information Studies",
    "description": "Seminar, four hours. Enforced requisite: course 291A. Topics include information and evidence—record-keeping and memory-making, personal and community identity, accountability and trust. Information and design—design and implementation of information systems and services, information aesthetics. Information retrieval and knowledge organization. Information seeking, access, and use—contexts, techniques, needs, barriers. Information and power—groups, ideologies, identities, structures. Information and value—information ethics, evaluation of information services. Information policy and law—processes, institutions, players, stakes. Information institutions and professions—domains, ecologies, cultures, communities. Economics, geography, history, philosophy, politics, sociology of information. Letter grading.",
    "prerequisites": [
      "INF STD 291A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD291C"
  },
  {
    "course_code": "INF STD 298A",
    "units": 4,
    "title": "Doctoral Seminar: Research Methods and Design",
    "description": "Seminar, four hour. Survey of quantitative, qualitative, and historical research designs. Ethical issues; conceptualization and measurement; indexes, scales, and sampling; experimental, survey, field, and evaluation research; data analysis. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD298A"
  },
  {
    "course_code": "INF STD 298B",
    "units": 4,
    "title": "Special Topics in Methodology of Information Studies",
    "description": "Seminar, four hours. Topics include anthropological fieldwork methods, archival methodology, bibliographical studies, textual analysis, discourse analysis, historical methods, information visualization, network analysis—bibliometrics, informetrics, scientometrics, social network analysis. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD298B"
  },
  {
    "course_code": "INF STD 298C",
    "units": 4,
    "title": "Special Topics in Methodology of Information Studies",
    "description": "Seminar, four hours. Enforced requisite: course 298A. Topics include anthropological fieldwork methods, archival methodology, bibliographical studies, textual analysis, discourse analysis, historical methods, information visualization, network analysis—bibliometrics, informetrics, scientometrics, social network analysis. Letter grading.",
    "prerequisites": [
      "INF STD 298A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD298C"
  },
  {
    "course_code": "INF STD 400",
    "units": 2,
    "title": "Professional Development and Portfolio Design",
    "description": "Lecture, two hours; discussion, two hours. Preparation: completion of information studies core courses. Drawing on literature from many fields, exploration of issues related to professional development, such as career planning, continuing education, mentoring, and reflective practice; students also engage in process of guided portfolio design for MLIS degree. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD400"
  },
  {
    "course_code": "INF STD 410",
    "units": 4,
    "title": "Management Theory and Practice for Information Professionals",
    "description": "Lecture, two hours; discussion, two hours. Principles and practice of management in all types of organizations where information professionals work. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD410"
  },
  {
    "course_code": "INF STD 422",
    "units": 4,
    "title": "College, University, and Research Libraries",
    "description": "Lecture, four hours. Organization, administration, collections, facilities, finances, and problems of college and university libraries and their relationships within institutions of which they are part. Functions of research libraries and work of their staffs in serving scholars. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD422"
  },
  {
    "course_code": "INF STD 423",
    "units": 4,
    "title": "Public Libraries",
    "description": "Lecture, four hours. Government, organization, and administration of municipal, county, and regional public libraries; developments in changing patterns of public library service. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD423"
  },
  {
    "course_code": "INF STD 424",
    "units": 4,
    "title": "Storytelling",
    "description": "Lecture, two hours; demonstration, two hours. Theory and practice of telling stories to children and adults in public and school libraries. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD424"
  },
  {
    "course_code": "INF STD 425",
    "units": 4,
    "title": "Library Services and Programs for Children",
    "description": "Lecture, two hours; discussion, two hours. Theory and practice of service to children in public libraries. Overview of professional library service to children aged 14 and under; provides opportunities for students to gain experience in particular skills needed to provide that service. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD425"
  },
  {
    "course_code": "INF STD 426",
    "units": 4,
    "title": "Young Adult Literature",
    "description": "Lecture, four hours. Overview of literature which is of interest to young adults (seventh grade and above). Discussion of special problems in working with young people and psychology of teenagers. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD426"
  },
  {
    "course_code": "INF STD 427",
    "units": 4,
    "title": "Young Adult Services",
    "description": "Lecture, 90 minutes; discussion, two hours. Theory and practice of service to teens and tweens in libraries. Overview of professional library service to youth aged 11 and over; opportunities for students to gain experience in particular skills needed to provide that service. Discussion of special challenges in working with young people and psychology of teenagers. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD427"
  },
  {
    "course_code": "INF STD 430",
    "units": 4,
    "title": "Library Collection Development",
    "description": "Lecture, three and one half hours. Background of publishing and book trade from digital to antiquarian pertinent to development of collections in public, school, academic, and special libraries. Theory and practice of collection development and management, including evaluation of library user needs and assessments of collections. Organization and administration of acquisition and collection development departments. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD430"
  },
  {
    "course_code": "INF STD 431",
    "units": 4,
    "title": "Archives, Records, and Memory",
    "description": "Lecture, four hours. Overview of historical and evolving conceptual foundations, major professional institutions, key practices, and contemporary issues and concerns of archival studies and American archival profession, as well as other fields interested in archives, records, and memory. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD431"
  },
  {
    "course_code": "INF STD 432",
    "units": 4,
    "title": "Issues and Problems in Preservation of Heritage Materials",
    "description": "Lecture, six hours. Introduction to fields of library conservation and preservation, with emphasis on preservation administration. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD432"
  },
  {
    "course_code": "INF STD 433",
    "units": 4,
    "title": "Community-Based Archiving",
    "description": "Lecture, three and one half hours. Builds on student understanding of and experience working with communities on development of practical strategies for documenting their activities; managing, collecting, and preserving their records and other historical and cultural materials; and undertaking community-centric collaborative research. Students required to reflect critically on questions about definition, community memory and recordkeeping practices, motivations, positionality and politics, voice, ethics, advocacy, funding and long-term sustainability, ownership, access and use, technological implementation, and collaborations. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD433"
  },
  {
    "course_code": "INF STD 434",
    "units": 4,
    "title": "Archival Use and Users",
    "description": "Lecture, three and one half hours. Requisite: course 431. Examination of who uses archives and why, with ultimate goal of creating ways to better understand and meet needs of these users as well as engage new audiences in archival use. While archivists have traditionally conceived of their users as academic researchers, more thorough investigation expands this conception of users to include genealogists, artists, K-12 students and educators, families of victims of human rights abuse, community members, and members of general public. Methods for studying users, ways to conduct outreach to target user groups, and ways in which archivists can engage general public. Letter grading.",
    "prerequisites": [
      "INF STD 431"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD434"
  },
  {
    "course_code": "INF STD 438A",
    "units": 4,
    "title": "Seminar: Advanced Issues in Archival Science—Archival Appraisal",
    "description": "Seminar, four hours. Requisite: course 431. Evaluation and examination of contributions of key figures in development of archival appraisal theory; identification and evaluation of distinct movements in archival appraisal; identification of cultural, political, sociological, and technological movements that can have impact on appraisal methodologies. Letter grading.",
    "prerequisites": [
      "INF STD 431"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD438A"
  },
  {
    "course_code": "INF STD 438B",
    "units": 4,
    "title": "Seminar: Advanced Issues in Archival Science—Archival Description and Access Systems",
    "description": "Seminar, four hours. Requisite: course 431. Exploration of history of archival description and access systems in the U.S. and their development since World War II; data collection; access tools and implications of these issues in development of online archival access systems. Letter grading.",
    "prerequisites": [
      "INF STD 431"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD438B"
  },
  {
    "course_code": "INF STD 439",
    "units": 4,
    "title": "Seminar: Special Collections",
    "description": "Seminar, two hours; discussion, 90 minutes. Students work with special collections materials on one focused theme or topic and have to think through research aspects of exhibit or symposium or collection assessment and then create well-focused and curated agenda for presentation, exhibition, or preservation of materials. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD439"
  },
  {
    "course_code": "INF STD 461",
    "units": 4,
    "title": "Descriptive Cataloging",
    "description": "Lecture, four hours. Entry and description of library materials. Constitution, structure, and form of library catalog. Cataloging services, tools, and procedures. Cataloging rules and their application. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD461"
  },
  {
    "course_code": "INF STD 462",
    "units": 4,
    "title": "Subject Cataloging and Classification",
    "description": "Lecture/discussion, four hours. Requisite: course 461. Overview of major alphabetic-subject and systematic indexing languages and their use in manual and online environments, including theory and application of Library of Congress subject headings and of Dewey decimal and Library of Congress classifications. S/U or letter grading.",
    "prerequisites": [
      "INF STD 461"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD462"
  },
  {
    "course_code": "INF STD 463",
    "units": 4,
    "title": "Indexing and Thesaurus Construction",
    "description": "Lecture, four hours. Principles of design and methods of construction of thesauri. Evaluation and overview of thesauri used in manual and online environments. Basic professional techniques for indexing variety of types of materials and for preparing informative and indicative abstracts. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD463"
  },
  {
    "course_code": "INF STD 464",
    "units": 4,
    "title": "Metadata",
    "description": "Lecture, four hours. Introduction to variety of metadata provided for digitized and other electronic information resources. Introductory theory and practice designing and applying metadata. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD464"
  },
  {
    "course_code": "INF STD 480",
    "units": 4,
    "title": "Introduction to Media Archiving and Preservation",
    "description": "Seminar, four hours. Overview of history, conceptual foundations, policies, institutions, and professional methods that have shaped collections of audiovisual materials from early 20th century to present. Introduction to fundamental archival concepts and key practices, including collection development, appraisal, preservation, restoration, arrangement and description, and critical analysis of their specific application to media collections and materials. Discussion of classical and emergent models for media archive administration, including funding, programming, outreach, access, and reuse; changing role of technology in media creation, collection, and preservation; ethics and community standards; different roles of public, private, and national media archives; and cultural impact of historical and contemporary audiovisual media. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD480"
  },
  {
    "course_code": "INF STD 495",
    "units": 2,
    "title": "Teaching Assistant Training Seminar",
    "description": "Seminar, two hours. Limited to departmental doctoral students. Preparation for teaching assistant appointments in departmental undergraduate courses. Principles of instructional design and evaluation, curriculum development, instructional technology use, and key teaching issues (diversity, students with disabilities, academic integrity, copyright). S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD495"
  },
  {
    "course_code": "INF STD 497",
    "units": 4,
    "title": "Fieldwork in Libraries or Information Organizations",
    "description": "Fieldwork, 12 or 24 hours depending on nature and complexity of experience or project. Faculty-directed field experience in approved library, archive, or other information setting. Fieldwork experiences may include opportunities in state, national, and international institutions. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD497"
  },
  {
    "course_code": "INF STD 498",
    "units": 4,
    "title": "Internship",
    "description": "Discussion, to be arranged. Supervised professional training in a library or information center approved by internship coordinator. Minimum of 120 hours per term. May be repeated twice. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD498"
  },
  {
    "course_code": "INF STD 501",
    "units": 2,
    "title": "Cooperative Program",
    "description": "Tutorial, to be arranged. Preparation: consent of graduate adviser and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD501"
  },
  {
    "course_code": "INF STD 596",
    "units": 1,
    "title": "Directed Individual Study or Research",
    "description": "Tutorial, to be arranged. Directed special studies in fields of bibliography, librarianship, and information science. Variable conference time depending on nature of study or complexity of research. No more than 8 units may be applied toward course requirement for MLIS degree. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD596"
  },
  {
    "course_code": "INF STD 597",
    "units": 2,
    "title": "Directed Studies for PhD Qualifying Examinations",
    "description": "Tutorial, to be arranged. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD597"
  },
  {
    "course_code": "INF STD 598",
    "units": 2,
    "title": "MLIS Thesis Research and Writing",
    "description": "Tutorial, to be arranged. Designed for graduate library and information science students. Supervised independent research for candidates in MLIS thesis option. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD598"
  },
  {
    "course_code": "INF STD 599",
    "units": 2,
    "title": "PhD Research and Writing",
    "description": "Tutorial, to be arranged. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/INFSTD599"
  }
]