[
  {
    "course_code": "MATH 1",
    "units": 4,
    "title": "Precalculus",
    "description": "Lecture, three hours; discussion, one hour. Preparation: three years of high school mathematics. Requisite: successful completion of Mathematics Diagnostic Test. Function concept. Linear and polynomial functions and their graphs, applications to optimization. Inverse, exponential, and logarithmic functions. Trigonometric functions. P/NP or letter grading.",
    "prerequisites": [],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH1"
  },
  {
    "course_code": "MATH 3A",
    "units": 4,
    "title": "Calculus for Life Sciences Students",
    "description": "Lecture, three hours; discussion, one hour. Preparation: three and one half years of high school mathematics (including trigonometry). Enforced requisite: successful completion of Mathematics Diagnostic Test (score of 48 or better) or course 1 with grade of C– or better. Not open for credit to students with credit in another calculus sequence. Modeling with functions, limits, and derivatives, decisions and optimization in biology, derivative rules and tools. P/NP or letter grading.",
    "satisfies": [
      "Quantitative Reasoning"
    ],
    "prerequisites": [
      "MATH 48",
      "MATH 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH3A"
  },
  {
    "course_code": "MATH 3B",
    "units": 4,
    "title": "Calculus for Life Sciences Students",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 3A with grade of C– or better. Not open for credit to students with credit for course 31B. Applications of differentiation, integration, differential equations, linear models in biology, phase lines and classifying equilibrium values, bifurcations. P/NP or letter grading.",
    "prerequisites": [
      "MATH 3A"
    ],
    "credit_exclusions": [
      "MATH 31B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH3B"
  },
  {
    "course_code": "MATH 3C",
    "units": 4,
    "title": "Ordinary Differential Equations with Linear Algebra for Life Sciences Students",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 3B with grade of C– or better. Multivariable modeling, matrices and vectors, eigenvalues and eigenvectors, linear and nonlinear systems of differential equations, probabilistic applications of integration. P/NP or letter grading.",
    "prerequisites": [
      "MATH 3B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH3C"
  },
  {
    "course_code": "MATH 11N",
    "units": 4,
    "title": "Gateway to Mathematics: Number Theory",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 31A, 31B. Introductory number theory course for freshmen and sophomores. Topics include prime number theory and cryptographic applications, factorization theory (in integers and Gaussian integers), Pythagorean triples, Fermat descent (for sums of squares and Fermat quartic), Pell’s equation, and Diophantine approximation. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31A",
      "MATH 31B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH11N"
  },
  {
    "course_code": "MATH 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH19"
  },
  {
    "course_code": "MATH 31A",
    "units": 4,
    "title": "Differential and Integral Calculus",
    "description": "Lecture, three hours; discussion, one hour. Preparation: at least three and one half years of high school mathematics (including some coordinate geometry and trigonometry). Requisite: successful completion of Mathematics Diagnostic Test or course 1 with grade of C– or better. Differential calculus and applications; introduction to integration. P/NP or letter grading.",
    "satisfies": [
      "Quantitative Reasoning"
    ],
    "prerequisites": [
      "Mathematics Diagnostic Test or MATH 1"
    ],
    "equivalent_courses": [
      "MATH 31AL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH31A"
  },
  {
    "course_code": "MATH 31AL",
    "units": 5,
    "title": "Differential and Integral Calculus Laboratory",
    "description": "Lecture, three hours; discussion, one hour; laboratory, one hour. Preparation: at least three and one-half years of high school mathematics (including some coordinate geometry and trigonometry). Requisite: successful completion of Mathematics Diagnostic Test or course 1 with grade of C– or better. Not open for credit to students with credit for course 31A. Intended for students who still need to review precalculus material (laboratory) while starting calculus. Differential calculus and applications; introduction to integration. P/NP or letter grading.",
    "satisfies": [
      "Quantitative Reasoning"
    ],
    "prerequisites": [
      "Mathematics Diagnostic Test or MATH 1"
    ],
    "equivalent_courses": [
      "MATH 31A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH31AL"
  },
  {
    "course_code": "MATH 31B",
    "units": 4,
    "title": "Integration and Infinite Series",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 31A with grade of C– or better. Not open for credit to students with credit for course 3B. Transcendental functions; methods and applications of integration; sequences and series. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31A"
    ],
    "credit_exclusions": [
      "MATH 3B"
    ],
    "equivalent_courses": [
      "MATH 31BH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH31B"
  },
  {
    "course_code": "MATH 31BH",
    "units": 4,
    "title": "Integration and Infinite Series (Honors)",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 31A with grade of B or better. Honors course parallel to course 31B. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31A"
    ],
    "equivalent_courses": [
      "MATH 31B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH31BH"
  },
  {
    "course_code": "MATH 31E",
    "units": 4,
    "title": "Calculus for Economics Students",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 31A with grade of C– or better. Not open for credit to students with credit for course 3B, 3C, or 31B. Calculus for applications to economics. Partial differentiation, implicit functions, exponential and logarithmic functions, extrema, optimization, constrained optimization. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31A"
    ],
    "credit_exclusions": [
      "MATH 3B",
      "MATH 31B",
      "MATH 3C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH31E"
  },
  {
    "course_code": "MATH 32A",
    "units": 4,
    "title": "Calculus of Several Variables",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 31A with grade of C– or better. Introduction to differential calculus of several variables, vector field theory. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31A"
    ],
    "equivalent_courses": [
      "MATH 32AH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH32A"
  },
  {
    "course_code": "MATH 32AH",
    "units": 4,
    "title": "Calculus of Several Variables (Honors)",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 31A with grade of B or better. Honors course parallel to course 32A. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31A"
    ],
    "equivalent_courses": [
      "MATH 32A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH32AH"
  },
  {
    "course_code": "MATH 32B",
    "units": 4,
    "title": "Calculus of Several Variables",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisites: courses 31B and 32A, with grades of C– or better. Introduction to integral calculus of several variables, line and surface integrals. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31B",
      "MATH 32A"
    ],
    "equivalent_courses": [
      "MATH 32BH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH32B"
  },
  {
    "course_code": "MATH 32BH",
    "units": 4,
    "title": "Calculus of Several Variables (Honors)",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisites: courses 31B and 32A, with grades of B or better. Honors course parallel to course 32B. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31B",
      "MATH 32A"
    ],
    "equivalent_courses": [
      "MATH 32B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH32BH"
  },
  {
    "course_code": "MATH M32T",
    "units": 4,
    "title": "Essential Calculus for Mathematical Biologists",
    "description": "(Same as Computational and Systems Biology M32 and Life Sciences M32.) Lecture, three hours; discussion, one hour. Requisites: Life Sciences 30A, 30B. Not open to students with credit for course 31A, 31B, 32A, or 32B. Designed for life sciences students. Methods and results of single and multivariable calculus essential for quantitative training in biology. Limits, differentiation (single and several variables), optimization, integration and methods of integration, Taylor polynomials and applications to approximation, Taylor and other power series, vector valued functions, gradients, and Lagrange multipliers. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 30A",
      "LIFESCI 30B"
    ],
    "credit_exclusions": [
      "MATH 32A",
      "MATH 32B",
      "MATH 31A",
      "MATH 31B"
    ],
    "cross_listed": [
      "LIFESCI M32",
      "C&S BIO M32"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATHM32T"
  },
  {
    "course_code": "MATH 33A",
    "units": 4,
    "title": "Linear Algebra and Applications",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 3B or 31B or 32A with grade of C– or better. Introduction to linear algebra: systems of linear equations, matrix algebra, linear independence, subspaces, bases and dimension, orthogonality, least-squares methods, determinants, eigenvalues and eigenvectors, matrix diagonalization, and symmetric matrices. P/NP or letter grading.",
    "prerequisites": [
      "MATH 3B",
      "MATH 31B",
      "MATH 32A"
    ],
    "equivalent_courses": [
      "MATH 33AH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH33A"
  },
  {
    "course_code": "MATH 33AH",
    "units": 4,
    "title": "Linear Algebra and Applications (Honors)",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 3B or 31B or 32A with grade of B or better. Honors course parallel to course 33A. P/NP or letter grading.",
    "prerequisites": [
      "MATH 3B",
      "MATH 31B",
      "MATH 32A"
    ],
    "equivalent_courses": [
      "MATH 33A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH33AH"
  },
  {
    "course_code": "MATH 33B",
    "units": 4,
    "title": "Differential Equations",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 31B with grade of C– or better. Highly recommended: course 33A. First-order, linear differential equations; second-order, linear differential equations with constant coefficients; power series solutions; linear systems. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH33B"
  },
  {
    "course_code": "MATH 42",
    "units": 4,
    "title": "Introduction to Data-Driven Mathematical Modeling: Life, Universe, and Everything",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 31A, 31B, 32A, 32B, 33A, one statistics course from Statistics 10, 12, 13, one programming course from Computer Science 31, Program in Computing 10A, Statistics 20. Introduction to data-driven mathematical modeling combing data analysis with mechanistic modeling of phenomena from various applications. Topics include model formulation, data visualization, nondimensionalization and order-of-magnitude physics, introduction to discrete and continuous dynamical systems, and introduction to discrete and continuous stochastic models. Examples drawn from many fields and practice problems from Mathematical Contest in Modeling. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31A",
      "MATH 31B",
      "MATH 32A",
      "MATH 32B",
      "MATH 33A",
      "STATS 10",
      "STATS 12",
      "STATS 13",
      "COM SCI 31",
      "PIC 10A",
      "STATS 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH42"
  },
  {
    "course_code": "MATH 61",
    "units": 4,
    "title": "Introduction to Discrete Structures",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 31A, 31B. Not open for credit to students with credit for course 180 or 184. Discrete structures commonly used in computer science and mathematics, including sets and relations, permutations and combinations, graphs and trees, induction. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31A",
      "MATH 31B"
    ],
    "credit_exclusions": [
      "MATH 184",
      "MATH 180"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH61"
  },
  {
    "course_code": "MATH 70",
    "units": 4,
    "title": "Introduction to Probability",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 31A, 31B. Introduction to probability through applications and examples. Topics include laws of large numbers, statistics, chance trees, conditional probability, Bayes’ rule, continuous and discrete random variables, jointly distributed random variables, multivariate normal and conditional distributions. In-depth discussion of betting schemes in gambling, occurrence of rare events, coincidences, and statistical predictions. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31A",
      "MATH 31B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH70"
  },
  {
    "course_code": "MATH 73XP",
    "units": 3,
    "title": "Key Issues in K-12 Mathematics",
    "description": "(Formerly numbered 73SL.) Seminar, two hours; fieldwork, two hours. Introduction to K-12 mathematics activity in U.S. Cultivation of interest in teaching through exploration of sequences of mathematical content and habits of mind taught in K-12. Analysis of sequences of topics in current California State Standards in Mathematics (CCSS-M), mathematical structures that underlie these sequences, and cognitive aspects of learning mathematics. Experience with professional mathematician’s habits of mind outlined in CCSS-M (including proof and mathematical modeling), and effective strategies for teaching mathematics to diverse student groups. Fieldwork in local mathematics classroom arranged by Cal Teach program. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH73XP"
  },
  {
    "course_code": "MATH 74XP",
    "units": 3,
    "title": "Mathematics and Pedagogy for Teaching Elementary Mathematics",
    "description": "(Formerly numbered 74SL.) Seminar, two hours; fieldwork, two hours. Development of professional mathematical and pedagogical understandings required to teach California’s K-5 mathematics curriculum. Exploration of K-5 mathematics, practice of effective teaching strategies for all learners, and discussion of current research and standards in mathematics education. Fieldwork in local mathematics classrooms (observation and presenting lesson plan) arranged by Cal Teach program. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH74XP"
  },
  {
    "course_code": "MATH 75XP",
    "units": 3,
    "title": "Mathematics and Pedagogy for Teaching Middle School Mathematics",
    "description": "Seminar, two hours; fieldwork, two hours. Facilitates development of professional mathematical and pedagogical understandings required to teach California middle school mathematics curriculum. Exploration of topics in grades six through eight mathematics from professional perspective, practice with effective teaching strategies for all learnings,and discussion of current research and st andards in mathematics education. Clinical practice in local mathematics classrooms arranged by Cal Teach program. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH75XP"
  },
  {
    "course_code": "MATH 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH89"
  },
  {
    "course_code": "MATH 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH89HC"
  },
  {
    "course_code": "MATH 94",
    "units": 6,
    "title": "Mathematical Outreach: Explorations of Mathematics in the Physical World",
    "description": "Lecture, twelve hours; discussion one hour. Preparation: three years of high school mathematics (to algebra II), some basic familiarity with computers. Uses inquiry-based mathematical modeling as a tool for understanding dynamics of physical systems and chemical processes. Fundamental concepts of single-variable calculus and models of dynamical processes in physics, chemistry, and other subjects in which quantities change with time. Use of computer program C++ for problem solving, plotting, and dynamical simulation in the laboratory. Exploration of current topics in metacognition and education research focused on methods of learning and their practical application in small-group settings. Students practice communication skills with frequent assessment of and feedback on progress. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH94"
  },
  {
    "course_code": "MATH 95",
    "units": 4,
    "title": "Transition to Upper-Division Mathematics",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisites: courses 32A, 32B. Not open for credit to students with credit for course 131A or 132. Introduction to rigorous methods of proof-based upper-division mathematics courses. Basic logic; structure of mathematical proofs; sets, functions, and cardinality; natural numbers and induction; construction of real numbers; topology of real numbers; sequences and convergence; continuity. May not be applied toward major requirements. P/NP or letter grading.",
    "prerequisites": [
      "MATH 32A",
      "MATH 32B"
    ],
    "credit_exclusions": [
      "MATH 131A",
      "MATH 132"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH95"
  },
  {
    "course_code": "MATH 97",
    "units": 4,
    "title": "Variable Topics in Mathematics",
    "description": "Lecture, three hours; discussion, one hour. Study of selected topics in mathematics at introductory level. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH97"
  },
  {
    "course_code": "MATH 98XA",
    "units": 1,
    "title": "PEERS Collaborative Learning Workshops for Life Sciences Majors",
    "description": "Laboratory, three hours. Corequisite: associated undergraduate lecture course in mathematics for life sciences majors. Limited to Program for Excellence in Education and Research in Science (PEERS) students. Development of intuition and problem-solving skills in collaborative learning environment. May be repeated four times, but only 1 unit may be applied toward graduation. P/NP grading.",
    "prerequisites": [],
    "corequisites": [],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH98XA"
  },
  {
    "course_code": "MATH 98XB",
    "units": 1,
    "title": "PEERS Collaborative Learning Workshops for Physical Sciences and Engineering Majors",
    "description": "Laboratory, three hours. Corequisite: associated undergraduate lecture course in mathematics for physical sciences and engineering majors. Limited to Program for Excellence in Education and Research in Science (PEERS) students. Development of intuition and problem-solving skills in collaborative learning environment. May be repeated four times, but only 1 unit may be applied toward graduation. P/NP grading.",
    "prerequisites": [],
    "corequisites": [],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH98XB"
  },
  {
    "course_code": "MATH 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH99"
  },
  {
    "course_code": "MATH 100",
    "units": 4,
    "title": "Problem Solving",
    "description": "Lecture, three hours. Requisite: course 31A with grade of C– or better. Problem-solving techniques and mathematical topics useful as preparation for Putnam Examination and similar competitions. Continued fractions, inequalities, modular arithmetic, closed form evaluation of sums and products, problems in geometry, rational functions and polynomials, other nonroutine problems. Participants expected to take Putnam Examination. P/NP grading.",
    "prerequisites": [
      "MATH 31A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH100"
  },
  {
    "course_code": "MATH 101",
    "units": 4,
    "title": "Advanced Problem Solving",
    "description": "Lecture, three hours. Requisite: course 100 or significant experience with mathematical competitions. Enrollment based on one selection test or past Putnam results. Advanced problem solving techniques and mathematical topics useful as preparation for Putnam competition. Problems in abstract algebra, linear algebra, number theory, combinatorics, probability, real and complex analysis, differential, equations, Fourier analysis. Regular practice tests given, similar in difficulty to Putnam competition. May be repeated for maximum of 12 units. P/NP or letter grading.",
    "prerequisites": [
      "MATH 100"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH101"
  },
  {
    "course_code": "MATH 103A",
    "units": 2,
    "title": "Mathematics and Pedagogy for Teaching Middle School Mathematics",
    "description": "Seminar, one hour; fieldwork (classroom observation and participation), two hours. Requisite: course 115A. Course 103A is enforced requisite to 103B, which is enforced requisite to 103C. Facilitates student development in mathematical and pedagogical understandings required to teach middle school mathematics curriculum. Exploration of California’s grades 6 through 8 mathematics from professional perspective, practice with effective teaching strategies for all learners, and discussion of current research and standards in mathematics education with fieldwork in local mathematics classrooms. P/NP (undergraduates) or S/U (graduates) grading.",
    "prerequisites": [
      "MATH 115A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH103A"
  },
  {
    "course_code": "MATH 103B",
    "units": 2,
    "title": "Observation and Participation: Mathematics Instruction",
    "description": "Seminar, one hour; fieldwork (classroom observation and participation), two hours. Enforced requisite: course 103A. Observation, participation, or tutoring in mathematics classes at middle school and secondary levels. May be repeated for credit. P/NP (undergraduates) or S/U (graduates) grading.",
    "prerequisites": [
      "MATH 103A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH103B"
  },
  {
    "course_code": "MATH 103C",
    "units": 2,
    "title": "Observation and Participation: Mathematics Instruction",
    "description": "Seminar, one hour; fieldwork (classroom observation and participation), two hours. Enforced requisite: course 103B. Observation, participation, or tutoring in mathematics classes at middle school and secondary levels. May be repeated for credit. P/NP (undergraduates) or S/U (graduates) grading.",
    "prerequisites": [
      "MATH 103B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH103C"
  },
  {
    "course_code": "MATH 105A",
    "units": 4,
    "title": "Mathematics and Pedagogy for Teaching Secondary School Mathematics",
    "description": "Lecture, four hours; fieldwork, 30 minutes. Requisites: courses 110A (or 117), 120A (or 123), and 131A, with grades of C– or better. Course 105A is requisite to 105B, which is requisite to 105C. Mathematical knowledge and research-based pedagogy needed for teaching key geometry topics in secondary school, including axiomatic systems, measure, and geometric transformations. Introduction to professional standards and current research for teaching secondary school mathematics. Letter grading.",
    "prerequisites": [
      "MATH 110A",
      "MATH 117",
      "MATH 120A",
      "MATH 123",
      "MATH 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH105A"
  },
  {
    "course_code": "MATH 105B",
    "units": 4,
    "title": "Mathematics and Pedagogy for Teaching Secondary School Mathematics",
    "description": "Lecture, four hours; fieldwork, 30 minutes. Requisites: courses 105A, 110A (or 117), 120A (or 123), and 131A, with grades of C– or better. Mathematical knowledge and research-based pedagogy needed for teaching key polynomial, rational, and transcendental functions and related equations in secondary school; professional standards and current research for teaching secondary school mathematics. Letter grading.",
    "prerequisites": [
      "MATH 105A",
      "MATH 110A",
      "MATH 117",
      "MATH 120A",
      "MATH 123",
      "MATH 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH105B"
  },
  {
    "course_code": "MATH 105C",
    "units": 4,
    "title": "Mathematics and Pedagogy for Teaching Secondary School Mathematics",
    "description": "Lecture, four hours; fieldwork, 30 minutes. Requisites: courses 105A, 105B, 110A (or 117), 120A (or 123), and 131A, with grades of C– or better. Mathematical knowledge and research-based pedagogy needed for teaching key analysis, probability, and statistics topics in secondary school; professional standards and current research for teaching secondary school mathematics. Letter grading.",
    "prerequisites": [
      "MATH 105A",
      "MATH 105B",
      "MATH 110A",
      "MATH 117",
      "MATH 120A",
      "MATH 123",
      "MATH 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH105C"
  },
  {
    "course_code": "MATH 106",
    "units": 4,
    "title": "History of Mathematics",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 31A, 31B, 32A. Roots of modern mathematics in ancient Babylonia and Greece, including place value number systems and proof. Development of algebra through Middle Ages to Fermat and Abel, invention of analytic geometry and calculus. Selected topics. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31A",
      "MATH 31B",
      "MATH 32A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH106"
  },
  {
    "course_code": "MATH 110A",
    "units": 4,
    "title": "Algebra",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 115A. Not open for credit to students with credit for course 117. Ring of integers, integral domains, fields, polynomial domains, unique factorization. P/NP or letter grading.",
    "prerequisites": [
      "MATH 115A"
    ],
    "credit_exclusions": [
      "MATH 117"
    ],
    "equivalent_courses": [
      "MATH 110AH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH110A"
  },
  {
    "course_code": "MATH 110AH",
    "units": 4,
    "title": "Algebra (Honors)",
    "description": "Lecture, three hours; discussion, one hour. Honors course parallel to course 110A.",
    "equivalent_courses": [
      "MATH 110A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH110AH"
  },
  {
    "course_code": "MATH 110B",
    "units": 4,
    "title": "Algebra",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 110A or 117. Groups, structure of finite groups. P/NP or letter grading.",
    "prerequisites": [
      "MATH 110A",
      "MATH 117"
    ],
    "equivalent_courses": [
      "MATH 110BH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH110B"
  },
  {
    "course_code": "MATH 110BH",
    "units": 4,
    "title": "Algebra (Honors)",
    "description": "Lecture, three hours; discussion, one hour. Honors course parallel to course 110B.",
    "equivalent_courses": [
      "MATH 110B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH110BH"
  },
  {
    "course_code": "MATH 110C",
    "units": 4,
    "title": "Algebra",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 110A, 110B. Field extensions, Galois theory, applications to geometric constructions, and solvability by radicals.",
    "prerequisites": [
      "MATH 110A",
      "MATH 110B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH110C"
  },
  {
    "course_code": "MATH 111",
    "units": 4,
    "title": "Theory of Numbers",
    "description": "Lecture, three hours; discussion, one hour. Requisite: courses 110A. Algebraic number theory (including prime ideal theory), cyclotomic fields and reciprocity laws, Diophantine equations (especially quadratic forms, elliptic curves), equations over finite fields, topics in theory of primes, including prime number theorem and Dirichlet’s theorem. P/NP or letter grading.",
    "prerequisites": [
      "MATH 110A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH111"
  },
  {
    "course_code": "MATH 114C",
    "units": 4,
    "title": "Computability Theory",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 110A or 131A or Philosophy 135. Effectively calculable, Turing computable, and recursive functions; Church/Turing thesis. Normal form theorem; universal functions; unsolvability and undecidability results. Recursive and recursively enumerable sets; relative recursiveness, polynomial-time computability. Arithmetical hierarchy. P/NP or letter grading.",
    "prerequisites": [
      "MATH 110A",
      "MATH 131A",
      "PHIL 135"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH114C"
  },
  {
    "course_code": "MATH 114L",
    "units": 4,
    "title": "Mathematical Logic",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 110A or 131A or Philosophy 135. Introduction to mathematical logic, aiming primarily at completeness and incompleteness theorems of Gödel. Propositional and predicate logic; syntax and semantics; formal deduction; completeness, compactness, and Lowenheim/Skolem theorems. Formal number theory: nonstandard models; Gödel incompleteness theorem. P/NP or letter grading.",
    "prerequisites": [
      "MATH 110A",
      "MATH 131A",
      "PHIL 135"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH114L"
  },
  {
    "course_code": "MATH M114S",
    "units": 4,
    "title": "Introduction to Set Theory",
    "description": "(Same as Philosophy M134.) Lecture, three hours; discussion, one hour. Requisite: course 110A or 131A or Philosophy 135. Axiomatic set theory as framework for mathematical concepts; relations and functions, numbers, cardinality, axiom of choice, transfinite numbers. P/NP or letter grading.",
    "prerequisites": [
      "MATH 110A",
      "MATH 131A",
      "PHIL 135"
    ],
    "cross_listed": [
      "PHILOS M134"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATHM114S"
  },
  {
    "course_code": "MATH 115A",
    "units": 5,
    "title": "Linear Algebra",
    "description": "Lecture, three hours; discussion, two hours. Requisite: course 33A. Techniques of proof, abstract vector spaces, linear transformations, and matrices; determinants; inner product spaces; eigenvector theory. P/NP or letter grading.",
    "prerequisites": [
      "MATH 33A"
    ],
    "equivalent_courses": [
      "MATH 115AH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH115A"
  },
  {
    "course_code": "MATH 115AH",
    "units": 5,
    "title": "Linear Algebra (Honors)",
    "description": "Lecture, three hours; discussion, two hours. Requisite: course 33A with grade of B or better. Honors course parallel to course 115A. P/NP or letter grading.",
    "prerequisites": [
      "MATH 33A"
    ],
    "equivalent_courses": [
      "MATH 115A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH115AH"
  },
  {
    "course_code": "MATH 115B",
    "units": 4,
    "title": "Linear Algebra",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 115A. Linear transformations, conjugate spaces, duality; theory of a single linear transformation, Jordan normal form; bilinear forms, quadratic forms; Euclidean and unitary spaces, symmetric skew and orthogonal linear transformations, polar decomposition. P/NP or letter grading.",
    "prerequisites": [
      "MATH 115A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH115B"
  },
  {
    "course_code": "MATH 116",
    "units": 4,
    "title": "Mathematical Cryptology",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 115A. Not open for credit to students with credit for Program in Computing 130. Introduction to mathematical cryptology using methods of number theory, algebra, probability. Topics include symmetric and public-key cryptosystems, one-way functions, signatures, key exchange, groups, primes, pseudoprimes, primality tests, quadratic reciprocity, factoring, rho method, RSA, discrete logs. P/NP or letter grading.",
    "prerequisites": [
      "MATH 115A"
    ],
    "equivalent_courses": [
      "COMPTNG 130"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH116"
  },
  {
    "course_code": "MATH 117",
    "units": 4,
    "title": "Algebra for Applications",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 115A. Not open for credit to students with credit for course 110A. Integers, congruences; fields, applications of finite fields; polynomials; permutations, introduction to groups.",
    "prerequisites": [
      "MATH 115A"
    ],
    "credit_exclusions": [
      "MATH 110A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH117"
  },
  {
    "course_code": "MATH 118",
    "units": 4,
    "title": "Mathematical Methods of Data Theory",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 42, 115A. Introduction to computational methods for data problems with focus on linear algebra and optimization. Matrix and tensor factorization, PageRank, assorted other topics in matrices, linear programming, unconstrained optimization, constrained optimization, integer optimization, dynamic programming, and stochastic optimization. P/NP or letter grading.",
    "prerequisites": [
      "MATH 42",
      "MATH 115A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH118"
  },
  {
    "course_code": "MATH 120A",
    "units": 4,
    "title": "Differential Geometry",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33B, 115A, 131A. Course 120A is requisite to 120B. Curves in 3-space, Frenet formulas, surfaces in 3-space, normal curvature, Gaussian curvature, congruence of curves and surfaces, intrinsic geometry of surfaces, isometries, geodesics, Gauss/Bonnet theorem. P/NP or letter grading.",
    "prerequisites": [
      "MATH 32B",
      "MATH 33B",
      "MATH 115A",
      "MATH 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH120A"
  },
  {
    "course_code": "MATH 120B",
    "units": 4,
    "title": "Differential Geometry",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33B, 115A, 120A, 131A. Curves in 3-space, Frenet formulas, surfaces in 3-space, normal curvature, Gaussian curvature, congruence of curves and surfaces, intrinsic geometry of surfaces, isometries, geodesics, Gauss/Bonnet theorem. P/NP or letter grading.",
    "prerequisites": [
      "MATH 32B",
      "MATH 33B",
      "MATH 115A",
      "MATH 120A",
      "MATH 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH120B"
  },
  {
    "course_code": "MATH 121",
    "units": 4,
    "title": "Introduction to Topology",
    "description": "Requisite: course 131A. Metric and topological spaces, completeness, compactness, connectedness, functions, continuity, homeomorphisms, topological properties.",
    "prerequisites": [
      "MATH 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH121"
  },
  {
    "course_code": "MATH 123",
    "units": 4,
    "title": "Foundations of Geometry",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 115A. Axioms and models, Euclidean geometry, Hilbert axioms, neutral (absolute) geometry, hyperbolic geometry, Poincaré model, independence of parallel postulate.",
    "prerequisites": [
      "MATH 115A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH123"
  },
  {
    "course_code": "MATH 131A",
    "units": 4,
    "title": "Analysis",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33B. Recommended: course 115A. Rigorous introduction to foundations of real analysis; real numbers, point set topology in Euclidean space, functions, continuity. P/NP or letter grading.",
    "prerequisites": [
      "MATH 32B",
      "MATH 33B"
    ],
    "equivalent_courses": [
      "MATH 131AH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH131A"
  },
  {
    "course_code": "MATH 131AH",
    "units": 4,
    "title": "Analysis (Honors)",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B and 33B, with grades of B or better. Recommended: course 115A. Honors course parallel to course 131A. P/NP or letter grading.",
    "prerequisites": [
      "MATH 32B",
      "MATH 33B"
    ],
    "equivalent_courses": [
      "MATH 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH131AH"
  },
  {
    "course_code": "MATH 131B",
    "units": 4,
    "title": "Analysis",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 33B, 115A, 131A. Derivatives, Riemann integral, sequences and series of functions, power series, Fourier series. P/NP or letter grading.",
    "prerequisites": [
      "MATH 33B",
      "MATH 115A",
      "MATH 131A"
    ],
    "equivalent_courses": [
      "MATH 131BH"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH131B"
  },
  {
    "course_code": "MATH 131BH",
    "units": 4,
    "title": "Analysis (Honors)",
    "description": "Lecture, three hours; discussion, one hour. Honors course parallel to course 131B. P/NP or letter grading.",
    "equivalent_courses": [
      "MATH 131B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH131BH"
  },
  {
    "course_code": "MATH 131C",
    "units": 4,
    "title": "Topics in Analysis",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 131A-131B. Advanced topics in analysis, such as Lebesgue integral, integration on manifolds, harmonic analysis. Content varies from year to year. May be repeated for credit by petition.",
    "prerequisites": [
      "MATH 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH131C"
  },
  {
    "course_code": "MATH 132",
    "units": 4,
    "title": "Complex Analysis for Applications",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33B. Introduction to basic formulas and calculation procedures of complex analysis of one variable relevant to applications. Topics include Cauchy/Riemann equations, Cauchy integral formula, power series expansion, contour integrals, residue calculus.",
    "prerequisites": [
      "MATH 32B",
      "MATH 33B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH132"
  },
  {
    "course_code": "MATH 132H",
    "units": 4,
    "title": "Complex Analysis (Honors)",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33B, and 131A, with grades of B or better. Specifically designed for students who have strong commitment to pursue graduate studies in mathematics. Introduction to complex analysis, with more emphasis on proofs. Honors course parallel to course 132. P/NP or letter grading.",
    "prerequisites": [
      "MATH 32B",
      "MATH 33B",
      "MATH 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH132H"
  },
  {
    "course_code": "MATH 133",
    "units": 4,
    "title": "Introduction to Fourier Analysis",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 33A, 33B, 131A. Fourier series, Fourier transform in one and several variables, finite Fourier transform. Applications, in particular, to solving differential equations. Fourier inversion formula, Plancherel theorem, convergence of Fourier series, convolution. P/NP or letter grading.",
    "prerequisites": [
      "MATH 33A",
      "MATH 33B",
      "MATH 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH133"
  },
  {
    "course_code": "MATH 134",
    "units": 4,
    "title": "Linear and Nonlinear Systems of Differential Equations",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 33B. Dynamical systems analysis of nonlinear systems of differential equations. One- and two- dimensional flows. Fixed points, limit cycles, and stability analysis. Bifurcations and normal forms. Elementary geometrical and topological results. Applications to problems in biology, chemistry, physics, and other fields. P/NP or letter grading.",
    "prerequisites": [
      "MATH 33B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH134"
  },
  {
    "course_code": "MATH 135",
    "units": 4,
    "title": "Ordinary Differential Equations",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 33A, 33B. Selected topics in differential equations. Laplace transforms, existence and uniqueness theorems, Fourier series, separation of variable solutions to partial differential equations, Sturm/Liouville theory, calculus of variations, two-point boundary value problems, Green’s functions. P/NP or letter grading.",
    "prerequisites": [
      "MATH 33A",
      "MATH 33B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH135"
  },
  {
    "course_code": "MATH 136",
    "units": 4,
    "title": "Partial Differential Equations",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 33A, 33B. Linear partial differential equations, boundary and initial value problems; wave equation, heat equation, and Laplace equation; separation of variables, eigenfunction expansions; selected topics, as method of characteristics for nonlinear equations.",
    "prerequisites": [
      "MATH 33A",
      "MATH 33B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH136"
  },
  {
    "course_code": "MATH 142",
    "units": 4,
    "title": "Mathematical Modeling",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33B. Introduction to fundamental principles and spirit of applied mathematics. Emphasis on manner in which mathematical models are constructed for physical problems. Illustrations from many fields of endeavor, such as physical sciences, biology, economics, and traffic dynamics.",
    "prerequisites": [
      "MATH 32B",
      "MATH 33B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH142"
  },
  {
    "course_code": "MATH 146",
    "units": 4,
    "title": "Methods of Applied Mathematics",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33B. Integral equations, Green’s function, and calculus of variations. Selected applications from control theory, optics, dynamical systems, and other engineering problems.",
    "prerequisites": [
      "MATH 32B",
      "MATH 33B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH146"
  },
  {
    "course_code": "MATH M148",
    "units": 4,
    "title": "Experience of Data Science",
    "description": "(Same as Statistics M148.) Lecture, four hours. Requisites: courses 118, 131A, 156 or Statistics 101C, 170S or Statistics 100B, Statistics 101A. Students solve real data science problems for community- or campus-based clients. Students work in small groups with faculty member and client to frame client’s question in data science terms, create mathematical models, analyze data, and report results. Students may elect to undertake research on foundations of data science, studying advanced topics and writing senior thesis with discussion of findings or survey of literature on chosen foundational topic. Development of collaborative skills, communication principles, and discussion of ethical issues. Letter grading.",
    "prerequisites": [
      "MATH 118",
      "MATH 131A",
      "MATH 156",
      "STATS 101C",
      "STATS 170S",
      "STATS 100B",
      "STATS 101A"
    ],
    "cross_listed": [
      "STATS M148"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATHM148"
  },
  {
    "course_code": "MATH 151A",
    "units": 4,
    "title": "Applied Numerical Methods",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33B, 115A, Program in Computing 10A or Computer Science 31. Introduction to numerical methods with emphasis on algorithms, analysis of algorithms, and computer implementation issues. Solution of nonlinear equations. Numerical differentiation, integration, and interpolation. Direct methods for solving linear systems. Letter grading.",
    "prerequisites": [
      "MATH 32B",
      "MATH 33B",
      "MATH 115A",
      "PIC 10A",
      "COM SCI 31"
    ],
    "equivalent_courses": [
      "MATH 151AH",
      "Numerical Analysis Part 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH151A"
  },
  {
    "course_code": "MATH 151AH",
    "units": 4,
    "title": "Numerical Analysis Part 1 (Honors)",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33B, 115A, 131A, Computer Science 31 or Programming in Computing 10A or equivalent, with grades of B or better. Not open for credit to students with credit for course 151A. Rigorous introduction to numerical algorithms including necessary skills to apply algorithms in statistics, imaging, data science, engineering, and related fields. Root finding, solving linear systems, interpolation, quadrature, and finding eigenvalues. MATLAB programming. P/NP or letter grading.",
    "prerequisites": [
      "MATH 32B",
      "MATH 33B",
      "MATH 115A",
      "MATH 131A",
      "COM SCI 31",
      "Programming in Computing 10A"
    ],
    "equivalent_courses": [
      "MATH 151A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH151AH"
  },
  {
    "course_code": "MATH 151B",
    "units": 4,
    "title": "Applied Numerical Methods",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 151A. Introduction to numerical methods with emphasis on algorithms, analysis of algorithms, and computer implementation issues. Solution of nonlinear equations. Numerical differentiation, integration, and interpolation. Direct methods for solving linear systems. Letter grading.",
    "prerequisites": [
      "MATH 151A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH151B"
  },
  {
    "course_code": "MATH 151BH",
    "units": 4,
    "title": "Numerical Analysis Part 2 (Honors)",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 115A or 115AH, 131A or 131AH, 151A or 151AH, Computer Science 31 or Programming in Computing 10A, with grades of B or better. Rigorous introduction to numerical algorithms including necessary skills to apply algorithms in statistics, imaging, data science, engineering and related fields. Finding eigenvalues, finding numerical solutions to ordinary differential equations, the least squares problem and the fast Fourier transform. MATLAB programming. Honors course parallel to course 151B. P/NP or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 115AH",
      "MATH 131A",
      "MATH 131AH",
      "MATH 151A",
      "MATH 151AH",
      "COM SCI 31",
      "Programming in Computing 10A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH151BH"
  },
  {
    "course_code": "MATH 155",
    "units": 4,
    "title": "Mathematical Imaging",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33B, 115A, Program in Computing 10A or Computer Science 31. Imaging geometry. Image transforms. Enhancement, restoration, and segmentation. Descriptors. Morphology. P/NP or letter grading.",
    "prerequisites": [
      "MATH 32B",
      "MATH 33B",
      "MATH 115A",
      "PIC 10A",
      "COM SCI 31"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH155"
  },
  {
    "course_code": "MATH 156",
    "units": 4,
    "title": "Machine Learning",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 115A, 164, 170A or 170E or Statistics 100A, and Computer Science 31 or Program in Computing 10A. Strongly recommended requisite: Program in Computing 16A or Statistics 21. Introductory course on mathematical models for pattern recognition and machine learning. Topics include parametric and nonparametric probability distributions, curse of dimensionality, correlation analysis and dimensionality reduction, and concepts of decision theory. Advanced machine learning and pattern recognition problems, including data classification and clustering, regression, kernel methods, artificial neural networks, hidden Markov models, and Markov random fields. Projects in MATLAB to be part of final project presented in class. P/NP or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 164",
      "MATH 170A",
      "MATH 170E",
      "STATS 100A",
      "COM SCI 31",
      "PIC 10A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH156"
  },
  {
    "course_code": "MATH 164",
    "units": 4,
    "title": "Optimization",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisites: courses 115A, 131A. Not open for credit to students with credit for former Electrical Engineering 136. Fundamentals of optimization. Linear programming: basic solutions, simplex method, duality theory. Unconstrained optimization, Newton method for minimization. Nonlinear programming, optimality conditions for constrained problems. Additional topics from linear and nonlinear programming. P/NP or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH164"
  },
  {
    "course_code": "MATH 167",
    "units": 4,
    "title": "Mathematical Game Theory",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 115A. Quantitative modeling of strategic interaction. Topics include extensive and normal form games, background probability, lotteries, mixed strategies, pure and mixed Nash equilibria and refinements, bargaining; emphasis on economic examples. Optional topics include repeated games and evolutionary game theory. P/NP or letter grading.",
    "prerequisites": [
      "MATH 115A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH167"
  },
  {
    "course_code": "MATH 168",
    "units": 4,
    "title": "Introduction to Networks",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 115A, 170E (or 170A or Electrical and Computer Engineering 131A or Statistics 100A). Introduction to network science (including theory, computation, and applications), which can be used to study complex systems of interacting agents. Study of networks in technology, social, information, biological, and mathematics involving basic structural features of networks, generative models of networks, network summary statistics, centrality, random graphs, clustering, and dynamical processes on networks. Introduction to advanced topics as time permits. P/NP or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 170E",
      "MATH 170A",
      "EC ENGR 131A",
      "STATS 100A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH168"
  },
  {
    "course_code": "MATH 170A",
    "units": 4,
    "title": "Probability Theory I",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 33A, 131A. Not open to students with credit for course 170E, Electrical and Computer Engineering 131A, or Statistics 100A. Rigorous presentation of probability theory based on real analysis. Probability space, probability and conditional probability, independence, Bayes’ rule, discrete and continuous random variables and their distributions, expectation, moments and variance, conditional distribution and expectation, weak law of large numbers. P/NP or letter grading.",
    "prerequisites": [
      "MATH 32B",
      "MATH 33A",
      "MATH 131A"
    ],
    "credit_exclusions": [
      "EC ENGR 131A"
    ],
    "equivalent_courses": [
      "STATS 100A",
      "MATH 170E",
      "Introduction to Probability and Statistics 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH170A"
  },
  {
    "course_code": "MATH 170B",
    "units": 4,
    "title": "Probability Theory II",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisites: courses 131A, 170A. Continuation of rigorous presentation of probability theory based on real analysis. Moments and generating functions; laws of large numbers, central limit theorem, and convergence in distribution; branching processes; random walks; Poisson and other random processes in continuous time. Advance topics in probability theory. P/NP or letter grading.",
    "prerequisites": [
      "MATH 131A",
      "MATH 170A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH170B"
  },
  {
    "course_code": "MATH 170E",
    "units": 4,
    "title": "Introduction to Probability and Statistics 1: Probability",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 32B. Highly recommended: course 61 or 70. Not open to students with credit for course 170A, Electrical and Computer Engineering 131A, or Statistics 100A. Introduction to probability theory with emphasis on topics relevant to applications. Topics include discrete (binomial, Poisson, etc.) and continuous (exponential, gamma, chi-square, normal) distributions, bivariate distributions, distributions of functions of random variables (including moment generating functions and central limit theorem).  P/NP or letter grading.",
    "prerequisites": [
      "MATH 32B"
    ],
    "credit_exclusions": [
      "EC ENGR 131A"
    ],
    "equivalent_courses": [
      "STATS 100A",
      "MATH 170A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH170E"
  },
  {
    "course_code": "MATH 170S",
    "units": 4,
    "title": "Introduction to Probability and Statistics 2: Statistics",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 31A, 31B, and 170A or 170E or Statistics 100A. Not open to students with credit for Statistics 100B. Introduction to statistics. Topics include sampling, estimation (maximum likelihood and Bayesian), properties of estimators, regression, confidence intervals, hypotheses testing, analysis of variance. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31A",
      "MATH 31B",
      "MATH 170A",
      "MATH 170E",
      "STATS 100A"
    ],
    "credit_exclusions": [
      "STATS 100B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH170S"
  },
  {
    "course_code": "MATH 171",
    "units": 4,
    "title": "Stochastic Processes",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 33A, 170E (or 170A or Statistics 100A). Discrete Markov chains, continuous-time Markov chains, renewal theory. P/NP or letter grading.",
    "prerequisites": [
      "MATH 33A",
      "MATH 170E",
      "MATH 170A",
      "STATS 100A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH171"
  },
  {
    "course_code": "MATH 174E",
    "units": 4,
    "title": "Mathematics of Finance for Mathematics/Economics Students",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisites: courses 33A, and 170A or 170E or Statistics 100A. Not open for credit to students with credit for course 174A, Economics 141, or Statistics C183/C283. Mathematical modeling of financial securities in discrete and continuous time. Forwards, futures, hedging, swaps, uses and pricing (tree models and Black-Scholes) of European and American options, Greeks and numerical methods. P/NP or letter grading.",
    "prerequisites": [
      "MATH 33A",
      "MATH 170A",
      "MATH 170E",
      "STATS 100A"
    ],
    "credit_exclusions": [
      "STATS C183",
      "STATS C283",
      "ECON 141"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH174E"
  },
  {
    "course_code": "MATH 177",
    "units": 4,
    "title": "Theory of Interest and Applications",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 32B. Types of interest, time value of money, annuities and similar contracts, loans, bonds, portfolios and general cash flows, rate of return, term structure of interest rates, duration, convexity and immunization, interest rate swaps, financial derivatives, forwards, futures, and options. Letter grading.",
    "prerequisites": [
      "MATH 32B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH177"
  },
  {
    "course_code": "MATH 178A",
    "units": 4,
    "title": "Foundations of Actuarial Mathematics: Life Insurance and Annuities",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 32B, 170A or 170E (or Statistics 100A), 175 or 177. Introduction to mathematics associated with long-term insurance coverages. Single- and multiple-life survival models, annuities, premium calculations and policy values, reserves, pension plans and retirement benefits. Letter grading.",
    "prerequisites": [
      "MATH 32B",
      "MATH 170A",
      "MATH 170E",
      "STATS 100A",
      "STATS 175",
      "STATS 177"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH178A"
  },
  {
    "course_code": "MATH 178B",
    "units": 4,
    "title": "Foundations of Actuarial Mathematics: Additional Topics in Long-Term Actuarial Mathematics",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 170B or 170S (or Statistics 100B), 178A. Multistate models, covers pensions, health insurances, and profit-testing. Study of probability distributions employed most commonly in actuarial theory. Beginning study of short-term actuarial mathematics. Letter grading.",
    "prerequisites": [
      "MATH 170B",
      "MATH 170S",
      "STATS 100B",
      "STATS 178A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH178B"
  },
  {
    "course_code": "MATH 178C",
    "units": 4,
    "title": "Foundations of Actuarial Mathematics: Loss Models",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 178B. Study of loss models associated with actuarial problems. Covers severity, frequency, and aggregate loss models, parameter estimation (frequentist, Bayesian), model selection, and credibility. Letter grading.",
    "prerequisites": [
      "MATH 178B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH178C"
  },
  {
    "course_code": "MATH 179",
    "units": 4,
    "title": "Advanced Topic in Financial Mathematics",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 174E. Continuation of course 174E. In-depth study of risk measures and instruments of risk management in investment portfolios and corporate financial structure. Exotic and real options, value at risk, mean-variance analysis, portfolio optimization, risk analysis, capital asset pricing model, market efficiency, and Modigliani-Miller theory. P/NP or letter grading.",
    "prerequisites": [
      "MATH 174E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH179"
  },
  {
    "course_code": "MATH 180",
    "units": 4,
    "title": "Graph Theory",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 31A, 31B, 61. Strongly recommended: course 115A. Designed for mathematics and computer science and engineering students. Graphs and trees. Planarity, graph colorings. Set systems. Ramsey theory. Random graphs. Linear algebra methods. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31A",
      "MATH 31B",
      "MATH 61"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH180"
  },
  {
    "course_code": "MATH 182",
    "units": 4,
    "title": "Algorithms",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 3C or 32A, and 61. Not open for credit to students with credit for Computer Science 180. Graphs, greedy algorithms, divide and conquer algorithms, dynamic programming, network flow. Emphasis on designing efficient algorithms useful in diverse areas such as bioinformatics and allocation of resources. P/NP or letter grading.",
    "prerequisites": [
      "MATH 3C",
      "MATH 32A",
      "MATH 61"
    ],
    "credit_exclusions": [
      "COM SCI 180"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH182"
  },
  {
    "course_code": "MATH 184",
    "units": 4,
    "title": "Enumerative Combinatorics",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisites: courses 31A, 31B, 61, 115A. Designed for mathematics and physics students. Permutations and combinations, counting principles, recurrence relations, and generating functions. Application to asymptotic and probabilistic enumeration. P/NP or letter grading.",
    "prerequisites": [
      "MATH 31A",
      "MATH 31B",
      "MATH 61",
      "MATH 115A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH184"
  },
  {
    "course_code": "MATH 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH188SA"
  },
  {
    "course_code": "MATH 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "MATH 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH188SB"
  },
  {
    "course_code": "MATH 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "MATH 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH188SC"
  },
  {
    "course_code": "MATH 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH189"
  },
  {
    "course_code": "MATH 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH189HC"
  },
  {
    "course_code": "MATH 190A",
    "units": 1,
    "title": "Seminar: Current Literature in History and Development of Mathematics",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190A"
  },
  {
    "course_code": "MATH 190B",
    "units": 1,
    "title": "Seminar: Current Literature in Number Theory",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190B"
  },
  {
    "course_code": "MATH 190C",
    "units": 1,
    "title": "Seminar: Current Literature in Algebra",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190C"
  },
  {
    "course_code": "MATH 190D",
    "units": 1,
    "title": "Seminar: Current Literature in Logic",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190D"
  },
  {
    "course_code": "MATH 190E",
    "units": 1,
    "title": "Seminar: Current Literature in Geometry",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190E"
  },
  {
    "course_code": "MATH 190F",
    "units": 1,
    "title": "Seminar: Current Literature in Topology",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190F"
  },
  {
    "course_code": "MATH 190G",
    "units": 1,
    "title": "Seminar: Current Literature in Analysis",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190G"
  },
  {
    "course_code": "MATH 190H",
    "units": 1,
    "title": "Seminar: Current Literature in Differential Equations",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190H"
  },
  {
    "course_code": "MATH 190I",
    "units": 1,
    "title": "Seminar: Current Literature in Functional Analysis",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190I"
  },
  {
    "course_code": "MATH 190J",
    "units": 1,
    "title": "Seminar: Current Literature in Applied Mathematics",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190J"
  },
  {
    "course_code": "MATH 190K",
    "units": 1,
    "title": "Seminar: Current Literature in Probability",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190K"
  },
  {
    "course_code": "MATH 190L",
    "units": 1,
    "title": "Seminar: Current Literature in Dynamical Systems",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190L"
  },
  {
    "course_code": "MATH 190M",
    "units": 1,
    "title": "Seminar: Current Literature in Mathematics",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190M"
  },
  {
    "course_code": "MATH 190N",
    "units": 1,
    "title": "Seminar: Current Literature in Combinatorics",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190N"
  },
  {
    "course_code": "MATH 190O",
    "units": 1,
    "title": "Seminar: Current Literature in Cryptography",
    "description": "Seminar, one hour. Designed for undergraduate students. Readings and presentations of papers in mathematical literature under supervision of staff member. One-hour presentation required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH190O"
  },
  {
    "course_code": "MATH 191",
    "units": 4,
    "title": "Variable Topics Research Seminars: Mathematics",
    "description": "Seminar, three hours. Variable topics research course in mathematics that covers material not covered in regular mathematics upper-division curriculum. Reading, discussion, and development of culminating project. May be repeated for credit with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH191"
  },
  {
    "course_code": "MATH 191H",
    "units": 4,
    "title": "Honors Research Seminars: Mathematics",
    "description": "Seminar, three hours. Participating seminar on advanced topics in mathematics. Content varies from year to year. May be repeated for credit by petition. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH191H"
  },
  {
    "course_code": "MATH M192A",
    "units": 1,
    "title": "Introduction to Collaborative Learning Theory and Practice",
    "description": "(Formerly numbered 192A.) (Same as Atmospheric and Oceanic Sciences M192A, Chemistry M192E, Computer Science M192A, Life Sciences M192A, and Physics M192S.) Seminar, one hour. Training seminar for undergraduate students who are selected for learning assistant (LA) program. Exploration of current topics in pedagogy and education research focused on methods of learning and their practical application in small-group settings. Students practice communication skills with frequent assessment of and feedback on progress. Letter grading.",
    "cross_listed": [
      "CHEM M192E",
      "LIFESCI M192A",
      "COM SCI M192A",
      "A&O SCI M192A",
      "PHYSICS M192S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATHM192A"
  },
  {
    "course_code": "MATH 192B",
    "units": 2,
    "title": "Collaborative Learning Theory and Practice",
    "description": "Seminar, two to four hours. Requisite: course M192A (may be taken concurrently). Limited to students serving as learning assistants. Further exploration of current topics in pedagogy and education research focused on methods of learning in small groups and their practical application to supervise learning in UCLA mathematics courses. With instructor's guidance, students apply pedagogical principles based on current education research, assist with development of innovative instructional materials, and receive and generate frequent feedback on their activities. May be repeated three times for credit. May not be used to fulfill elective requirement for any mathematics major. Letter grading.",
    "prerequisites": [
      "MATH M192A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH192B"
  },
  {
    "course_code": "MATH 195",
    "units": 4,
    "title": "Community Internships in Mathematics Education",
    "description": "Tutorial, to be arranged. Limited to juniors/seniors. Internship to be supervised by Center for Community Learning and Mathematics Department. Students meet on regular basis with instructor, provide periodic reports of their experience, have assigned readings on mathematics education, and complete final paper. May not be repeated and may not be applied toward major requirements. Individual contract with supervising faculty member required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH195"
  },
  {
    "course_code": "MATH 197",
    "units": 2,
    "title": "Individual Studies in Mathematics",
    "description": "Tutorial, three hours per week per unit. Limited to juniors/seniors. At discretion of chair and subject to availability of staff, individual intensive study of topics suitable for undergraduate course credit but not specifically offered as separate courses. Scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for maximum of 12 units, but no more than one 197 or 199 course may be applied toward upper-division courses required for majors offered by Mathematics Department. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH197"
  },
  {
    "course_code": "MATH 199",
    "units": 2,
    "title": "Directed Research or Senior Project in Mathematics",
    "description": "Tutorial, three hours per week per unit. Limited to juniors/seniors. Supervised individual research under guidance of faculty mentor. Scheduled meetings to be arranged between faculty member and student. Culminating report required. May be repeated for maximum of 12 units, but no more than one 197 or 199 course may be applied toward upper-division courses required for majors offered by Mathematics Department. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH199"
  },
  {
    "course_code": "MATH 201A",
    "units": 4,
    "title": "Topics in Algebra and Analysis",
    "description": "Prerequisite: bachelor’s degree in mathematics or equivalent. Designed for students in mathematics/education program. Important ideas of algebra, geometry, and calculus leading effectively from elementary to modern mathematics. Approaches to number system, point sets, geometric interpretations of algebra and analysis, integration, differentiation, series and analytic functions. May not be applied toward MA degree requirements.",
    "prerequisites": [],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH201A"
  },
  {
    "course_code": "MATH 201B",
    "units": 4,
    "title": "Topics in Algebra and Analysis",
    "description": "Prerequisite: bachelor’s degree in mathematics or equivalent. Designed for students in mathematics/education program. Important ideas of algebra, geometry, and calculus leading effectively from elementary to modern mathematics. Approaches to number system, point sets, geometric interpretations of algebra and analysis, integration, differentiation, series and analytic functions. May not be applied toward MA degree requirements.",
    "prerequisites": [],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH201B"
  },
  {
    "course_code": "MATH 201C",
    "units": 4,
    "title": "Topics in Algebra and Analysis",
    "description": "Prerequisite: bachelor’s degree in mathematics or equivalent. Designed for students in mathematics/education program. Important ideas of algebra, geometry, and calculus leading effectively from elementary to modern mathematics. Approaches to number system, point sets, geometric interpretations of algebra and analysis, integration, differentiation, series and analytic functions. May not be applied toward MA degree requirements.",
    "prerequisites": [],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH201C"
  },
  {
    "course_code": "MATH 202A",
    "units": 4,
    "title": "Mathematical Models and Applications",
    "description": "Prerequisite: bachelor’s degree in mathematics or equivalent. Designed for students in mathematics/education program. Development of mathematical theories describing various empirical situations. Basic characterizing postulates; development of a logical structure of theorems. Modern topics such as operations research, linear programming, game theory, learning models, models in social and life sciences. May not be applied toward MA degree requirements.",
    "prerequisites": [],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH202A"
  },
  {
    "course_code": "MATH 202B",
    "units": 4,
    "title": "Mathematical Models and Applications",
    "description": "Prerequisite: bachelor’s degree in mathematics or equivalent. Designed for students in mathematics/education program. Development of mathematical theories describing various empirical situations. Basic characterizing postulates; development of a logical structure of theorems. Modern topics such as operations research, linear programming, game theory, learning models, models in social and life sciences. May not be applied toward MA degree requirements.",
    "prerequisites": [],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH202B"
  },
  {
    "course_code": "MATH 203",
    "units": 4,
    "title": "Master's Linear Algebra",
    "description": "Lecture, four hours; discussion, one hour. Rigorous treatment of fundamental results of pure and applied linear algebra over fields. Applications to contemporary research. Preparation for linear algebra portion of UCLA Mathematics Basic Examination that is required of MA and PhD students. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH203"
  },
  {
    "course_code": "MATH 204",
    "units": 4,
    "title": "Master's Analysis",
    "description": "Lecture, four hours; discussion, one hour. Rigorous treatment of fundamental results of analysis. Applications to contemporary research. Preparation for analysis portion of UCLA Mathematics Basic Examination that is required of MA and PhD students. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH204"
  },
  {
    "course_code": "MATH 205A",
    "units": 4,
    "title": "Number Theory",
    "description": "Lecture, three hours. Requisites: courses 210A, 246A. Algebraic number theory, including ideal theory, valuations, local fields, cyclotomic fields. Introduction to class-field theory, analytic number theory, L-functions and class number formulas, and modular forms. S/U or letter grading.",
    "prerequisites": [
      "MATH 210A",
      "MATH 246A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH205A"
  },
  {
    "course_code": "MATH 205B",
    "units": 4,
    "title": "Number Theory",
    "description": "Lecture, three hours. Requisites: courses 210A, 246A. Algebraic number theory, including ideal theory, valuations, local fields, cyclotomic fields. Introduction to class-field theory, analytic number theory, L-functions and class number formulas, and modular forms. S/U or letter grading.",
    "prerequisites": [
      "MATH 210A",
      "MATH 246A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH205B"
  },
  {
    "course_code": "MATH 205C",
    "units": 4,
    "title": "Number Theory",
    "description": "Lecture, three hours. Requisites: courses 210A, 246A. Algebraic number theory, including ideal theory, valuations, local fields, cyclotomic fields. Introduction to class-field theory, analytic number theory, L-functions and class number formulas, and modular forms. S/U or letter grading.",
    "prerequisites": [
      "MATH 210A",
      "MATH 246A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH205C"
  },
  {
    "course_code": "MATH 206A",
    "units": 4,
    "title": "Combinatorial Theory",
    "description": "Generating functions. Probabilistic methods. Polya theorem. Enumerative graph theory. Partition theory. Number theoretical applications. Structure of graphs, matching theory, duality theorems. Packings, pavings, coverings, statistical designs, difference sets, triple systems, finite planes. Configurations, polyhedra. Ramsey theory, finite and transfinite, and applications.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH206A"
  },
  {
    "course_code": "MATH 206B",
    "units": 4,
    "title": "Combinatorial Theory",
    "description": "Generating functions. Probabilistic methods. Polya theorem. Enumerative graph theory. Partition theory. Number theoretical applications. Structure of graphs, matching theory, duality theorems. Packings, pavings, coverings, statistical designs, difference sets, triple systems, finite planes. Configurations, polyhedra. Ramsey theory, finite and transfinite, and applications.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH206B"
  },
  {
    "course_code": "MATH 207A",
    "units": 4,
    "title": "Topics in Number Theory",
    "description": "Lecture, three hours. Adelic analysis on GL(1) and GL(2), especially Tate thesis and Hecke theory, automorphic representations. Special values of L-functions and p-adic L-functions, arithmetic theory of modular forms, advanced topics in analytic number theory. Arithmetic geometry, especially of modular curves. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH207A"
  },
  {
    "course_code": "MATH 207B",
    "units": 4,
    "title": "Topics in Number Theory",
    "description": "Lecture, three hours. Adelic analysis on GL(1) and GL(2), especially Tate thesis and Hecke theory, automorphic representations. Special values of L-functions and p-adic L-functions, arithmetic theory of modular forms, advanced topics in analytic number theory. Arithmetic geometry, especially of modular curves. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH207B"
  },
  {
    "course_code": "MATH 207C",
    "units": 4,
    "title": "Topics in Number Theory",
    "description": "Lecture, three hours. Adelic analysis on GL(1) and GL(2), especially Tate thesis and Hecke theory, automorphic representations. Special values of L-functions and p-adic L-functions, arithmetic theory of modular forms, advanced topics in analytic number theory. Arithmetic geometry, especially of modular curves. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH207C"
  },
  {
    "course_code": "MATH M208A",
    "units": 4,
    "title": "Topics in Applied Number Theory",
    "description": "(Same as Computer Science M283A.) Lecture, three hours. Basic number theory, including congruences and prime numbers. Cryptography: public-key and discrete log cryptosystems. Attacks on cryptosystems. Primality testing and factorization methods. Elliptic curve methods. Topics from coding theory: Hamming codes, cyclic codes, Gilbert/Varshamov bounds, Shannon theorem. S/U or letter grading.",
    "cross_listed": [
      "COM SCI M283A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATHM208A"
  },
  {
    "course_code": "MATH M208B",
    "units": 4,
    "title": "Topics in Applied Number Theory",
    "description": "(Same as Computer Science M283B.) Lecture, three hours. Basic number theory, including congruences and prime numbers. Cryptography: public-key and discrete log cryptosystems. Attacks on cryptosystems. Primality testing and factorization methods. Elliptic curve methods. Topics from coding theory: Hamming codes, cyclic codes, Gilbert/Varshamov bounds, Shannon theorem. S/U or letter grading.",
    "cross_listed": [
      "COM SCI M283B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATHM208B"
  },
  {
    "course_code": "MATH M209A",
    "units": 4,
    "title": "Cryptography",
    "description": "(Same as Computer Science M282A.) Lecture, four hours; outside study, eight hours. Introduction to theory of cryptography, stressing rigorous definitions and proofs of security. Topics include notions of hardness, one-way functions, hard-core bits, pseudorandom generators, pseudorandom functions and pseudorandom permutations, semantic security, public-key and private-key encryption, secret-sharing, message authentication, digital signatures, interactive proofs, zero-knowledge proofs, collision-resistant hash functions, commitment protocols, key-agreement, contract signing, and two-party secure computation with static security. Letter grading.",
    "cross_listed": [
      "COM SCI M282A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATHM209A"
  },
  {
    "course_code": "MATH M209B",
    "units": 4,
    "title": "Cryptographic Protocols",
    "description": "(Same as Computer Science M282B.) Lecture, four hours. Requisite: course M209A. Consideration of advanced cryptographic protocol design and analysis. Topics include noninteractive zero-knowledge proofs; zero-knowledge arguments; concurrent and non-black-box zero-knowledge; IP&equals;PSPACE proof, stronger notions of security for public-key encryption, including chosen-ciphertext security; secure multiparty computation; dealing with dynamic adversary; nonmalleability and composability of secure protocols; software protection; threshold cryptography; identity-based cryptography; private information retrieval; protection against man-in-middle attacks; voting protocols; identification protocols; digital cash schemes; lower bounds on use of cryptographic primitives, software obfuscation. May be repeated for credit with topic change. Letter grading.",
    "prerequisites": [
      "MATH M209A"
    ],
    "cross_listed": [
      "COM SCI M282B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATHM209B"
  },
  {
    "course_code": "MATH 210A",
    "units": 4,
    "title": "Algebra",
    "description": "Requisites: courses 110A, 110B, 110C. Students with credit for courses 110B and/or 110C cannot receive MA degree credit for courses 210B and/or 210C. Group theory, including theorems of Sylow and Jordan/Holder/Schreier; rings and ideals, factorization theory in integral domains, modules over principal ideal rings, Galois theory of fields, multilinear algebra, structure of algebras.",
    "prerequisites": [
      "MATH 110A",
      "MATH 110B",
      "MATH 110C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH210A"
  },
  {
    "course_code": "MATH 210B",
    "units": 4,
    "title": "Algebra",
    "description": "Requisites: courses 110A, 110B, 110C. Students with credit for courses 110B and/or 110C cannot receive MA degree credit for courses 210B and/or 210C. Group theory, including theorems of Sylow and Jordan/Holder/Schreier; rings and ideals, factorization theory in integral domains, modules over principal ideal rings, Galois theory of fields, multilinear algebra, structure of algebras.",
    "prerequisites": [
      "MATH 110A",
      "MATH 110B",
      "MATH 110C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH210B"
  },
  {
    "course_code": "MATH 210C",
    "units": 4,
    "title": "Algebra",
    "description": "Requisites: courses 110A, 110B, 110C. Students with credit for courses 110B and/or 110C cannot receive MA degree credit for courses 210B and/or 210C. Group theory, including theorems of Sylow and Jordan/Holder/Schreier; rings and ideals, factorization theory in integral domains, modules over principal ideal rings, Galois theory of fields, multilinear algebra, structure of algebras.",
    "prerequisites": [
      "MATH 110A",
      "MATH 110B",
      "MATH 110C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH210C"
  },
  {
    "course_code": "MATH 211",
    "units": 4,
    "title": "Structure of Rings",
    "description": "Requisite: course 210A. Radical, irreducible modules and primitive rings, rings and algebras with minimum condition.",
    "prerequisites": [
      "MATH 210A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH211"
  },
  {
    "course_code": "MATH 212A",
    "units": 4,
    "title": "Homological Algebra",
    "description": "Lecture, three hours. Enforced requisite: course 210A. Modules over rings, homomorphisms and tensor products of modules, functors and derived functors, homological dimension of rings and modules. S/U or letter grading.",
    "prerequisites": [
      "MATH 210A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH212A"
  },
  {
    "course_code": "MATH 212B",
    "units": 4,
    "title": "Homological Algebra",
    "description": "Lecture, three hours. Requisites: courses 210A, 210B, 210C, 212A. Advanced topics in modern homological algebra, such as triangulated categories, differential graded algebras as dg-categories, tilting theory and applications of group cohomology to representation theory, stable categories and modular representation theory, and other current topics. S/U or letter grading.",
    "prerequisites": [
      "MATH 210A",
      "MATH 210B",
      "MATH 210C",
      "MATH 212A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH212B"
  },
  {
    "course_code": "MATH 213A",
    "units": 4,
    "title": "Theory of Groups",
    "description": "Requisite: course 210A. Topics include representation theory, transfer theory, infinite Abelian groups, free products and presentations of groups, solvable and nilpotent groups, classical groups, algebraic groups.",
    "prerequisites": [
      "MATH 210A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH213A"
  },
  {
    "course_code": "MATH 213B",
    "units": 4,
    "title": "Theory of Groups",
    "description": "Requisite: course 210A. Topics include representation theory, transfer theory, infinite Abelian groups, free products and presentations of groups, solvable and nilpotent groups, classical groups, algebraic groups.",
    "prerequisites": [
      "MATH 210A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH213B"
  },
  {
    "course_code": "MATH 214A",
    "units": 4,
    "title": "Introduction to Algebraic Geometry",
    "description": "Lecture, three hours. Requisite: course 215A (or 210A, 210B, and 210C with consent of instructor). Affine and projective varieties. Irreducibility, dimension, singular and smooth points. Rational maps, curves, intersections in projective space. Schemes. Proper and finite morphisms. Coherent and quasi-coherent sheaves. Divisors, line bundles, ampleness. S/U or letter grading.",
    "prerequisites": [
      "MATH 215A",
      "MATH 210A",
      "MATH 210B",
      "MATH 210C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH214A"
  },
  {
    "course_code": "MATH 214B",
    "units": 4,
    "title": "Introduction to Algebraic Geometry",
    "description": "Lecture, three hours. Requisite: course 214A. Cohomology of coherent sheaves. Flat morphisms, smooth morphisms. Riemann-Roch theorem for curves. Projective embeddings of curves, elliptic curves, canonical embedding. Introduction to birational geometry in higher dimensions. S/U or letter grading.",
    "prerequisites": [
      "MATH 214A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH214B"
  },
  {
    "course_code": "MATH 215A",
    "units": 4,
    "title": "Commutative Algebra",
    "description": "Prerequisite: course 210A or consent of instructor. Topics from commutative ring theory, including techniques of localization, prime ideal structure in commutative Noetherian rings, principal ideal theorem, Dedekind rings, modules, projective modules, Serre conjecture, regular local rings.",
    "prerequisites": [
      "MATH 210A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH215A"
  },
  {
    "course_code": "MATH 215B",
    "units": 4,
    "title": "Commutative Algebra",
    "description": "Prerequisite: course 210A or consent of instructor. Topics from commutative ring theory, including techniques of localization, prime ideal structure in commutative Noetherian rings, principal ideal theorem, Dedekind rings, modules, projective modules, Serre conjecture, regular local rings.",
    "prerequisites": [
      "MATH 210A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH215B"
  },
  {
    "course_code": "MATH 216A",
    "units": 4,
    "title": "Further Topics in Algebra",
    "description": "Lecture, three hours. Requisites: courses 210A, 210B, 210C. Closer examination of areas of current research in algebra, including algebraic geometry and K-theory. Variable content may include Abelian varieties, invariant theory, Hodge theory, geometry over finite fields, K-theory, homotopical algebra, and derived algebraic geometry. May be repeated for credit by petition. S/U or letter grading.",
    "prerequisites": [
      "MATH 210A",
      "MATH 210B",
      "MATH 210C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH216A"
  },
  {
    "course_code": "MATH 216B",
    "units": 4,
    "title": "Further Topics in Algebra",
    "description": "Lecture, three hours. Requisites: courses 210A, 210B, 210C. Closer examination of areas of current research in algebra, including algebraic geometry and K-theory. Variable content may include Abelian varieties, invariant theory, Hodge theory, geometry over finite fields, K-theory, homotopical algebra, and derived algebraic geometry. May be repeated for credit by petition. S/U or letter grading.",
    "prerequisites": [
      "MATH 210A",
      "MATH 210B",
      "MATH 210C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH216B"
  },
  {
    "course_code": "MATH 216C",
    "units": 4,
    "title": "Further Topics in Algebra",
    "description": "Lecture, three hours. Requisites: courses 210A, 210B, 210C. Closer examination of areas of current research in algebra, including algebraic geometry and K-theory. Variable content may include Abelian varieties, invariant theory, Hodge theory, geometry over finite fields, K-theory, homotopical algebra, and derived algebraic geometry. May be repeated for credit by petition. S/U or letter grading.",
    "prerequisites": [
      "MATH 210A",
      "MATH 210B",
      "MATH 210C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH216C"
  },
  {
    "course_code": "MATH M217",
    "units": 4,
    "title": "Geometry and Physics",
    "description": "(Same as Physics M236.) Lecture, three hours. Interdisciplinary course on topics at interface between physics quantum fields and superstrings and mathematics of differential and algebraic geometry. Topics include supersymmetry, Seiberg/Witten theory, conformal field theory, Calabi/Yau manifolds, mirror symmetry and duality, integrable systems. S/U grading.",
    "cross_listed": [
      "PHYSICS M236"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATHM217"
  },
  {
    "course_code": "MATH 218A",
    "units": 4,
    "title": "Discrete Mathematics: Probabilistic Methods",
    "description": "Lecture, three hours. Linearity of expectation, second movement method, local lemma, correlation inequalities, martingales, large deviation inequalities, Janson and Talagrand inequalities, and pseudo-randomness. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH218A"
  },
  {
    "course_code": "MATH 218B",
    "units": 4,
    "title": "Discrete Mathematics: Algebraic Methods",
    "description": "Lecture, three hours. Basic dimension arguments, spaces of polynomials and tensor product methods, eigenvalues of graphs and their application, combinatorial Nullstellensatz and Chevalley/Warning theorem. Counterexample to Borsuk conjecture, chromatic number of unit distance graph of Euclidean space, explicit constructions of Ramsey graphs, other topics. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH218B"
  },
  {
    "course_code": "MATH 218C",
    "units": 4,
    "title": "Topics in Discrete Mathematics",
    "description": "Lecture, three hours. Examination of variety of methods, approaches, and techniques that were developed in last 30 years in discrete mathematics. Topics may include extremal problems for graphs and set systems, Ramsey theory, additive number theory combinatorial geometry, topological methods in combinatorics, entropy and other tools from information theory, discrete harmonic analysis and its applications to combinatorics and theoretical computer science. Topics vary from year to year. May be repeated for credit with consent of instructor. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH218C"
  },
  {
    "course_code": "MATH 220A",
    "units": 4,
    "title": "Mathematical Logic",
    "description": "Lecture, three hours. Requisite: course M114S. Fundamental methods and results in mathematical logic, using mathematical methods to reason about existence or nonexistence of proofs and computations in many different settings. Topics include compactness theorem, saturation of models, completeness and incompleteness theorems of Gödel, Turing computability and degrees of unsolvability, recursion in Baire space, Zermelo/Fraenkel axioms, universe of constructible sets, and related equiconsistency results in set theory. S/U or letter grading.",
    "prerequisites": [
      "MATH M114S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH220A"
  },
  {
    "course_code": "MATH 220B",
    "units": 4,
    "title": "Mathematical Logic",
    "description": "Lecture, three hours. Requisite: course M114S. Fundamental methods and results in mathematical logic, using mathematical methods to reason about existence or nonexistence of proofs and computations in many different settings. Topics include compactness theorem, saturation of models, completeness and incompleteness theorems of Gödel, Turing computability and degrees of unsolvability, recursion in Baire space, Zermelo/Fraenkel axioms, universe of constructible sets, and related equiconsistency results in set theory. S/U or letter grading.",
    "prerequisites": [
      "MATH M114S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH220B"
  },
  {
    "course_code": "MATH 220C",
    "units": 4,
    "title": "Mathematical Logic",
    "description": "Lecture, three hours. Requisite: course M114S. Fundamental methods and results in mathematical logic, using mathematical methods to reason about existence or nonexistence of proofs and computations in many different settings. Topics include compactness theorem, saturation of models, completeness and incompleteness theorems of Gödel, Turing computability and degrees of unsolvability, recursion in Baire space, Zermelo/Fraenkel axioms, universe of constructible sets, and related equiconsistency results in set theory. S/U or letter grading.",
    "prerequisites": [
      "MATH M114S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH220C"
  },
  {
    "course_code": "MATH 222A",
    "units": 4,
    "title": "Lattice Theory and Algebraic Systems",
    "description": "Lecture, three hours. Requisite: course 210A. Partially ordered sets, lattices, distributivity, modularity; completeness, interaction with combinatorics, topology, and logic; algebraic systems, congruence lattices, subdirect decomposition, congruence laws, equational bases, applications to lattices.",
    "prerequisites": [
      "MATH 210A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH222A"
  },
  {
    "course_code": "MATH 222B",
    "units": 4,
    "title": "Lattice Theory and Algebraic Systems",
    "description": "Lecture, three hours. Requisite: course 210A. Partially ordered sets, lattices, distributivity, modularity; completeness, interaction with combinatorics, topology, and logic; algebraic systems, congruence lattices, subdirect decomposition, congruence laws, equational bases, applications to lattices.",
    "prerequisites": [
      "MATH 210A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH222B"
  },
  {
    "course_code": "MATH 223C",
    "units": 4,
    "title": "Topics in Computability Theory",
    "description": "Lecture, three hours. Requisites: courses 220A, 220B. Degrees of unsolvability, recursively enumerable sets, undecidable theories; inductive definitions, admissible sets and ordinals; recursion in higher types; recursion and complexity. Topics vary from year to year. May be repeated for credit with consent of instructor. S/U or letter grading.",
    "prerequisites": [
      "MATH 220A",
      "MATH 220B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH223C"
  },
  {
    "course_code": "MATH 223D",
    "units": 4,
    "title": "Topics in Descriptive Set Theory",
    "description": "Lecture, three hours. Requisites: courses 220A, 220B. Classical and effective results on Borel and projective sets; infinite games of perfect information and principle of determinacy; consequences of determinacy, including periodicity, structure theory of pointclasses, and partition properties. Topics vary from year to year. May be repeated for credit with consent of instructor. S/U or letter grading.",
    "prerequisites": [
      "MATH 220A",
      "MATH 220B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH223D"
  },
  {
    "course_code": "MATH 223M",
    "units": 4,
    "title": "Topics in Model Theory",
    "description": "Lecture, three hours. Requisites: courses 220A, 220B. Ultraproducts, preservation theorems, interpolation theorems, saturated models, omitting types, categoricity, two cardinal theorems, enriched languages, soft model theory, and applied model theory. Topics vary from year to year. May be repeated for credit with consent of instructor. S/U or letter grading.",
    "prerequisites": [
      "MATH 220A",
      "MATH 220B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH223M"
  },
  {
    "course_code": "MATH 223S",
    "units": 4,
    "title": "Topics in Set Theory",
    "description": "Lecture, three hours. Requisites: courses 220A, 220B, 220C. Forcing and independence results, including independence of continuum hypothesis and independence of axion of choice; inner model theory; large cardinals; proofs of determinacy; combinatorial set theory. Topics vary from year to year. May be repeated for credit with consent of instructor. S/U or letter grading.",
    "prerequisites": [
      "MATH 220A",
      "MATH 220B",
      "MATH 220C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH223S"
  },
  {
    "course_code": "MATH 225A",
    "units": 4,
    "title": "Smooth Manifolds",
    "description": "Lecture, three hours; discussion, one hour. Smooth manifolds and smooth maps; inverse and implicit function theorems, submersions, immersions, submanifolds; tangent and cotangent bundles, vector bundles; differential forms, exterior differentiation, and Lie derivatives; integration, Stokes’ theorem, de Rham cohomology, and computations using the Mayer-Vietoris sequences; vector fields, integral curves, distributions, Frobenius’ theorem. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH225A"
  },
  {
    "course_code": "MATH 225B",
    "units": 4,
    "title": "Differential Topology",
    "description": "Lecture, three hours; discussion, one hour. Sard’s theorem and transversality, Whitney embedding theorem, tubular neighborhoods; intersection theory, degree, vector fields and Poincaré-Hopf theorem, Lefschetz fixed-point formula; compactly supported cohomology, Poincaré duality, Thom isomorphism, and the Künneth theorem from the point of view of de Rham theory; applications: homotopy types of self-maps of tori and spheres (Hopf degree theorem) and Lefschetz numbers of self-maps of spheres, real and complex projective spaces, and tori. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH225B"
  },
  {
    "course_code": "MATH 225C",
    "units": 4,
    "title": "Algebraic Topology",
    "description": "Lecture, three hours; discussion, one hour. Homotopy theory: fundamental group, covering spaces, Van Kampen’s theorem. Homology theory: singular homology, simplicial homology, homotopy invariance, relative homology, excision and Mayer-Vietoris, functoriality, relationship to the fundamental group, calculations with cellular complexes (CW complexes). Cohomology theory: singular cohomology, universal coefficient theorem, cup products. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH225C"
  },
  {
    "course_code": "MATH 226A",
    "units": 4,
    "title": "Differential Geometry",
    "description": "Lecture, three hours. Requisite: course 225A. Manifold theory; connections, curvature, torsion, and parallelism. Riemannian manifolds; completeness, submanifolds, constant curvature. Geodesics; conjugate points, variational methods, Myers theorem, nonpositive curvature. Further topics such as pinched manifolds, integral geometry, Kahler manifolds, symmetric spaces.",
    "prerequisites": [
      "MATH 225A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH226A"
  },
  {
    "course_code": "MATH 226B",
    "units": 4,
    "title": "Differential Geometry",
    "description": "Lecture, three hours. Requisite: course 225A. Manifold theory; connections, curvature, torsion, and parallelism. Riemannian manifolds; completeness, submanifolds, constant curvature. Geodesics; conjugate points, variational methods, Myers theorem, nonpositive curvature. Further topics such as pinched manifolds, integral geometry, Kahler manifolds, symmetric spaces.",
    "prerequisites": [
      "MATH 225A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH226B"
  },
  {
    "course_code": "MATH 226C",
    "units": 4,
    "title": "Differential Geometry",
    "description": "Lecture, three hours. Requisite: course 225A. Manifold theory; connections, curvature, torsion, and parallelism. Riemannian manifolds; completeness, submanifolds, constant curvature. Geodesics; conjugate points, variational methods, Myers theorem, nonpositive curvature. Further topics such as pinched manifolds, integral geometry, Kahler manifolds, symmetric spaces.",
    "prerequisites": [
      "MATH 225A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH226C"
  },
  {
    "course_code": "MATH 227A",
    "units": 4,
    "title": "Algebraic Topology",
    "description": "Lecture, three hours. Requisite: course 225B. CW complexes, fiber bundles, homotopy theory, cohomology theory, spectral sequences.",
    "prerequisites": [
      "MATH 225B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH227A"
  },
  {
    "course_code": "MATH 227B",
    "units": 4,
    "title": "Algebraic Topology",
    "description": "Lecture, three hours. Requisite: course 225B. CW complexes, fiber bundles, homotopy theory, cohomology theory, spectral sequences.",
    "prerequisites": [
      "MATH 225B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH227B"
  },
  {
    "course_code": "MATH 229A",
    "units": 4,
    "title": "Lie Groups and Lie Algebras",
    "description": "Preparation: knowledge of basic theory of topological groups and differentiable manifolds. Lie groups, Lie algebras, subgroups, subalgebras. Exponential map. Universal enveloping algebra. Campbell/Hausdorff formula. Nilpotent and solvable Lie algebras. Cohomology of Lie algebras. Theorems of Weyl, Levi-Mal’cev. Semi-simple Lie algebras. Classification of simple Lie algebras. Representations. Compact groups. Weyl character formula.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH229A"
  },
  {
    "course_code": "MATH 229B",
    "units": 4,
    "title": "Lie Groups and Lie Algebras",
    "description": "Preparation: knowledge of basic theory of topological groups and differentiable manifolds. Lie groups, Lie algebras, subgroups, subalgebras. Exponential map. Universal enveloping algebra. Campbell/Hausdorff formula. Nilpotent and solvable Lie algebras. Cohomology of Lie algebras. Theorems of Weyl, Levi-Mal’cev. Semi-simple Lie algebras. Classification of simple Lie algebras. Representations. Compact groups. Weyl character formula.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH229B"
  },
  {
    "course_code": "MATH 229C",
    "units": 4,
    "title": "Lie Groups and Lie Algebras",
    "description": "Preparation: knowledge of basic theory of topological groups and differentiable manifolds. Lie groups, Lie algebras, subgroups, subalgebras. Exponential map. Universal enveloping algebra. Campbell/Hausdorff formula. Nilpotent and solvable Lie algebras. Cohomology of Lie algebras. Theorems of Weyl, Levi-Mal’cev. Semi-simple Lie algebras. Classification of simple Lie algebras. Representations. Compact groups. Weyl character formula.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH229C"
  },
  {
    "course_code": "MATH 233",
    "units": 4,
    "title": "Partial Differential Equations on Manifolds",
    "description": "Lecture, three hours. Requisites: courses 226A, 251A. Topics may include Laplacian operator on a Riemannian manifold, eigenvalues, Atiyah/Singer index theorem, isoperimetric inequalities, elliptic estimates, harmonic functions, function theory on manifolds, Green’s function, heat equation, minimal hypersurfaces, prescribed curvature equations, harmonic maps, Yang/Mills equation, Monge/Ampere equations.",
    "prerequisites": [
      "MATH 226A",
      "MATH 251A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH233"
  },
  {
    "course_code": "MATH 234",
    "units": 4,
    "title": "Topics in Differential Geometry",
    "description": "Lecture, three hours. Requisites: courses 226A, 226B. Complex and Kahler geometry, Hodge theory, homogeneous manifolds and symmetric spaces, finiteness and convergence theorems for Riemannian manifolds, almost flat manifolds, closed geodesics, manifolds of positive scalar curvature, manifolds of constant curvature. Topics vary from year to year. May be repeated for credit by petition.",
    "prerequisites": [
      "MATH 226A",
      "MATH 226B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH234"
  },
  {
    "course_code": "MATH 235",
    "units": 4,
    "title": "Topics in Manifold Theory",
    "description": "Lecture, three hours. Requisites: courses 225A, 225B. Emphasis on low-dimensional manifolds. Structure and classification of manifolds, automorphisms of manifolds, submanifolds (e.g., knots and links). Topics vary from year to year. May be repeated for credit by petition.",
    "prerequisites": [
      "MATH 225A",
      "MATH 225B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH235"
  },
  {
    "course_code": "MATH 236",
    "units": 4,
    "title": "Topics in Geometric Topology",
    "description": "Lecture, three hours. Requisites: courses 225A, 225B. Decomposition spaces, surgery theory, group actions, dimension theory, infinite dimensional topology. Topics vary from year to year. May be repeated for credit by petition.",
    "prerequisites": [
      "MATH 225A",
      "MATH 225B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH236"
  },
  {
    "course_code": "MATH 237",
    "units": 4,
    "title": "Topics in Algebraic Topology",
    "description": "Lecture, three hours. Requisites: courses 227A, 227B. Fixed-point theory, fiber spaces and classifying spaces, characteristic classes, generalized homology and cohomology theories. Topics vary from year to year. May be repeated for credit by petition.",
    "prerequisites": [
      "MATH 227A",
      "MATH 227B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH237"
  },
  {
    "course_code": "MATH 238A",
    "units": 4,
    "title": "Dynamical Systems",
    "description": "Lecture, three hours. Recommended preparation: first-year analysis courses. Topics include qualitative theory of differential equations, bifurcation theory, and Hamiltonian systems; differential dynamics, including hyperbolic theory and quasiperiodic dynamics; ergodic theory; low-dimensional dynamics. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH238A"
  },
  {
    "course_code": "MATH 238B",
    "units": 4,
    "title": "Dynamical Systems",
    "description": "Lecture, three hours. Recommended preparation: first-year analysis courses. Topics include qualitative theory of differential equations, bifurcation theory, and Hamiltonian systems; differential dynamics, including hyperbolic theory and quasiperiodic dynamics; ergodic theory; low-dimensional dynamics. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH238B"
  },
  {
    "course_code": "MATH 240",
    "units": 4,
    "title": "Methods of Set Theory",
    "description": "Lecture, three hours. Requisites: courses 110A, 110B, 121, 131A, 131B. Naive, axiomatic set theory, axiom of choice and its equivalents, well-orderings, transfinite induction, ordinal and cardinal arithmetic. Applications to algebra: Hamel bases, Stone representation theorem. Applications to analysis and topology: Cantor/Bendixson theorem, counterexamples in measure theory, Borel and analytic sets, Choquet theorem.",
    "prerequisites": [
      "MATH 110A",
      "MATH 110B",
      "MATH 121",
      "MATH 131A",
      "MATH 131B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH240"
  },
  {
    "course_code": "MATH 245A",
    "units": 4,
    "title": "Real Analysis",
    "description": "Lecture, three hours. Requisites: courses 121, 131A, 131B. Basic measure theory. Measure theory on locally compact spaces. Fubini theorem. Elementary aspects of Banach and Hilbert spaces and linear operators. Function spaces. Radon/Nikodym theorem. Fourier transform and Plancherel on Rn and Tn.",
    "prerequisites": [
      "MATH 121",
      "MATH 131A",
      "MATH 131B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH245A"
  },
  {
    "course_code": "MATH 245B",
    "units": 4,
    "title": "Real Analysis",
    "description": "Lecture, three hours. Requisites: courses 121, 131A, 131B. Basic measure theory. Measure theory on locally compact spaces. Fubini theorem. Elementary aspects of Banach and Hilbert spaces and linear operators. Function spaces. Radon/Nikodym theorem. Fourier transform and Plancherel on Rn and Tn.",
    "prerequisites": [
      "MATH 121",
      "MATH 131A",
      "MATH 131B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH245B"
  },
  {
    "course_code": "MATH 245C",
    "units": 4,
    "title": "Real Analysis",
    "description": "Lecture, three hours. Requisites: courses 121, 131A, 131B. Basic measure theory. Measure theory on locally compact spaces. Fubini theorem. Elementary aspects of Banach and Hilbert spaces and linear operators. Function spaces. Radon/Nikodym theorem. Fourier transform and Plancherel on Rn and Tn.",
    "prerequisites": [
      "MATH 121",
      "MATH 131A",
      "MATH 131B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH245C"
  },
  {
    "course_code": "MATH 246A",
    "units": 4,
    "title": "Complex Analysis",
    "description": "Requisites: courses 131A, 131B. Students with credit for course 132 cannot receive MA degree credit for course 246A. Cauchy/Riemann equations. Cauchy theorem. Cauchy integral formula and residue calculus. Power series. Normal families. Harmonic functions. Linear fractional transformations. Conformal mappings. Analytic continuation. Examples of Riemann surfaces. Infinite products. Partial fractions. Classical transcendental functions. Elliptic functions.",
    "prerequisites": [
      "MATH 131A",
      "MATH 131B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH246A"
  },
  {
    "course_code": "MATH 246B",
    "units": 4,
    "title": "Complex Analysis",
    "description": "Requisites: courses 131A, 131B. Cauchy/Riemann equations. Cauchy theorem. Cauchy integral formula and residue calculus. Power series. Normal families. Harmonic functions. Linear fractional transformations. Conformal mappings. Analytic continuation. Examples of Riemann surfaces. Infinite products. Partial fractions. Classical transcendental functions. Elliptic functions.",
    "prerequisites": [
      "MATH 131A",
      "MATH 131B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH246B"
  },
  {
    "course_code": "MATH 246C",
    "units": 4,
    "title": "Complex Analysis",
    "description": "Requisites: courses 131A, 131B. Cauchy/Riemann equations. Cauchy theorem. Cauchy integral formula and residue calculus. Power series. Normal families. Harmonic functions. Linear fractional transformations. Conformal mappings. Analytic continuation. Examples of Riemann surfaces. Infinite products. Partial fractions. Classical transcendental functions. Elliptic functions.",
    "prerequisites": [
      "MATH 131A",
      "MATH 131B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH246C"
  },
  {
    "course_code": "MATH 247A",
    "units": 4,
    "title": "Classical Fourier Analysis",
    "description": "Lecture, three hours. Requisites: courses 245A, 245B, 246A. Distribution on Rn and Tn. Principal values; other examples. Distributions with submanifolds as supports. Kernel theorem. Convolution; examples of singular integrals. Tempered distributions and Fourier transform theory on Rn. Distributions with compact or one-sided supports and their complex Fourier transforms.",
    "prerequisites": [
      "MATH 245A",
      "MATH 245B",
      "MATH 246A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH247A"
  },
  {
    "course_code": "MATH 247B",
    "units": 4,
    "title": "Classical Fourier Analysis",
    "description": "Lecture, three hours. Requisites: courses 245A, 245B, 246A. Distribution on Rn and Tn. Principal values; other examples. Distributions with submanifolds as supports. Kernel theorem. Convolution; examples of singular integrals. Tempered distributions and Fourier transform theory on Rn. Distributions with compact or one-sided supports and their complex Fourier transforms.",
    "prerequisites": [
      "MATH 245A",
      "MATH 245B",
      "MATH 246A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH247B"
  },
  {
    "course_code": "MATH 250A",
    "units": 4,
    "title": "Ordinary Differential Equations",
    "description": "Requisite: course 246A. Basic theory of ordinary differential equations. Existence and uniqueness of solutions. Continuity with respect to initial conditions and parameters. Linear systems and nth order equations. Analytic systems with isolated singularities. Self-adjoint boundary value problems on finite intervals.",
    "prerequisites": [
      "MATH 246A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH250A"
  },
  {
    "course_code": "MATH 250B",
    "units": 4,
    "title": "Nonlinear Ordinary Differential Equations",
    "description": "Requisite: course 250A. Asymptotic behavior of nonlinear systems. Stability. Existence of periodic solutions. Perturbation theory of two-dimensional real autonomous systems. Poincaré/Bendixson theory.",
    "prerequisites": [
      "MATH 250A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH250B"
  },
  {
    "course_code": "MATH 250C",
    "units": 4,
    "title": "Advanced Topics in Ordinary Differential Equations",
    "description": "Requisites: courses 250A, 250B. Selected topics, such as spectral theory or ordinary differential operators, nonlinear boundary value problems, celestial mechanics, approximation of solutions, and Volterra equations.",
    "prerequisites": [
      "MATH 250A",
      "MATH 250B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH250C"
  },
  {
    "course_code": "MATH 251A",
    "units": 4,
    "title": "Introductory Partial Differential Equations",
    "description": "Classical theory of heat, wave, and potential equations; fundamental solutions, characteristics and Huygens principle, properties of harmonic functions. Classification of second-order differential operators. Maximum principles, energy methods, uniqueness theorems. Additional topics as time permits.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH251A"
  },
  {
    "course_code": "MATH 251B",
    "units": 4,
    "title": "Topics in Partial Differential Equations",
    "description": "In-depth introduction to topics of current interest in partial differential equations or their applications.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH251B"
  },
  {
    "course_code": "MATH 251C",
    "units": 4,
    "title": "Topics in Partial Differential Equations",
    "description": "In-depth introduction to topics of current interest in partial differential equations or their applications.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH251C"
  },
  {
    "course_code": "MATH 252A",
    "units": 4,
    "title": "Topics in Complex Analysis",
    "description": "Lecture, three hours. Requisites: courses 245A, 245B, 245C, 246A, 246B, 246C. Potential theory, subharmonic functions, harmonic measure; Hardy spaces; entire functions; univalent functions; Riemann surfaces; extremal length, variational methods, quasi-conformal mappings. Topics vary from year to year. S/U or letter grading.",
    "prerequisites": [
      "MATH 245A",
      "MATH 245B",
      "MATH 245C",
      "MATH 246A",
      "MATH 246B",
      "MATH 246C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH252A"
  },
  {
    "course_code": "MATH 252B",
    "units": 4,
    "title": "Topics in Complex Analysis",
    "description": "Lecture, three hours. Requisites: courses 245A, 245B, 245C, 246A, 246B, 246C. Potential theory, subharmonic functions, harmonic measure; Hardy spaces; entire functions; univalent functions; Riemann surfaces; extremal length, variational methods, quasi-conformal mappings. Topics vary from year to year. S/U or letter grading.",
    "prerequisites": [
      "MATH 245A",
      "MATH 245B",
      "MATH 245C",
      "MATH 246A",
      "MATH 246B",
      "MATH 246C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH252B"
  },
  {
    "course_code": "MATH 253A",
    "units": 4,
    "title": "Several Complex Variables",
    "description": "Requisites: courses 245A, 245B, 245C, 246A, 246B, 246C. Introduction to analytic functions of several complex variables. The d-bar problem, Cousin problems, domains of holomorphy, complex manifolds.",
    "prerequisites": [
      "MATH 245A",
      "MATH 245B",
      "MATH 245C",
      "MATH 246A",
      "MATH 246B",
      "MATH 246C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH253A"
  },
  {
    "course_code": "MATH 253B",
    "units": 4,
    "title": "Several Complex Variables",
    "description": "Requisites: courses 245A, 245B, 245C, 246A, 246B, 246C. Introduction to analytic functions of several complex variables. The d-bar problem, Cousin problems, domains of holomorphy, complex manifolds.",
    "prerequisites": [
      "MATH 245A",
      "MATH 245B",
      "MATH 245C",
      "MATH 246A",
      "MATH 246B",
      "MATH 246C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH253B"
  },
  {
    "course_code": "MATH 254A",
    "units": 4,
    "title": "Topics in Real Analysis",
    "description": "Requisites: courses 245A, 245B, 245C, 246A, 246B, 246C. Selected topics in analysis and its applications to geometry and differential equations. Topics may vary from year to year. May be repeated for credit by petition.",
    "prerequisites": [
      "MATH 245A",
      "MATH 245B",
      "MATH 245C",
      "MATH 246A",
      "MATH 246B",
      "MATH 246C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH254A"
  },
  {
    "course_code": "MATH 254B",
    "units": 4,
    "title": "Topics in Real Analysis",
    "description": "Requisites: courses 245A, 245B, 245C, 246A, 246B, 246C. Selected topics in analysis and its applications to geometry and differential equations. Topics may vary from year to year. May be repeated for credit by petition.",
    "prerequisites": [
      "MATH 245A",
      "MATH 245B",
      "MATH 245C",
      "MATH 246A",
      "MATH 246B",
      "MATH 246C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH254B"
  },
  {
    "course_code": "MATH 255A",
    "units": 4,
    "title": "Functional Analysis",
    "description": "Requisites: courses 245A and 245B, or 265A and 265B, and 246A. Banach spaces, basic principles. Weak topologies. Compact operators. Fredholm operators. Special spaces including Hilbert spaces and C(X).",
    "prerequisites": [
      "MATH 245A",
      "MATH 245B",
      "MATH 265A",
      "MATH 265B",
      "MATH 246A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH255A"
  },
  {
    "course_code": "MATH 255B",
    "units": 4,
    "title": "Topics in Functional Analysis",
    "description": "Requisite: course 255A. Topics include Banach algebras, operators on Banach spaces and Hilbert space, semi-groups of operators, linear topological vector spaces, and other related areas.",
    "prerequisites": [
      "MATH 255A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH255B"
  },
  {
    "course_code": "MATH 255C",
    "units": 4,
    "title": "Topics in Functional Analysis",
    "description": "Requisite: course 255A. Topics include Banach algebras, operators on Banach spaces and Hilbert space, semi-groups of operators, linear topological vector spaces, and other related areas.",
    "prerequisites": [
      "MATH 255A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH255C"
  },
  {
    "course_code": "MATH 256A",
    "units": 4,
    "title": "Topological Groups and Their Representations",
    "description": "Lecture, three hours. Requisite: course 255A. Topological groups and their basic properties. Haar measure. Compact groups and their representations. Duality and Fourier analysis on locally compact abelian groups. Induced representations, Frobenius reciprocity. Representations of special groups (Lorentz, Galilean, etc.). Projective representations. Representations of totally disconnected groups. S/U or letter grading.",
    "prerequisites": [
      "MATH 255A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH256A"
  },
  {
    "course_code": "MATH 256B",
    "units": 4,
    "title": "Topological Groups and Their Representations",
    "description": "Lecture, three hours. Requisite: course 255A. Topological groups and their basic properties. Haar measure. Compact groups and their representations. Duality and Fourier analysis on locally compact abelian groups. Induced representations, Frobenius reciprocity. Representations of special groups (Lorentz, Galilean, etc.). Projective representations. Representations of totally disconnected groups. S/U or letter grading.",
    "prerequisites": [
      "MATH 255A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH256B"
  },
  {
    "course_code": "MATH 259A",
    "units": 4,
    "title": "Operator Algebras in Hilbert Space",
    "description": "Requisites: courses 255A, 255B, 255C. Selected topics from theories of C* and von Neumann algebras. Applications.",
    "prerequisites": [
      "MATH 255A",
      "MATH 255B",
      "MATH 255C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH259A"
  },
  {
    "course_code": "MATH 259B",
    "units": 4,
    "title": "Operator Algebras in Hilbert Space",
    "description": "Requisites: courses 255A, 255B, 255C. Selected topics from theories of C* and von Neumann algebras. Applications.",
    "prerequisites": [
      "MATH 255A",
      "MATH 255B",
      "MATH 255C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH259B"
  },
  {
    "course_code": "MATH 260",
    "units": 4,
    "title": "Introduction to Applied Mathematics",
    "description": "Requisite: course 142. Construction, analysis, and interpretation of mathematical models of problems which arise outside of mathematics.",
    "prerequisites": [
      "MATH 142"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH260"
  },
  {
    "course_code": "MATH 261",
    "units": 4,
    "title": "Game Theory",
    "description": "Lecture, three hours. Designed for graduate mathematics students. Bargaining theory, core, value, other solution concepts. Applications to oligopoly, general exchange and production economies, and allocation of joint costs. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH261"
  },
  {
    "course_code": "MATH 264",
    "units": 4,
    "title": "Applied Complex Analysis",
    "description": "Requisite: course 246A. Topics include contour integration conformal mapping, differential equations in complex plane, special functions, asymptotic series, Fourier and Laplace transforms, singular integral equations.",
    "prerequisites": [
      "MATH 246A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH264"
  },
  {
    "course_code": "MATH 265A",
    "units": 4,
    "title": "Real Analysis for Applications",
    "description": "Requisites: courses 131A, 131B. Not open for credit to students with credit for courses 245A, 245B, 245C. Lebesgue measure and integration on real line, absolutely continuous functions, functions of bounded variation, L2- and Lp-spaces. Fourier series. General measure and integrations, Fubini and Radon/Nikodym theorems, representation of functionals, Fourier integrals.",
    "prerequisites": [
      "MATH 131A",
      "MATH 131B"
    ],
    "credit_exclusions": [
      "MATH 245A",
      "MATH 245C",
      "MATH 245B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH265A"
  },
  {
    "course_code": "MATH 265B",
    "units": 4,
    "title": "Real Analysis for Applications",
    "description": "Requisites: courses 131A, 131B. Not open for credit to students with credit for courses 245A, 245B, 245C. Lebesgue measure and integration on real line, absolutely continuous functions, functions of bounded variation, L2- and Lp-spaces. Fourier series. General measure and integrations, Fubini and Radon/Nikodym theorems, representation of functionals, Fourier integrals.",
    "prerequisites": [
      "MATH 131A",
      "MATH 131B"
    ],
    "credit_exclusions": [
      "MATH 245A",
      "MATH 245B",
      "MATH 245C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH265B"
  },
  {
    "course_code": "MATH 266A",
    "units": 4,
    "title": "Applied Ordinary Differential Equations",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 131A, 131B, 132, and 134 and 135, or 146. Spectral theory of regular boundary value problems and examples of singular Sturm/Liouville problems, related integral equations, phase/plane analysis of nonlinear equations. S/U or letter grading.",
    "prerequisites": [
      "MATH 131A",
      "MATH 131B",
      "MATH 132",
      "MATH 134",
      "MATH 135",
      "MATH 146"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH266A"
  },
  {
    "course_code": "MATH 266B",
    "units": 4,
    "title": "Applied Partial Differential Equations",
    "description": "Prerequisite: course 266A or consent of instructor. Classification of equations, classical potential theory, Dirichlet and Neumann problems. Green’s functions, spectral theory of Laplace equation in bounded domains, first-order equations, wave equations, Cauchy problem, energy conservation, heat equation, fundamental solution, equations of fluid mechanics and magnetohydrodynamics.",
    "prerequisites": [
      "MATH 266A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH266B"
  },
  {
    "course_code": "MATH 266C",
    "units": 4,
    "title": "Applied Partial Differential Equations",
    "description": "Prerequisite: course 266A or consent of instructor. Classification of equations, classical potential theory, Dirichlet and Neumann problems. Green’s functions, spectral theory of Laplace equation in bounded domains, first-order equations, wave equations, Cauchy problem, energy conservation, heat equation, fundamental solution, equations of fluid mechanics and magnetohydrodynamics.",
    "prerequisites": [
      "MATH 266A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH266C"
  },
  {
    "course_code": "MATH 266D",
    "units": 4,
    "title": "Applied Differential Equations",
    "description": "Requisites: courses 266A, 266B, 266C. Advanced topics in linear and nonlinear partial differential equations, with emphasis on energy estimates, numerical methods, and applications to fluid mechanics. Additional topics include dispersive waves, systems with multiple time scales, and applications to fluid mechanics.",
    "prerequisites": [
      "MATH 266A",
      "MATH 266B",
      "MATH 266C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH266D"
  },
  {
    "course_code": "MATH 266E",
    "units": 4,
    "title": "Applied Differential Equations",
    "description": "Requisites: courses 266A, 266B, 266C. Advanced topics in linear and nonlinear partial differential equations, with emphasis on energy estimates, numerical methods, and applications to fluid mechanics. Additional topics include dispersive waves, systems with multiple time scales, and applications to fluid mechanics.",
    "prerequisites": [
      "MATH 266A",
      "MATH 266B",
      "MATH 266C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH266E"
  },
  {
    "course_code": "MATH M268A",
    "units": 4,
    "title": "Functional Analysis for Applied Mathematics and Engineering",
    "description": "(Same as Electrical and Computer Engineering M208B.) Lecture, four hours. Requisites: courses 115A and 115B (or Electrical and Computer Engineering 208A), 131A, 131B, 132. Topics may include Lp spaces, Hilbert, Banach, and separable spaces; Fourier transforms; linear functionals. Riesz representation theory, linear operators and their adjoints; self-adjoint and compact operators. Spectral theory. Differential operators such as Laplacian and eigenvalue problems. Resolvent distributions and Green’s functions. Semigroups. Applications. S/U or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 115B",
      "EC ENGR 208A",
      "EC ENGR 131A",
      "EC ENGR 131B",
      "EC ENGR 132"
    ],
    "cross_listed": [
      "EC ENGR M208B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATHM268A"
  },
  {
    "course_code": "MATH M268B",
    "units": 4,
    "title": "Topics in Functional Analysis for Applied Mathematics and Engineering",
    "description": "(Same as Electrical and Computer Engineering M208C.) Lecture, four hours. Requisite: course M268A. Semigroups of linear operators over Hilbert spaces; generator and resolvent, generation theorems, Laplace inversion formula. Dissipative operators and contraction semigroups. Analytic semigroups and spectral representation. Semigroups with compact resolvents. Parabolic and hyperbolic systems. Controllability and stabilizability. Spectral theory of differential operators, PDEs, generalized functions. S/U or letter grading.",
    "prerequisites": [
      "MATH M268A"
    ],
    "cross_listed": [
      "EC ENGR M208C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATHM268B"
  },
  {
    "course_code": "MATH 268C",
    "units": 4,
    "title": "Topics in Applied Functional Analysis",
    "description": "Lecture, three hours. Requisite: course 255A. Topics include spectral theory with applications to ordinary differential operators, eigenvalue problems for differential equations, generalized functions, and partial differential equations. S/U or letter grading.",
    "prerequisites": [
      "MATH 255A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH268C"
  },
  {
    "course_code": "MATH 269A",
    "units": 4,
    "title": "Advanced Numerical Analysis",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 115A, 151A, 151B. Numerical solution for systems of ordinary differential equations; initial and boundary value problems. Numerical solution for elliptic, parabolic, and hyperbolic partial differential equations. Topics in computational linear algebra. S/U or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 151A",
      "MATH 151B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH269A"
  },
  {
    "course_code": "MATH 269B",
    "units": 4,
    "title": "Advanced Numerical Analysis",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 115A, 151A, 151B. Numerical solution for systems of ordinary differential equations; initial and boundary value problems. Numerical solution for elliptic, parabolic, and hyperbolic partial differential equations. Topics in computational linear algebra. S/U or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 151A",
      "MATH 151B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH269B"
  },
  {
    "course_code": "MATH 269C",
    "units": 4,
    "title": "Advanced Numerical Analysis",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 115A, 151A, 151B. Numerical solution for systems of ordinary differential equations; initial and boundary value problems. Numerical solution for elliptic, parabolic, and hyperbolic partial differential equations. Topics in computational linear algebra. S/U or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 151A",
      "MATH 151B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH269C"
  },
  {
    "course_code": "MATH 270A",
    "units": 4,
    "title": "Mathematical Aspects of Scientific Computing: Techniques of Scientific Computing",
    "description": "Lecture, three hours. Requisites: courses 115A, 151A, 151B, Program in Computing 10A. Mathematical modeling for computer applications, scientific programming languages, software development, graphics, implementation of numerical algorithms on different architectures, case studies. S/U or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 151A",
      "MATH 151B",
      "PIC 10A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH270A"
  },
  {
    "course_code": "MATH 270B",
    "units": 4,
    "title": "Mathematical Aspects of Scientific Computing: Computational Linear Algebra",
    "description": "Lecture, three hours. Requisites: courses 115A, 151A, 151B, Program in Computing 10A. Direct, fast, and iterative algorithms, overdetermined systems; singular value decomposition, regularization, sparse systems, algebraic eigenvalue problem. S/U or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 151A",
      "MATH 151B",
      "PIC 10A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH270B"
  },
  {
    "course_code": "MATH 270C",
    "units": 4,
    "title": "Mathematical Aspects of Scientific Computing: Computational Linear Algebra",
    "description": "Lecture, three hours. Requisites: courses 115A, 151A, 151B, Program in Computing 10A. Direct, fast, and iterative algorithms, overdetermined systems; singular value decomposition, regularization, sparse systems, algebraic eigenvalue problem. S/U or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 151A",
      "MATH 151B",
      "PIC 10A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH270C"
  },
  {
    "course_code": "MATH 270D",
    "units": 4,
    "title": "Mathematical Aspects of Scientific Computing: Computational Fluid Dynamics",
    "description": "Lecture, three hours. Requisites: courses 115A, 151A, 151B, Program in Computing 10A. Basic equations, finite difference, finite element, pseudo-spectral, and vortex methods; stability, accuracy, shock capturing, and boundary approximations. S/U or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 151A",
      "MATH 151B",
      "PIC 10A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH270D"
  },
  {
    "course_code": "MATH 270E",
    "units": 4,
    "title": "Mathematical Aspects of Scientific Computing: Computational Fluid Dynamics",
    "description": "Lecture, three hours. Requisites: courses 115A, 151A, 151B, Program in Computing 10A. Basic equations, finite difference, finite element, pseudo-spectral, and vortex methods; stability, accuracy, shock capturing, and boundary approximations. S/U or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 151A",
      "MATH 151B",
      "PIC 10A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH270E"
  },
  {
    "course_code": "MATH 270F",
    "units": 4,
    "title": "Mathematical Aspects of Scientific Computing: Parallel Numerical Algorithms",
    "description": "Lecture, three hours. Requisites: courses 115A, 151A, 151B, 270B, 270C, Program in Computing 10A. Recommended: courses 270A, 270D, 270E. Design, analysis, and implementation of numerical algorithms on modern vector and parallel computers. Discussion of classical numerical algorithms and novel parallel algorithms. Emphasis on applications to PDEs. S/U or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 151A",
      "MATH 151B",
      "MATH 270B",
      "MATH 270C",
      "PIC 10A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH270F"
  },
  {
    "course_code": "MATH 271A",
    "units": 4,
    "title": "Tensor Analysis",
    "description": "Requisite: course 131A. Algebra and calculus of tensors on n-dimensional manifolds. Curvilinear coordinates and coordinate-free methods. Covariant differentiation. Green/Stokes theorem for differential forms. Applications to topics such as continuum and particle mechanics.",
    "prerequisites": [
      "MATH 131A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH271A"
  },
  {
    "course_code": "MATH 271B",
    "units": 4,
    "title": "Analytical Mechanics",
    "description": "Prerequisites: course 271A, prior knowledge of mechanics. Newtonian and Lagrangian equations. Hamilton principle. Principle of least action. Holonomic and nonholonomic systems. Hamilton canonical equations, contact transformations, applications.",
    "prerequisites": [
      "MATH 271A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH271B"
  },
  {
    "course_code": "MATH 271C",
    "units": 4,
    "title": "Introduction to Relativity",
    "description": "Prerequisites: course 271A, prior knowledge of mechanics. Restricted theory of relativity. Extensions to general theory. Relativistic theory of gravitation.",
    "prerequisites": [
      "MATH 271A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH271C"
  },
  {
    "course_code": "MATH 271D",
    "units": 4,
    "title": "Wave Mechanics",
    "description": "General concepts of mechanical systems (states, space-time, logics, etc.). Classical and quantum examples. Correspondence principle. Spinors.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH271D"
  },
  {
    "course_code": "MATH 272A",
    "units": 4,
    "title": "Foundations of Continuum Mechanics",
    "description": "Lecture, three hours. Kinematic preliminaries, conservation laws for mass, momentum and energy, entropy production, constitutive laws. Linear elasticity, inviscid fluid, viscous fluid. Basic theorems of fluid mechanics. Simple solutions. Low Reynolds number flow, Stokes drag. High Reynolds number flow, boundary layers. Two-dimensional potential flow, simple aerofoil. Compressible flow, shocks.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH272A"
  },
  {
    "course_code": "MATH 272B",
    "units": 4,
    "title": "Mathematical Aspects of Fluid Mechanics",
    "description": "Lecture, three hours. Requisite: course 272A. Review of basic theory of moving continua, fluid equations, integral theorems. Simple solutions, flow created by slowly moving bodies, flows where viscosity is negligible, vortices, boundary layers and their separation, water waves, ship waves, compressional waves, shock waves, turbulence theory (overview).",
    "prerequisites": [
      "MATH 272A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH272B"
  },
  {
    "course_code": "MATH 272C",
    "units": 4,
    "title": "Magnetohydrodynamics",
    "description": "Lecture, three hours. Requisite: course 272A. Basic electromagnetism. Steady flows, Hartmann layers. Alfvén theorem and waves. Compressible media. Magnetostatic equilibria and stability.",
    "prerequisites": [
      "MATH 272A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH272C"
  },
  {
    "course_code": "MATH 272D",
    "units": 4,
    "title": "Rotating Fluids and Geophysical Fluid Dynamics",
    "description": "Lecture, three hours. Effects of Coriolis forces on fluid behavior. Inviscid flows, Taylor/Proudman theorem, Taylor columns, motions of bodies, inertial waves in spheres and spherical shells, Rossby waves. Ekman layers, spin-up. Shallow-water theory, wind-driven ocean circulation. Effects of stratification, Benard convection. Baroclinic instability, Eady model. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH272D"
  },
  {
    "course_code": "MATH 273A",
    "units": 4,
    "title": "Optimization and Calculus of Variations: Basic Optimization Theory",
    "description": "Lecture, three hours. Introduction to basic optimization theory, recognition of solutions, and geometry of optimization. Some convex analysis, separation hyperplane, and duality theory. Basic optimization algorithms and their rates of convergence. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH273A"
  },
  {
    "course_code": "MATH 273B",
    "units": 4,
    "title": "Optimization and Calculus of Variations: Calculus of Variations",
    "description": "Lecture, three hours. Abstract convex analysis and variational problems. Convexity, differentiability, existence, and characterization of minimizers. Polar functions, Lagrangians, saddle points, and duality techniques. Application of abstract mathematical theory to optimization problems of calculus of variations on Sobolev spaces. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH273B"
  },
  {
    "course_code": "MATH 273C",
    "units": 4,
    "title": "Optimization and Calculus of Variations: Numerical Optimization",
    "description": "Lecture, three hours. Derivation, analysis, and implementation of numerical methods for constrained and unconstrained optimization problems of variety of types and with data at different scales. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH273C"
  },
  {
    "course_code": "MATH 274A",
    "units": 4,
    "title": "Asymptotic Methods",
    "description": "Lecture, three hours. Requisite: course 132. Fundamental mathematics of asymptotic analysis, asymptotic expansions of Fourier integrals, method of stationary phase. Watson lemma, method of steepest descent, uniform asymptotic expansions, elementary perturbation problems. S/U or letter grading.",
    "prerequisites": [
      "MATH 132"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH274A"
  },
  {
    "course_code": "MATH 274B",
    "units": 4,
    "title": "Perturbation Methods",
    "description": "Lecture, three hours. Prerequisite: course 266A or equivalent. Boundary layer theory, matched asymptotic expansions, WKB theory. Problems with several time scales: Poincaré method, averaging techniques, multiple-scale analysis. Application to eigenvalue problems, nonlinear oscillations, wave propagation, and bifurcation problems. Examples from various fields of science and engineering.",
    "prerequisites": [
      "MATH 266A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH274B"
  },
  {
    "course_code": "MATH 274C",
    "units": 4,
    "title": "Perturbation Methods",
    "description": "Lecture, three hours. Prerequisite: course 266A or equivalent. Boundary layer theory, matched asymptotic expansions, WKB theory. Problems with several time scales: Poincaré method, averaging techniques, multiple-scale analysis. Application to eigenvalue problems, nonlinear oscillations, wave propagation, and bifurcation problems. Examples from various fields of science and engineering.",
    "prerequisites": [
      "MATH 266A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH274C"
  },
  {
    "course_code": "MATH 275A",
    "units": 4,
    "title": "Probability Theory",
    "description": "Lecture, three hours; discussion, one hour. Connection between probability theory and real analysis. Weak and strong laws of large numbers, central limit theorem, conditioning, ergodic theory, martingale theory. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH275A"
  },
  {
    "course_code": "MATH 275B",
    "units": 4,
    "title": "Probability Theory",
    "description": "Lecture, three hours; discussion, one hour. Connection between probability theory and real analysis. Weak and strong laws of large numbers, central limit theorem, conditioning, ergodic theory, martingale theory. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH275B"
  },
  {
    "course_code": "MATH 275C",
    "units": 4,
    "title": "Stochastic Processes",
    "description": "Lecture, three hours. Requisite: course 275B. Brownian motion, continuous-time martingales, Markov processes, potential theory. S/U or letter grading.",
    "prerequisites": [
      "MATH 275B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH275C"
  },
  {
    "course_code": "MATH 275D",
    "units": 4,
    "title": "Stochastic Calculus",
    "description": "Lecture, three hours. Requisite: course 275C. Stochastic integration, stochastic differential equations, Ito formula and its applications. S/U or letter grading.",
    "prerequisites": [
      "MATH 275C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH275D"
  },
  {
    "course_code": "MATH 275E",
    "units": 4,
    "title": "Stochastic Particle Systems",
    "description": "Lecture, three hours. Requisite: course 275C. Interacting particle systems, including contact process, stochastic Ising model, and exclusion processes; percolation theory. S/U or letter grading.",
    "prerequisites": [
      "MATH 275C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH275E"
  },
  {
    "course_code": "MATH 276",
    "units": 4,
    "title": "Topics in Network Science",
    "description": "Lecture, three hours. Requisites: courses 115A, 170A. Interesting and popular areas of network science. Topics vary from year to year and may include dynamical processes on networks, mesoscale structures in networks, time-dependent networks, multilayer networks, applications of networks, data analysis in networks, spatial networks, and others. Discussion of recent review articles and research papers. Some presentations by students. Joint project on topic in network science possibly leading to publication. S/U or letter grading.",
    "prerequisites": [
      "MATH 115A",
      "MATH 170A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH276"
  },
  {
    "course_code": "MATH 280",
    "units": 4,
    "title": "Programming++ for Mathematics Graduate Students",
    "description": "Lecture, three hours. Recommended preparation: at least one programming language. Limited to Mathematics PhD students. Core programming language concepts; object-oriented software design; creation of high-level functionality using object-oriented software constructs and techniques. Object oriented programming in C: variables, fundamental types, casting; control flow; functions, overloading, references, recursion; C-style arrays, vector and string class; programmer-defined structs and classes, constructor initializer lists; const correctness; overloading; memory management, copy and move constructors, copy and move assignment operators, destructors; iterators; inheritance and polymorphism. In-depth introduction to the Python programming language. Core Python language constructs: variables, control flow, functions, lists, tuples, sets, dictionaries, classes, magic methods, inheritance, exceptions; libraries including NumPy, Pandas, Matplotlib, scikit-learn. Application of C and/or Python to mathematical problems. May not be applied toward MA course requirements. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH280"
  },
  {
    "course_code": "MATH 285A",
    "units": 4,
    "title": "Seminar: History and Development of Mathematics",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285A"
  },
  {
    "course_code": "MATH 285B",
    "units": 4,
    "title": "Seminar: Number Theory",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285B"
  },
  {
    "course_code": "MATH 285C",
    "units": 4,
    "title": "Seminar: Algebra",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285C"
  },
  {
    "course_code": "MATH 285D",
    "units": 4,
    "title": "Seminar: Logic",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285D"
  },
  {
    "course_code": "MATH 285E",
    "units": 4,
    "title": "Seminar: Geometry",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285E"
  },
  {
    "course_code": "MATH 285F",
    "units": 4,
    "title": "Seminar: Topology",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285F"
  },
  {
    "course_code": "MATH 285G",
    "units": 4,
    "title": "Seminar: Analysis",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285G"
  },
  {
    "course_code": "MATH 285H",
    "units": 4,
    "title": "Seminar: Differential Equations",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285H"
  },
  {
    "course_code": "MATH 285I",
    "units": 4,
    "title": "Seminar: Functional Analysis",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285I"
  },
  {
    "course_code": "MATH 285J",
    "units": 4,
    "title": "Seminar: Applied Mathematics",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285J"
  },
  {
    "course_code": "MATH 285K",
    "units": 4,
    "title": "Seminar: Probability",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285K"
  },
  {
    "course_code": "MATH 285L",
    "units": 4,
    "title": "Seminar: Dynamical Systems",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285L"
  },
  {
    "course_code": "MATH 285N",
    "units": 4,
    "title": "Seminar: Combinatorics",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285N"
  },
  {
    "course_code": "MATH 285P",
    "units": 4,
    "title": "Seminar: Representation Theory",
    "description": "Seminar, three hours. No more than two 285 courses may be applied toward MA degree requirements except by prior consent of graduate vice chair. Topics in various branches of mathematics and their applications by means of lectures and informal conferences with staff members. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH285P"
  },
  {
    "course_code": "MATH 290A",
    "units": 4,
    "title": "Participating Seminar: Current Literature in History and Development of Mathematics",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290A"
  },
  {
    "course_code": "MATH 290B",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Number Theory",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290B"
  },
  {
    "course_code": "MATH 290C",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Algebra",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290C"
  },
  {
    "course_code": "MATH 290D",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Logic",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290D"
  },
  {
    "course_code": "MATH 290E",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Geometry",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290E"
  },
  {
    "course_code": "MATH 290F",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Topology",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290F"
  },
  {
    "course_code": "MATH 290G",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Analysis",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290G"
  },
  {
    "course_code": "MATH 290H",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Differential Equations",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290H"
  },
  {
    "course_code": "MATH 290I",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Functional Analysis",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290I"
  },
  {
    "course_code": "MATH 290J",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Applied Mathematics",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290J"
  },
  {
    "course_code": "MATH 290K",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Probability",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290K"
  },
  {
    "course_code": "MATH 290L",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Dynamical Systems",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290L"
  },
  {
    "course_code": "MATH 290M",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Mathematics",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290M"
  },
  {
    "course_code": "MATH 290N",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Combinatorics",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290N"
  },
  {
    "course_code": "MATH 290O",
    "units": 4,
    "title": "Participating Seminar: Current Literature in Cryptography",
    "description": "Seminar, three hours. Designed for PhD students. Readings and presentations of papers in mathematical literature under supervision of staff member. Two-hour presentation required. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH290O"
  },
  {
    "course_code": "MATH 296A",
    "units": 1,
    "title": "Research Seminar: History and Development of Mathematics",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296A"
  },
  {
    "course_code": "MATH 296B",
    "units": 1,
    "title": "Research Seminar: Number Theory",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296B"
  },
  {
    "course_code": "MATH 296C",
    "units": 1,
    "title": "Research Seminar: Algebra",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296C"
  },
  {
    "course_code": "MATH 296D",
    "units": 1,
    "title": "Research Seminar: Logic",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296D"
  },
  {
    "course_code": "MATH 296E",
    "units": 1,
    "title": "Research Seminar: Geometry",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296E"
  },
  {
    "course_code": "MATH 296F",
    "units": 1,
    "title": "Research Seminar: Topology",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296F"
  },
  {
    "course_code": "MATH 296G",
    "units": 1,
    "title": "Research Seminar: Analysis",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296G"
  },
  {
    "course_code": "MATH 296H",
    "units": 1,
    "title": "Research Seminar: Differential Equations",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296H"
  },
  {
    "course_code": "MATH 296I",
    "units": 1,
    "title": "Research Seminar: Functional Analysis",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296I"
  },
  {
    "course_code": "MATH 296J",
    "units": 1,
    "title": "Research Seminar: Applied Mathematics",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296J"
  },
  {
    "course_code": "MATH 296K",
    "units": 1,
    "title": "Research Seminar: Probability",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296K"
  },
  {
    "course_code": "MATH 296L",
    "units": 1,
    "title": "Research Seminar: Dynamical Systems",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296L"
  },
  {
    "course_code": "MATH 296M",
    "units": 1,
    "title": "Research Seminar: Mathematics",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296M"
  },
  {
    "course_code": "MATH 296N",
    "units": 1,
    "title": "Research Seminar: Combinatorics",
    "description": "Seminar, two hours. Seminars and discussion by staff and students. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH296N"
  },
  {
    "course_code": "MATH 370A",
    "units": 4,
    "title": "Teaching of Mathematics",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 33B. Limited to senior Mathematics Department majors. Course 370A is requisite to 370B. Topics in geometry, algebra, number theory, discrete mathematics, and functions presented from a problem-solving and student participation point of view, with emphasis on historical context and appropriate role of proof. S/U or letter grading.",
    "prerequisites": [
      "MATH 33B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH370A"
  },
  {
    "course_code": "MATH 370B",
    "units": 4,
    "title": "Teaching of Mathematics",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 33B, 370A. Limited to senior Mathematics Department majors. Topics in geometry, algebra, number theory, discrete mathematics, and functions presented from a problem-solving and student participation point of view, with emphasis on historical context and appropriate role of proof. S/U or letter grading.",
    "prerequisites": [
      "MATH 33B",
      "MATH 370A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH370B"
  },
  {
    "course_code": "MATH 495",
    "units": 2,
    "title": "Teaching College Mathematics",
    "description": "Seminar, one hour; two-day intensive training at beginning of Fall Quarter. Required of all new teaching assistants and new PhD students. Special course for teaching assistants designed to deal with problems and techniques of teaching college mathematics. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH495"
  },
  {
    "course_code": "MATH 495B",
    "units": 2,
    "title": "Technology and Teaching",
    "description": "Seminar, two hours; laboratory, one hour (optional). Requisite: course 495. Focus on undergraduate mathematics instruction. Web-based electronic communication, using technology for class organization, use of presentation software packages, and creation of electronic teaching portfolio. Provides mechanics of technology and forum for evaluation and comparison of technology in undergraduate mathematics teaching. S/U grading.",
    "prerequisites": [
      "MATH 495"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH495B"
  },
  {
    "course_code": "MATH 501",
    "units": 2,
    "title": "Cooperative Program",
    "description": "Preparation: consent of UCLA department chair and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH501"
  },
  {
    "course_code": "MATH 596",
    "units": 2,
    "title": "Directed Individual Study or Research",
    "description": "Tutorial, to be arranged. Supervised individual reading and study on project approved by a faculty member, which may be preparation for MA examination. May be repeated for credit, but only two 596 courses (8 units) may be applied toward MA degree unless departmental consent is obtained. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH596"
  },
  {
    "course_code": "MATH 599",
    "units": 2,
    "title": "Research in Mathematics",
    "description": "Tutorial, to be arranged. Preparation: advancement to PhD candidacy. Study and research for PhD dissertation. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MATH599"
  }
]