[
  {
    "course_code": "MED 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MED19"
  },
  {
    "course_code": "MED 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MED99"
  },
  {
    "course_code": "MED 160C",
    "units": 4,
    "title": "Health Outreach and Education to At-Risk Populations",
    "description": "Seminar, two hours; fieldwork, six to eight hours. Requisites: courses M160A, M160B. Processes involved with designing, delivering, and assessing community health education programs, under supervision of professional staff. P/NP or letter grading.",
    "prerequisites": [
      "MED M160A",
      "MED M160B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MED160C"
  },
  {
    "course_code": "MED 180",
    "units": 4,
    "title": "Special Topics in Medicine",
    "description": "Lecture, four hours; discussion, one hour. Medical topics of special interest to undergraduate students. Specific subjects may vary each term depending on particular interest of instructors and students. Topics may include East/West medicine and global medicine. May be repeated for credit with topic or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MED180"
  },
  {
    "course_code": "MED 185",
    "units": 5,
    "title": "Integrative East-West Medicine for Health and Wellness",
    "description": "Lecture, five hours. Introduction to integrative health care and wellness, particularly therapeutic approaches originating from traditional Chinese medicine. Study of theoretical underpinnings of integrative medicine and traditional Chinese medicine, management of personal well-being through experiential learning of various therapeutic modalities, and evidenced-based research and clinical applications of integrative medicine. Topics include integrative East-West medicine and its role in prevention and health cultivation; herbs, diet, and nutritional supplements; pain management using acupuncture, acupressure, massage, and other self-help techniques; integrative medicine research and evidence-based modalities; chronic stress and implications on sleep, inflammation, and maintaining healthy immune system. Incorporates hands-on practice and interactive sessions. P/NP or letter grading.",
    "satisfies": [
      "General Education - Life Sciences without Lab Credit (Scientific Inquiry)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MED185"
  },
  {
    "course_code": "MED 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MED188SA"
  },
  {
    "course_code": "MED 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "MED 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MED188SB"
  },
  {
    "course_code": "MED 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "MED 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MED188SC"
  },
  {
    "course_code": "MED 199",
    "units": 2,
    "title": "Directed Research in Medicine",
    "description": "Tutorial, two hours. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MED199"
  },
  {
    "course_code": "MED M215",
    "units": 2,
    "title": "Interdepartmental Course: Tropical Medicine",
    "description": "(Same as Pathology M215 and Pediatrics M215.) Lecture, two and one half hours. Preparation: basic courses in microbiology and parasitology of infectious diseases in School of Medicine or Public Health. Study of current knowledge about diseases prevalent in tropical areas of the world. Major emphasis on infectious diseases, with coverage of problems in nutrition and exotic noninfectious diseases. Syllabus supplements topics covered in classroom. S/U grading.",
    "cross_listed": [
      "PEDS M215",
      "PATH M215"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MEDM215"
  },
  {
    "course_code": "MED M256",
    "units": 4,
    "title": "Interdisciplinary Response to Infectious Disease Emergencies: Medicine Perspective",
    "description": "(Same as Community Health Sciences M256, Nursing M298, and Oral Biology M256.) Lecture, three hours; discussion, one hour. Designed to instill in professional students ideas of common emergency health problems and coordinated response, with specific attention to bioterrorism. Examination of tools to help students prevent, detect, and intervene in infectious disease emergencies. Interdisciplinary sessions also attended by students in Schools of Dentistry, Nursing, and Public Health during weeks two through five. Letter grading.",
    "cross_listed": [
      "ORL BIO M256",
      "NURSING M298",
      "COM HLT M256"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MEDM256"
  },
  {
    "course_code": "MED M260A",
    "units": 4,
    "title": "Methodology in Clinical Research I",
    "description": "(Same as Biomathematics M260A.) Lecture, four hours. Recommended preparation: MD, PhD, or dental degree. Requisites: Biomathematics 170A, 265A. Course M260A is requisite to M260B. Presentation of principles and practices of major disciplines underlying clinical research methodology, such as biostatistics, epidemiology, pharmacokinetics. S/U or letter grading.",
    "prerequisites": [
      "BIOMATH 170A",
      "BIOMATH 265A"
    ],
    "cross_listed": [
      "BIOMATH M260A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MEDM260A"
  },
  {
    "course_code": "MED M260B",
    "units": 4,
    "title": "Methodology in Clinical Research II",
    "description": "(Same as Biomathematics M260B.) Lecture, four hours. Recommended preparation: MD, PhD, or dental degree. Requisites: course M260A, Biomathematics 170A, 265A. Presentation of principles and practices of major disciplines underlying clinical research methodology, such as biostatistics, epidemiology, pharmacokinetics. S/U or letter grading.",
    "prerequisites": [
      "MED M260A",
      "BIOMATH 170A",
      "BIOMATH 265A"
    ],
    "cross_listed": [
      "BIOMATH M260B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MEDM260B"
  },
  {
    "course_code": "MED M260C",
    "units": 4,
    "title": "Methodology in Clinical Research III",
    "description": "(Same as Biomathematics M260C.) Discussion, four hours. Recommended preparation: MD, PhD, or dental degree. Presentation of principles and practices of major disciplines underlying clinical research methodology, such as biostatistics, epidemiology, pharmacokinetics. S/U or letter grading.",
    "cross_listed": [
      "BIOMATH M260C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MEDM260C"
  },
  {
    "course_code": "MED M261",
    "units": 2,
    "title": "Responsible Conduct of Research Involving Humans",
    "description": "(Same as Biomathematics M261.) Lecture, two hours; discussion, two hours. Preparation: completion of one basic course in protection of human research subjects through Collaborative Institutional Training Initiative. Discussion of current issues in responsible conduct of clinical research, including reporting of research, basis for authorship, issues in genetic research, principles and practice of research on humans, conflicts of interest, Institutional Review Board (IRB), and related topics. S/U or letter grading.",
    "cross_listed": [
      "BIOMATH M261"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MEDM261"
  },
  {
    "course_code": "MED M263",
    "units": 2,
    "title": "Clinical Pharmacology",
    "description": "(Same as Biomathematics M263 and Psychiatry M263.) Lecture, two hours. Preparation: completion of professional health sciences degree (MD, DDS, DNSc, or PhD). Overview of principles of clinical pharmacology, especially as they relate to clinical and translational medicine and to advances in contemporary medicine such as targeting, gene therapy, and genomics. Letter grading.",
    "cross_listed": [
      "PSYCTRY M263",
      "BIOMATH M263"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MEDM263"
  },
  {
    "course_code": "MED M270C",
    "units": 4,
    "title": "Advanced Modeling Methodology for Dynamic Biomedical Systems",
    "description": "(Same as Bioengineering M296A and Computer Science M296A.) Lecture, four hours; outside study, eight hours. Requisite: Electrical Engineering 141 or 142 or Mathematics 115A or Mechanical and Aerospace Engineering 171A. Development of dynamic systems modeling methodology for physiological, biomedical, pharmacological, chemical, and related systems. Control system, multicompartmental, noncompartmental, and input/output models, linear and nonlinear. Emphasis on model applications, limitations, and relevance in biomedical sciences and other limited data environments. Problem solving in PC laboratory. Letter grading.",
    "prerequisites": [
      "EC ENGR 141",
      "EC ENGR 142",
      "MATH 115A",
      "MECH&AE 171A"
    ],
    "cross_listed": [
      "BIOENGR M296A",
      "COM SCI M296A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MEDM270C"
  },
  {
    "course_code": "MED M270D",
    "units": 4,
    "title": "Optimal Parameter Estimation and Experiment Design for Biomedical Systems",
    "description": "(Same as Bioengineering M296B, Biomathematics M270, and Computer Science M296B.) Lecture, four hours; outside study, eight hours. Requisite: course M270C or Bioengineering CM286 or Biomathematics 220. Estimation methodology and model parameter estimation algorithms for fitting dynamic system models to biomedical data. Model discrimination methods. Theory and algorithms for designing optimal experiments for developing and quantifying models, with special focus on optimal sampling schedule design for kinetic models. Exploration of PC software for model building and optimal experiment design via applications in physiology and pharmacology. Letter grading.",
    "prerequisites": [
      "MED M270C",
      "BIOENGR CM286",
      "BIOMATH 220"
    ],
    "cross_listed": [
      "BIOMATH M270",
      "BIOENGR M296B",
      "COM SCI M296B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MEDM270D"
  },
  {
    "course_code": "MED M270E",
    "units": 4,
    "title": "Advanced Topics and Research in Biomedical Systems Modeling and Computing",
    "description": "(Same as Bioengineering M296C and Computer Science M296C.) Lecture, four hours; outside study, eight hours. Requisite: course M270D. Research techniques and experience on special topics involving models, modeling methods, and model/computing in biological and medical sciences. Review and critique of literature. Research problem searching and formulation. Approaches to solutions. Individual MS- and PhD-level project training. Letter grading.",
    "prerequisites": [
      "MED M270D"
    ],
    "cross_listed": [
      "BIOENGR M296C",
      "COM SCI M296C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MEDM270E"
  },
  {
    "course_code": "MED 501",
    "units": 2,
    "title": "Cooperative Program",
    "description": "Preparation: consent of UCLA department chair and graduate dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MED501"
  }
]