[
  {
    "course_code": "MGMT 1A",
    "units": 4,
    "title": "Principles of Accounting",
    "description": "Lecture, three hours; discussion, one hour. Not open to freshmen. Introduction to financial accounting principles, including preparation and analysis of financial transactions and financial statements. Valuation and recording of asset-related transactions, including cash, receivables, marketable securities, inventories, and long-lived assets. Current liabilities. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT1A"
  },
  {
    "course_code": "MGMT 1B",
    "units": 4,
    "title": "Principles of Accounting",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 1A. Not open to freshmen. Completion of balance sheet with emphasis on debt and equity, including in-depth introduction to time value of money concepts. Introduction to partnership and individual income tax accounting. P/NP or letter grading.",
    "prerequisites": [
      "MGMT 1A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT1B"
  },
  {
    "course_code": "MGMT 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT19"
  },
  {
    "course_code": "MGMT 88",
    "units": 1,
    "title": "Lower-Division Seminar: Special Topics in Management",
    "description": "Seminar, three hours; outside study, nine hours. Requisite: satisfaction of Entry-Level Writing requirement. Variable topics seminar that examines specific issues or problems and ways that professionals in management approach study of them. Students define, prepare, and present their own research projects with guidance of professional school faculty member. Letter grading.",
    "prerequisites": [],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT88"
  },
  {
    "course_code": "MGMT 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT89"
  },
  {
    "course_code": "MGMT 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors and departmental honors programs. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT89HC"
  },
  {
    "course_code": "MGMT 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT99"
  },
  {
    "course_code": "MGMT 105",
    "units": 4,
    "title": "International Business",
    "description": "Lecture, four hours. The world economy has experienced dramatic changes over the last 50 years, which have resulted in an increasing trend toward globalization. Changing attitudes and policies toward cross-border trade, along with advancements in technology, have fueled a building movement toward an interdependent, integrated global economic system. Recent events have highlighted volatile nature of globalization, and that globalization is not an inevitability. For businesses, this globalization process has transformed entire industries, and produced many opportunities and pitfalls that need to be carefully managed. Introduction to growing field of international business. Overview, historical background, and theories to understand context of international business. Students learn resulting opportunities and threats that firms face from increasingly globalized world, and strategies that managers can pursue to capitalize upon opportunities and counter threats. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT105"
  },
  {
    "course_code": "MGMT 108",
    "units": 4,
    "title": "Business Law",
    "description": "Lecture, three hours. Not open to freshmen. Essentials of contracts, agency, partnerships, corporations, and other select areas of law in a business environment. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT108"
  },
  {
    "course_code": "MGMT 109",
    "units": 4,
    "title": "International Business Law",
    "description": "Lecture, three hours. Recommended requisite: course 108. Study of international business legal environment, including general overview of international laws and organizations and comprehensive review of U.S. regulations of international business transactions. Special emphasis on international litigation, commercial transactions, regulation of investments, multinational corporations, and international banking. P/NP or letter grading.",
    "prerequisites": [
      "MGMT 108"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT109"
  },
  {
    "course_code": "MGMT 120A",
    "units": 5,
    "title": "Intermediate Financial Accounting I",
    "description": "Lecture, four hours. Requisite: course 1B. Intermediate-level course in theory and practice of financial accounting. Underlying concepts of asset valuation and income measurement. Measurement and reporting of current and long-term assets, including cash and marketable securities, inventories, plant assets and depreciation, and intangibles. P/NP or letter grading.",
    "prerequisites": [
      "MGMT 1B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT120A"
  },
  {
    "course_code": "MGMT 120B",
    "units": 5,
    "title": "Intermediate Financial Accounting II",
    "description": "Lecture, four hours. Requisite: course 120A. Intermediate-level course in theory and practice of financial accounting. Underlying concepts of liability recognition and expense, including leases, bonds, and pensions. Shareholder’s equity, including earnings per share. Accounting for changing prices. P/NP or letter grading.",
    "prerequisites": [
      "MGMT 120A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT120B"
  },
  {
    "course_code": "MGMT 121",
    "units": 4,
    "title": "Ethical Leadership in Accounting",
    "description": "Lecture, seven and one half hours. Not open to freshmen. Review of range of ethical considerations in business decisions involving individuals, corporations, society, and international business. Analysis of cases for presentation and discussion. What is ethical dilemma posed? What is range of possible decisions and band of ethical choices supporting them? Offered in summer only. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT121"
  },
  {
    "course_code": "MGMT 122",
    "units": 4,
    "title": "Management Accounting",
    "description": "Lecture, three hours. Requisites: course 1B, one statistics course. Nature, objectives, and procedures of cost accounting and control; job costing and process costing; accounting for manufacturing overhead; cost budgeting; cost reports; joint-product costing; distribution cost; standard costs; differential cost analysis; profit-volume relationships and break-even analysis. P/NP or letter grading.",
    "prerequisites": [
      "MGMT 1B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT122"
  },
  {
    "course_code": "MGMT 123",
    "units": 4,
    "title": "Auditing",
    "description": "Lecture, three hours. Requisite: course 120B. Comprehensive study of procedures used in verification of financial statements and related information, including ethical, legal, and other professional issues. Auditing of a complete set of financial statements. P/NP or letter grading.",
    "prerequisites": [
      "MGMT 120B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT123"
  },
  {
    "course_code": "MGMT 124",
    "units": 4,
    "title": "Advanced Accounting",
    "description": "Lecture, three hours. Requisite: course 120B. Specialized accounting topics in business combinations, consolidated financial statements, branch accounting, leveraged buyouts, Securities and Exchange Commission, foreign currency transactions, translation of foreign financial statements, partnership ownership changes and liquidations, governmental accounting, and bankruptcy. P/NP or letter grading.",
    "prerequisites": [
      "MGMT 120B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT124"
  },
  {
    "course_code": "MGMT 125",
    "units": 4,
    "title": "Audit and Fraud Examination",
    "description": "Lecture, three hours. Requisite: course 120B (may be taken concurrently). In-depth analysis of fraud examination, detection, and prevention; and auditing in post-Enron era. Discussions concerning the Sarbanes-Oxley Act of 2002 and Statement on Auditing Standards 99: Considerations of Fraud in a Financial Statement Audit (SAS 99). Overview of fraud. Analysis and discussion of the Enron case and other cases in order to understand the nature of fraud and its perpetrators. Addresses the auditing process, including the Sarbanes-Oxley Act of 2002 and SAS 99; and impact of Sarbanes-Oxley on financial statement auditing and public accounting. Letter grading.",
    "prerequisites": [
      "MGMT 120B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT125"
  },
  {
    "course_code": "MGMT 126",
    "units": 4,
    "title": "Financial Statement Analysis",
    "description": "Lecture, four hours. Requisite: course 120B. Comprehensive study of concepts and procedures used to interpret and analyze balance sheet, income statement, and statement of cash flows. Calculation and interpretation of financial ratios and credit analysis. Valuation theory using both discounted cash flows and residual income model. P/NP or letter grading.",
    "prerequisites": [
      "MGMT 120B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT126"
  },
  {
    "course_code": "MGMT 127A",
    "units": 4,
    "title": "Tax Principles and Policy",
    "description": "Lecture, three hours. Requisite: course 1B. Study of fundamental income tax problems encountered by individuals and other entities in analyzing business, investment, employment, and personal decisions. Special emphasis on role of tax rules in capital transactions and decision making. P/NP or letter grading.",
    "prerequisites": [
      "MGMT 1B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT127A"
  },
  {
    "course_code": "MGMT 127B",
    "units": 4,
    "title": "Corporate and Partnership Taxation",
    "description": "Lecture, three hours. Requisite: course 1B. Recommended: course 127A. Study of tax issues arising in formation, operation, and termination of corporations and partnerships. Special emphasis on closely held enterprises, including S corporations. P/NP or letter grading.",
    "prerequisites": [
      "MGMT 1B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT127B"
  },
  {
    "course_code": "MGMT 127C",
    "units": 4,
    "title": "International Taxation",
    "description": "Lecture, three hours. Recommended requisite: course 127A. Study of two principle areas of international taxation from U.S. regulatory perspective: taxation of American citizens and companies conducting business in international arena (outbound transactions) and taxation of foreign nationals and companies who invest or conduct business in the U.S. (inbound transactions). P/NP or letter grading.",
    "prerequisites": [
      "MGMT 127A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT127C"
  },
  {
    "course_code": "MGMT 128",
    "units": 4,
    "title": "Special Topics in Accounting",
    "description": "Lecture, three hours. Requisite: course 120B. Selected topics in public accounting, such as audit and fraud examination, mergers and acquisitions, public-company status and going-public process, role of partner, serving entrepreneurial clients, and fund accounting. Discussion of case study of current interest in accounting profession. Business plan preparation. P/NP or letter grading.",
    "prerequisites": [
      "MGMT 120B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT128"
  },
  {
    "course_code": "MGMT 130A",
    "units": 4,
    "title": "Basic Managerial Finance",
    "description": "Lecture, three hours. Requisites: course 1B, one statistics course. Not open for credit to students with credit for Economics 106F. Study of financial decision making by business firms, with emphasis on applications of economic and accounting principles in financial analysis, planning, and control. Extensive use of problems and cases to illustrate varied analytical techniques employed in decision making. P/NP or letter grading.",
    "prerequisites": [
      "MGMT 1B"
    ],
    "credit_exclusions": [
      "ECON 106F"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT130A"
  },
  {
    "course_code": "MGMT 140",
    "units": 4,
    "title": "Elements of Production and Operations Research",
    "description": "Lecture, four hours. Requisites: Mathematics 3A, 3B, 3C. Principles and decision analysis related to effective utilization of factors of production in manufacturing and nonmanufacturing activities. Analytical models and methods for allocation, transportation, inventories, replacement, scheduling, and facilities design. P/NP or letter grading.",
    "prerequisites": [
      "MATH 3A",
      "MATH 3B",
      "MATH 3C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT140"
  },
  {
    "course_code": "MGMT 142A",
    "units": 4,
    "title": "Analytics in Accounting I",
    "description": "Lecture, three hours. Not open to first years. Introduction to use of models and modeling in decision making, with focus on important types of models, their formulation and application, and insight and information that may be gained from use of modeling. Topics include pivot tables, data tables, lookup functionality, introduction to programming behind spreadsheets, software functionality and efficiency, and more. Applications are focused on accounting and finance, with emphasis on model formulation, interpretation of solutions, and understanding of mathematical versus verbal explanation of situations. Analytical focus on asking question, mastering data, preforming analysis, and communication of story. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT142A"
  },
  {
    "course_code": "MGMT 142B",
    "units": 4,
    "title": "Analytics in Accounting II",
    "description": "Lecture, three hours. Requisite: course 142A. Preparation: intermediate Excel user. Not open to first years. Topics include cleaning and analyzing data, and advanced dashboard techniques, to evaluate accounting data. All applications are related to accounting and finance. Includes developing analytics mindset, data scrubbing and preparation, and data quality. Emphasis on graphical and written techniques to communicate results. Letter grading.",
    "prerequisites": [
      "MGMT 142A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT142B"
  },
  {
    "course_code": "MGMT 142C",
    "units": 4,
    "title": "Analytics in Accounting III",
    "description": "Lecture, three hours. Requisite: course 142B. Preparation: intermediate Excel user. Not open to first years. Topics include cleaning and analyzing data, and advanced dashboard techniques, to evaluate accounting data. All applications are related to accounting and finance. Includes developing analytics mindset, data scrubbing and preparation, and data quality. Emphasis on graphical and written techniques to communicate results. Letter grading.",
    "prerequisites": [
      "MGMT 142B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT142C"
  },
  {
    "course_code": "MGMT 159",
    "units": 4,
    "title": "Foundations of Business and Entrepreneurship",
    "description": "Lecture, three hours. Introductory overview of core areas of business and entrepreneurship including accounting, finance, marketing, operations, organization behavior, and strategy. Discussion of concepts in context of large existing organizations, small businesses, and new entrepreneurial ventures. Students gain solid foundational knowledge of components of business as well as how organizations are managed in increasingly competitive and global economy. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT159"
  },
  {
    "course_code": "MGMT 160",
    "units": 4,
    "title": "Entrepreneurship and Venture Initiation",
    "description": "Lecture, three hours; discussion, one hour. Introduction to key concepts of entrepreneurship, including new product development, finance, business plan development, and technology commercialization. Basic tools and personal characteristics required for entrepreneurship. Terminology used by lawyers, accountants, venture capitalists, and other investors when forming and financing new companies to be developed as startups, spinouts from existing company, or acquisitions of existing company (or its assets). Assessment of feasibility of business concept and communication of concept to potential investors, employees, and business partners. Discussion of technology feasibility, intellectual property, and licensing. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT160"
  },
  {
    "course_code": "MGMT 161",
    "units": 4,
    "title": "Business Plan Development",
    "description": "Lecture, three hours. Enforced requisite: course 160. Fundamentals of developing effective business plans, both in presentation and written form. Basic principles of designing and articulating plans for sales, marketing, product or service, operations, financials, management, and staffing functions of new startup businesses. How to develop well-written investment-quality business plans and business plan presentations, understand various analytical processes required to produce such plans, improve student writing and oral presentation skills, and formally present their business plans to audience of angel and venture capital investors. Letter grading.",
    "prerequisites": [
      "MGMT 160"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT161"
  },
  {
    "course_code": "MGMT 162",
    "units": 4,
    "title": "Entrepreneurship and Technology Commercialization",
    "description": "Lecture, three hours. Designed for juniors/seniors. Introduction to transformation of new knowledge and inventions into viable commercial products and services, with particular emphasis on technology being developed at major research universities like UCLA. Initial emphasis on assessment and protection of intellectual property and early evaluation of technologies to determine potential for commercialization. How intellectual property in its various forms is protected and how rights to these assets are negotiated by parties involved. Examination of nature of contracts and negotiation between university technology transfer offices, researchers, technical experts, and early investors in commercialization space that might lead to patents, licenses, or new business development. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT162"
  },
  {
    "course_code": "MGMT 163",
    "units": 4,
    "title": "Entrepreneurship and New Product Development",
    "description": "Lecture, three hours. Designed for juniors/seniors. Introduction to new product innovation and management. Students assume role of product managers in identifying, developing, and commercializing new products through cases, businesses currently in news, team project, and readings to develop critical thinking, decision-making skills, and creativity in launch of successful new product (team project). Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT163"
  },
  {
    "course_code": "MGMT 164",
    "units": 4,
    "title": "Entrepreneurial Finance and Accounting",
    "description": "Lecture, three hours. Designed for juniors/seniors. Introduction to fundamental concepts of financial management of early-stage companies, with particular emphasis on capital formation of new ventures. Relationship between entrepreneurs and investors and discussion of different goals of founders and investors, including nature of negotiation and relationship between parties over time. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT164"
  },
  {
    "course_code": "MGMT 165",
    "units": 4,
    "title": "Marketing Principles for Entrepreneurs",
    "description": "Lecture, three hours. Study and application of analytic frameworks to assess market opportunities and implement marketing strategies for entrepreneurial firms. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT165"
  },
  {
    "course_code": "MGMT 167",
    "units": 4,
    "title": "Social Entrepreneurship",
    "description": "Lecture, three hours. Designed for juniors/seniors. Examination of fundamental challenges and opportunities of developing and managing enterprises with social missions. Use of framework to develop strategic implementation plan that incorporates external analysis, organizational assessment, strategy development, and executable action steps and draws on expertise and experience of faculty members and alumni as well as experts in fields of social entrepreneurship, nonprofit management, and strategic philanthropy who present select topics of interest. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT167"
  },
  {
    "course_code": "MGMT 168",
    "units": 4,
    "title": "Personal Financial Health: Theory and Practice",
    "description": "Lecture, three hours. Helps develop class of financially literate students who will be financially secure today and in future. Students gain knowledge, skills, and confidence to take charge of their financial futures and have potential to prosper. Covers many financial decisions made by entrepreneurs. Interplay between financial conditions of business and financial situation of owner is something that many entrepreneurs fail to plan for when they launch new business. Specific topics covered include budgeting, time value of money, installment purchases, protection of assets, principles of investing, retirement and estate planning, psychology of money, income taxes, banking, and credit. Topics from behavioral finance include suboptimal spending, mistakes investors make, and money and happiness. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT168"
  },
  {
    "course_code": "MGMT 169",
    "units": 4,
    "title": "Entrepreneurial Leadership and Practical Experience",
    "description": "Lecture, three hours; fieldwork, eight hours. Enrollment by instructor consent. Capstone for undergraduate minor in Entrepreneurship. Application of critical thinking, research skills, and education to one of following experiences: internship at off-site entrepreneurial firm, or active pursuit of entrepreneurial startup idea. Real-world experience supplemented with theoretical knowledge on entrepreneurial leadership, ethics, and professional branding. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT169"
  },
  {
    "course_code": "MGMT 170",
    "units": 4,
    "title": "Real Estate Finance and Investments",
    "description": "Lecture, three hours. Exploration of fundamentals of residential and commercial real estate finance, investment, and development. Study of qualitative concepts and quantitative tools necessary to develop real estate decision-making skills. Analysis of variety of case studies of finance, investment, and development projects from U.S., Europe, China, and Japan that highlight opportunities, risks, challenges, and solutions that were unique to each situation. Use of specially prepared Excel models to understand and evaluate financial aspects of transactions, consideration of macroeconomic context, and discussion of its potential impact on real estate finance and investment decisions. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT170"
  },
  {
    "course_code": "MGMT 180",
    "units": 4,
    "title": "Special Topics in Management",
    "description": "Lecture, four hours. Topics of special interest to undergraduate students. Specific subjects may vary each term depending on particular interest of instructors or students. May be repeated for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT180"
  },
  {
    "course_code": "MGMT 182",
    "units": 4,
    "title": "Leadership Principles and Practice",
    "description": "Lecture, six hours. Proven methods for motivating, and inspiring best performance, persuading, and influencing others; leading high-performance teams; creativity and innovation; decision-making, and negotiating skills, both one-on-one and in groups. Organizational examples, simulations, and in-class exercises. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT182"
  },
  {
    "course_code": "MGMT 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT188SA"
  },
  {
    "course_code": "MGMT 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "MGMT 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT188SB"
  },
  {
    "course_code": "MGMT 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "MGMT 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT188SC"
  },
  {
    "course_code": "MGMT 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT189"
  },
  {
    "course_code": "MGMT 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors and departmental honors programs. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT189HC"
  },
  {
    "course_code": "MGMT 194",
    "units": 2,
    "title": "Anderson School of Management Research Group Seminar",
    "description": "Seminar, two hours. Study and analysis of current topics in management and business. Discussion of current research and literature in research specialty of faculty instructor. P/NP grading",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT194"
  },
  {
    "course_code": "MGMT 195",
    "units": 2,
    "title": "Community or Corporate Internships in Management",
    "description": "Tutorial, to be arranged. Limited to juniors/seniors. Internship in supervised setting in community agency or business. Students meet on regular basis with instructor and provide periodic reports of their experience. May be repeated for maximum of 8 units. Individual contract with supervising faculty member required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT195"
  },
  {
    "course_code": "MGMT 199",
    "units": 2,
    "title": "Directed Research in Management",
    "description": "Tutorial, to be arranged. Limited to juniors/seniors. Supervised individual research or investigation of selected research topic under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT199"
  },
  {
    "course_code": "MGMT 201A",
    "units": 4,
    "title": "Business Forecasting: Turning Numbers into Knowledge",
    "description": "Discussion, three hours. Preparation: familiarity with linear regression. Examination of one approach to analytical thinking—forcing numerical and textual data into carefully formulated alternative models. Data studied include macroeconomic variables (growth, inflation, unemployment, interest rates, and exchange rates), industry data, and firm data. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT201A"
  },
  {
    "course_code": "MGMT 201B",
    "units": 4,
    "title": "Econometrics and Business Forecasting",
    "description": "Lecture, three hours. Development of standard topics in applied econometric modeling. Emphasis on assumptions underlying classical normal linear regression model, special problems in application, and interpretation of results. Practical applications extensively developed in student projects.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT201B"
  },
  {
    "course_code": "MGMT 202B",
    "units": 4,
    "title": "Economic Consulting and Applied Managerial Economics",
    "description": "Lecture, three hours. Requisites: courses 402, 405. Use of economic methods to analyze issues of intellectual property, environmental damage, trademark infringement, brand value, and consumer demand. Focus on econometric thinking and problem solving using case studies as basis for lectures and homework. S/U or letter grading.",
    "prerequisites": [
      "MGMT 402",
      "MGMT 405"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT202B"
  },
  {
    "course_code": "MGMT 203",
    "units": 4,
    "title": "Behavioral Economics",
    "description": "Lecture, three hours. Behavioral economics incorporatets insights from psychology (and otherr social sciences) to improve understanding of economic markets and decision making. By relaxing or replacing simplifying assumptions of standard economic models, behavioral economics aims to describe behavior with greater psychological realism and empirical accuracy. Overview of this rapidly developing field, and illustration of its implications for business and policy decisions across variety of contexts. Use of lectures, discussion, group interactions and projects, examination, and problem set to introduce topic of behavioral economics. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT203"
  },
  {
    "course_code": "MGMT 205A",
    "units": 4,
    "title": "International Business Economics",
    "description": "Requisite: course 405. International business environment, international economic institutions, national and regional trade policies and developments, trends in foreign markets, and international monetary problems, studied for their influence on organization and operation of the international corporation.",
    "prerequisites": [
      "MGMT 405"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT205A"
  },
  {
    "course_code": "MGMT 206",
    "units": 4,
    "title": "Global Trends",
    "description": "Lecture, three hours. Exploration of recent global trends affecting business. Global trends are social, economic, and geopolitical evolutions that have first-order effects on management practices and business opportunities around world. Global managers need to develop keen sense of these evolutions in order to lead successful businesses that can adapt to and take advantage of global trends. Study improves student understanding of these trends to become better managers. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT206"
  },
  {
    "course_code": "MGMT 209",
    "units": 4,
    "title": "Managing Complex Business Deals",
    "description": "Lecture, three hours. Preparation: familiarity with basic vocabulary and concepts, including basic principles of accounting and valuation. Advanced course in business organization. Examination of structure of business transactions and allocation of control, risk, and return. Topics include venture capital investments, debt and loan agreements, employment agreements, distribution and marketing agreements (including franchising), motion picture production/finance/distribution agreements, and joint ventures. Assigned reading and focus on documents that incorporate terms of business transactions of deals. Concurrently scheduled with Law 239. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT209"
  },
  {
    "course_code": "MGMT 209A",
    "units": 3,
    "title": "Managing Complex Business Deals",
    "description": "Lecture, three hours. Preparation: familiarity with basic vocabulary and concepts, including basic principles of accounting and valuation. Course 209A is enforced requisite to 209B. Advanced course in business organization. Examination of structure of business transactions and allocation of control, risk, and return. Topics include venture capital investments, debt and loan agreements, employment agreements, distribution and marketing agreements (including franchising), motion picture production/finance/distribution agreements, and joint ventures. Assigned reading and focus on documents that incorporate terms of business transactions of deals. Concurrently schedule with Law 239. In Progress grading (credit to be given only on completion of course 209B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT209A"
  },
  {
    "course_code": "MGMT 209B",
    "units": 1,
    "title": "Managing Complex Business Deals",
    "description": "Lecture, three hours. Preparation: familiarity with basic vocabulary and concepts, including basic principles of accounting and valuation. Enforced requisite: course 209A. Continuation of course 209A. Advanced course in business organization. Examination of structure of business transactions and allocation of control, risk, and return. Topics include venture capital investments, debt and loan agreements, employment agreements, distribution and marketing agreements (including franchising), motion picture production/finance/distribution agreements, and joint ventures. Assigned reading and focus on documents that incorporate terms of business transactions of deals. Concurrently schedule with Law 239. S/U or letter grading.",
    "prerequisites": [
      "MGMT 209A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT209B"
  },
  {
    "course_code": "MGMT 214",
    "units": 4,
    "title": "Managerial Decision Making",
    "description": "Lecture, three hours. Introduction to principles of rational judgment and choice, common behavioral biases of managers and consumers, and corrective tools and procedures, drawing heavily on disciplines of psychology and behavioral economics. Topics include decision structuring, chance processes, forecasting, confidence, likelihood judgment, risk perception and risk-taking, decision under uncertainty, multiattribute choice, framing and mental accounting, intertemporal choice, allocation decisions, organizational decision making, choice architecture, happiness, and well-being. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT214"
  },
  {
    "course_code": "MGMT 215A",
    "units": 4,
    "title": "Negotiations Analysis",
    "description": "Lecture, three hours. Series of negotiation exercises to foster development of students’ negotiation skills and experience. Use of economic concepts and simple analyses in exercise debriefs to gain insight and to develop framework applicable to business negotiations. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT215A"
  },
  {
    "course_code": "MGMT 215B",
    "units": 4,
    "title": "Market Entry Strategy",
    "description": "Lecture, three hours. Requisite: course 420. Analysis of strategic issues encountered by entrepreneurial and established companies in entering new markets. Emphasis on idea generation, timing, industry evolution, entry modes, optimal growth, and competitive interaction. S/U or letter grading.",
    "prerequisites": [
      "MGMT 420"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT215B"
  },
  {
    "course_code": "MGMT 217A",
    "units": 4,
    "title": "Decision Analysis",
    "description": "Lecture, three hours. Requisite: course 402. Managerial decision making occurs in presence of uncertainty which can be about events over which no individual has any control or it can be about what other individuals will do. Framework provided for structuring and analyzing such decisions, with application of framework to such scenarios as product development, litigation, business of treasure hunting, and bidding. S/U or letter grading.",
    "prerequisites": [
      "MGMT 402"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT217A"
  },
  {
    "course_code": "MGMT 218",
    "units": 4,
    "title": "Tools and Analysis for Business Strategy",
    "description": "Lecture, three hours. Goal is for students to become more comfortable with design, execution, and interpretation of data analysis that can meaningfully inform business strategy formulation. Pedagogical approach is firmly rooted in learning by doing. Use of variety of real-world examples to gain practice with quantitative methods that can be deployed in business settings to analyze underlying predictors and causes of firm success. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT218"
  },
  {
    "course_code": "MGMT 220",
    "units": 4,
    "title": "Corporate Financial Reporting",
    "description": "Lecture, three hours. Requisite: course 403. In-depth treatment of significant corporate financial reporting issues to enhance understanding of financial statements and student ability to interpret and use information contained in these disclosures. Emphasis on economic substance of transactions. S/U or letter grading.",
    "prerequisites": [
      "MGMT 403"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT220"
  },
  {
    "course_code": "MGMT 222",
    "units": 4,
    "title": "Corporate Decision Making and Incentives",
    "description": "Lecture, three hours. Requisite: course 403. Use of basic microeconomics to answer what information is needed to make managerial decisions, what incentives are needed to motivate managers, and how information should be recorded to facilitate both. Essential for careers in consulting, private equity, and general management. S/U or letter grading.",
    "prerequisites": [
      "MGMT 403"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT222"
  },
  {
    "course_code": "MGMT 223",
    "units": 4,
    "title": "Choice Architecture",
    "description": "Lecture, three hours. Leverages behavioral science principles to solve real societal and policy problems. Through partnerships with health, government, and industry contacts, students work in teams to identify behavioral problems within organizations; test and guide implementation of evidence-based solutions. Provides structured on-ramp to skilled application of behavioral insight in real-world contexts. Ideal for students who want to weave rigorous behavioral insight into their emerging leadership style. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT223"
  },
  {
    "course_code": "MGMT 224",
    "units": 4,
    "title": "Business Law for Managers and Entrepreneurs",
    "description": "Lecture, three hours. Introductory course that uses practical approach to teach students to recognize, understand, and manage legal issues. Topics include contract law, litigation process and alternatives, intellectual property law, business formation, corporate law, employment law, collateralized lending, and bankruptcy reorganizations. How to deal with potential legal issues before they become serious problems. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT224"
  },
  {
    "course_code": "MGMT M225",
    "units": 2,
    "title": "Law and Management of Nonprofit Organizations",
    "description": "(Same as Public Policy M229.) Lecture, three hours. Introduction to important legal, financial, and management issues confronting nonprofit organizations. Topics include how to start nonprofit tax-exempt organizations, qualifying and maintaining tax-exempt status under IRC Code Section 501(c)(3), corporate governance, political and legislative activity restrictions, and strategic planning, fundraising, nonprofit accounting, and employment law. S/U or letter grading.",
    "cross_listed": [
      "PUB PLC M229"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMTM225"
  },
  {
    "course_code": "MGMT 226",
    "units": 4,
    "title": "Special Advanced Topics in Accounting",
    "description": "Lecture, three hours. Requisite: course 403. Examination of advanced topics in accounting that arise in business combinations and international accounting practices, including principles underlying consolidated financial statements, treatment of unconsolidated subsidiaries and affiliate investments, translation of foreign exchange, and valuation of derivatives for hedging exchange risk. S/U or letter grading.",
    "prerequisites": [
      "MGMT 403"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT226"
  },
  {
    "course_code": "MGMT 227",
    "units": 4,
    "title": "Taxation and Management Decisions",
    "description": "Lecture, three hours. Requisite: course 403. Examination of impact of taxes on decisions of businesses and investors. Effects of taxes on investment decisions, mergers and acquisitions, capital structure, dividend policies, and employee compensation. S/U or letter grading.",
    "prerequisites": [
      "MGMT 403"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT227"
  },
  {
    "course_code": "MGMT 228",
    "units": 4,
    "title": "Financial Statement Analysis",
    "description": "Lecture, three hours. Requisite: course 403. Preparation: course 220 (corporate financial reporting), or comfort with learning new concepts independently prior to covering in class. Development of skills and tools for using financial statements and other information to evaluate and value companies. Financial analysis segment covers use of accounting to evaluate company performance. Forecasting and valuation segment develops of techniques for estimating fundamental value of company, and evaluating estimates. Applied course with some valuation theory, but only cursory reviews of accounting principles. S/U or letter grading.",
    "prerequisites": [
      "MGMT 403"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT228"
  },
  {
    "course_code": "MGMT 231C",
    "units": 4,
    "title": "Corporate Valuation",
    "description": "Lecture, three hours. Requisites: courses 408, 430. Lectures, discussions, and student presentations. Issues and analytical tools relevant for valuing projects, divisions, and corporations. Theories of discounted cash flow valuation (DCF) and relative valuation using market multiples. Theories of practice to value different projects, including IPO, mergers and acquisitions, divestitures, and private firms. Exploration of how real options affect investment decisions and how they can be identified and valued. Letter grading.",
    "prerequisites": [
      "MGMT 408",
      "MGMT 430"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT231C"
  },
  {
    "course_code": "MGMT 231D",
    "units": 4,
    "title": "Takeovers, Restructuring, and Corporate Governance",
    "description": "Lecture, three hours. Requisite: Management-Executive MBA 408 or Management-Full-Time MBA 408 or Management-Fully Employed MBA 408. Students gain solid understanding of the opportunities and risks posed by mergers, acquisitions, and restructurings (M&A). Students gain basic conceptual and technical tools to evaluate M&A transactions as well as insight into the practical deal-making skills that often spell the difference between success and failure. Topics include the strategic rationale for the deal; valuation and structuring considerations; legal, regulatory, and tax environments; perspectives of strategic versus financial buyers; and differences between healthy and distressed M&A. S/U or letter grading.",
    "prerequisites": [
      "Executive MBA 408",
      "Time MBA 408",
      "Fully Employed MBA 408"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT231D"
  },
  {
    "course_code": "MGMT 231E",
    "units": 4,
    "title": "Managing Finance and Financing Emerging Enterprises",
    "description": "Lecture, three hours. Requisites: courses 230 (or 430), 403, 408. Designed for second-year graduate students. Emphasis on financial, control, and investment issues confronting rapidly growing companies in entrepreneurial settings. Consideration and selection of financing vehicles that may be appropriate to securing organizations’ money requirements. S/U or letter grading.",
    "prerequisites": [
      "MGMT 230",
      "MGMT 430",
      "MGMT 403",
      "MGMT 408"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT231E"
  },
  {
    "course_code": "MGMT 232A",
    "units": 4,
    "title": "Investment Management",
    "description": "Lecture, three hours. Requisites: courses 230 (or 430), 408. Topics include application of portfolio theory to investment decisions, performance evaluation, and basics of portfolio management strategies. S/U or letter grading.",
    "prerequisites": [
      "MGMT 230",
      "MGMT 430",
      "MGMT 408"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT232A"
  },
  {
    "course_code": "MGMT 232B",
    "units": 4,
    "title": "Fixed-Income Markets",
    "description": "Lecture, three hours. Preparation: demonstrable training in statistics. Requisite: course 408. Introduction to fixed-income markets: institutional arrangements in primary and secondary markets; description and analysis of various types of fixed-income instruments; valuation; fixed-income portfolio management; use of derivative instruments and dynamic investment strategies; asset securitization. S/U or letter grading.",
    "prerequisites": [
      "MGMT 408"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT232B"
  },
  {
    "course_code": "MGMT 232D",
    "units": 4,
    "title": "Option Markets",
    "description": "Lecture, three hours. Requisite: course 408. Organization and role of organized derivative markets, including listed and OTC options and futures: arbitrage and hedging relationships, valuation of derivative trading strategies, and innovations in derivative markets. Students learn fundamentals of hedging and spreading by playing option trading game and writing term paper analyzing their strategies. S/U or letter grading.",
    "prerequisites": [
      "MGMT 408"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT232D"
  },
  {
    "course_code": "MGMT 232E",
    "units": 4,
    "title": "Market and Credit Risk Management",
    "description": "Lecture, three hours. Requisites: courses 408, 430. Discussion of regulatory environment for both market and credit risk management, data necessary to manage these risks, types of models used for risk management, types of securities and techniques for hedging market and credit risks, performance measurement of risk management systems, and other types of risks that affect risk management, such as operation risk, liquidity risk, commodity risk, weather risk, and model risk. Letter grading.",
    "prerequisites": [
      "MGMT 408",
      "MGMT 430"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT232E"
  },
  {
    "course_code": "MGMT 232F",
    "units": 4,
    "title": "Behavioral Finance",
    "description": "Lecture, three hours. Requisite: course 408. Introduction to and explanation of evidence of anomalous return behavior found in U.S. equities markets. Presentation of some paradigms of stock price movements that are rooted in studies from psychology and explanation of trading activity in equity risk-return paradigm. Introduction to some psychological biases that researchers suspect are inherent to investors. Employment of some results from psychology literature to explain irrationalities encountered in finance literature. Presentation of latest evidence on why individual investors trade and how individual and institutional investors form their portfolios. Letter grading.",
    "prerequisites": [
      "MGMT 408"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT232F"
  },
  {
    "course_code": "MGMT 234A",
    "units": 4,
    "title": "International Financial Markets",
    "description": "Lecture, three hours. Enforced requisite: course 408. Conceptual understanding of foreign exchange market, Eurocurrency market, international bond market, and equity markets in various countries. Emphasis on underlying economic principles, although where relevant, institutional features helpful in understanding structure and operations of markets to be dealt with in detail. S/U or letter grading.",
    "prerequisites": [
      "MGMT 408"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT234A"
  },
  {
    "course_code": "MGMT 235",
    "units": 4,
    "title": "Venture Capital and Private Equity",
    "description": "Lecture, three hours. Requisite: course 408. Use of cases to study entrepreneurial finance and venture capital. Analysis of issues faced by entrepreneurs who are setting up new firms, as well as decisions of private equity partnership managers and investors. How transactions are structured and why investors and entrepreneurs choose certain contractual arrangements. Development of understanding for institutional context of private equity finance. Time also devoted to leveraged buyouts. S/U or letter grading.",
    "prerequisites": [
      "MGMT 408"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT235"
  },
  {
    "course_code": "MGMT 238",
    "units": 4,
    "title": "Special Topics in Finance",
    "description": "Lecture, three hours. Requisites: courses 230 (or 430), 408. Selected topics in finance theory, empirical studies, and financial policy. May be repeated for credit with instructor change. S/U or letter grading.",
    "prerequisites": [
      "MGMT 230",
      "MGMT 430",
      "MGMT 408"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT238"
  },
  {
    "course_code": "MGMT 240E",
    "units": 4,
    "title": "Managing Entrepreneurial Operations",
    "description": "Lecture, three hours. Requisite: course 410. Designed for second-year graduate students. Exploration of operating issues involved in managing entrepreneurial enterprises. Integrative course, building on methodologies, principles, and concepts provided in requisite functional and strategic core courses. Use of extensive readings and case studies to develop skills and philosophical basis for applying managerial concepts to entrepreneurial operations. S/U or letter grading.",
    "prerequisites": [
      "MGMT 410"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT240E"
  },
  {
    "course_code": "MGMT 240F",
    "units": 4,
    "title": "Global Supply Chain Management",
    "description": "Lecture, three hours. Requisite: course 410. Business environment today is characterized by globalized operations, intense competition, rapid technological change, and short product life cycles. Consequently, firms can no longer afford to operate in isolation. In many industries competition has moved from firm level to supply chain level. Provides understanding of strategic, tactical, and operational issues in supply chain management, with generous attention to emerging digital economy. S/U or letter grading.",
    "prerequisites": [
      "MGMT 410"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT240F"
  },
  {
    "course_code": "MGMT 240G",
    "units": 4,
    "title": "Global Operations Strategy",
    "description": "Lecture, three hours. Requisite: course 410. Study of challenges of operating globally in range of industries, including software, consulting, automotive, and textile. Several opportunities for hands-on quantitative methods, with strategic perspective throughout. S/U or letter grading.",
    "prerequisites": [
      "MGMT 410"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT240G"
  },
  {
    "course_code": "MGMT 241A",
    "units": 4,
    "title": "Technology Management",
    "description": "Lecture, three hours. Requisites: courses 410, 411. Management of high-technology firm, including acquisition, creation, and utilization of technology and knowledge assets. Research and product development, product and process technologies, technology regimes, high-technology markets, competition, and technology strategies. Case examples from sectors such as computing, telecommunications, e-business, medical devices, nanotechnology, advanced transportation systems, and electronics. S/U or letter grading.",
    "prerequisites": [
      "MGMT 410",
      "MGMT 411"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT241A"
  },
  {
    "course_code": "MGMT 246A",
    "units": 4,
    "title": "Business and Environment",
    "description": "Lecture, three hours. Overview of many ways in which environmental issues interact with main functional areas of business: finance, marketing, strategy, operations, accounting. Basic introduction to background of environmental issues, with focus primarily on business aspects. Specific topics vary from year to year, but course details what every manager should know about environmental issues in business. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT246A"
  },
  {
    "course_code": "MGMT M247",
    "units": 2,
    "title": "Intellectual Property for Technology Entrepreneurs and Managers",
    "description": "(Same as Electrical and Computer Engineering M293.) Seminar, two hours; outside study, four hours. Introduction to intellectual property (IP) in context of technology products and markets. Topics include best practices to put in place before product development starts, how to develop high-value patent portfolios, patent licensing, offensive and defensive IP litigation considerations, trade secrets, opportunities and pitfalls of open source software, trademarks, managing copyright in increasingly complex content ecosystems, and adopting IP strategies to globalized marketplaces. Includes case studies inspired by complex IP questions facing technology companies today. S/U or letter grading.",
    "cross_listed": [
      "EC ENGR M293"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMTM247"
  },
  {
    "course_code": "MGMT 250D",
    "units": 4,
    "title": "Patterns of Problem Solving",
    "description": "Lecture, three hours. Acquisition of strategies that enhance adaptive planning and real-time judgment, based on findings from brain studies and cognitive research. Design of tools to respond to emergent uncertainties and to address situations where intense pressures of time and cost are present. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT250D"
  },
  {
    "course_code": "MGMT 252",
    "units": 4,
    "title": "Persuasion and Influence",
    "description": "Lecture, three hours. Enforced requisite: course 409. Designed for individuals interested in improving their ability to persuade and influence others. Consideration of number of well-studied persuasion and influence strategies that result in greater buy-in for one’s ideas, initiatives, proposals, products, and requests. Letter grading.",
    "prerequisites": [
      "MGMT 409"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT252"
  },
  {
    "course_code": "MGMT 254",
    "units": 4,
    "title": "Advanced Topics on Motivating People and the Future of Work",
    "description": "Lecture, three hours. Requisite: one course from Management-Executive MBA 409, Management-Full-Time MBA 401A, 401B, 409, Management-Fully Employed MBA 401, or 409. Introduction to a wide variety of modern incentive systems, both monetary and non-monetary, and cutting-edge technology and people analytics that help managers optimize the employee experience. Focus on the future of people management in organizations from hiring, to performance management, to talent development and promotion. Through combinations of case discussions, exercises, guest speakers, and lectures, students gain the skills they need to manage the workforce of the future. Letter grading.",
    "prerequisites": [
      "Executive MBA 409",
      "Time MBA 401A",
      "Time MBA 401B",
      "Time MBA 409",
      "Fully Employed MBA 401",
      "Fully Employed MBA 409"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT254"
  },
  {
    "course_code": "MGMT 256",
    "units": 4,
    "title": "Leadership and Ethics",
    "description": "Lecture, three hours. Series of real-life business situations that pose complex problems of leadership and ethics, so students develop better understanding of how they can successfully address business situations that define their leadership and ethical positions. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT256"
  },
  {
    "course_code": "MGMT 259",
    "units": 2,
    "title": "Performance Management",
    "description": "Lecture, three hours. Focus on providing tools and skills that allow students to excel in communicating their vision, inspiring and gaining commitment from stakeholders, and impressing interviewers and investors. Course materials are grounded in empirical research. Skills and techniques learned are broadly generalizable. Experiential exercises to enhance students’ abilities in oral and written communications. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT259"
  },
  {
    "course_code": "MGMT 260A",
    "units": 4,
    "title": "Customer Assessment and Analytics",
    "description": "Lecture, three hours. Enforced requisite: course 411. Decision-oriented course concerned with marketing research and data-driven marketing analytics. Detailed hands-on understanding of market research methodologies used in strategic assessment of customer perceptions and preferences. Extensive use of case studies. Letter grading.",
    "prerequisites": [
      "MGMT 411"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT260A"
  },
  {
    "course_code": "MGMT 260B",
    "units": 4,
    "title": "Marketing Strategy and Resource Allocation",
    "description": "Lecture, three hours. Requisite: Management-Full Time MBA 411 or Management-Fully Employed MBA 411. Provides conceptual frameworks and hones creative and analytical skills that are necessary to deal with uncertainty that embraces every marketing strategy. Focus on problem-solving integrating the marketing and business background obtained in core courses. Letter grading.",
    "prerequisites": [
      "Full Time MBA 411",
      "Fully Employed MBA 411"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT260B"
  },
  {
    "course_code": "MGMT 261A",
    "units": 4,
    "title": "Sales and Channel Management",
    "description": "Lecture, three hours. Requisite: course 411. Study of problems in management of sales and distribution channels. Issues of personal selling, account management, determining sales force size, organization, and compensation plans. Coverage of channel selection, conflict, power, and control. Extensive use of case studies. Letter grading.",
    "prerequisites": [
      "MGMT 411"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT261A"
  },
  {
    "course_code": "MGMT 261B",
    "units": 4,
    "title": "Global Marketing Management",
    "description": "Lecture, three hours. Requisite: course 411. Analysis of opportunities, distinctive characteristics, and emerging trends in foreign markets, including exploration of alternative methods and strategies for entering foreign markets; organizational planning and control; impact of social, cultural, economic, and political differences; and problems of adapting American marketing concepts and methods. Letter grading.",
    "prerequisites": [
      "MGMT 411"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT261B"
  },
  {
    "course_code": "MGMT 262",
    "units": 4,
    "title": "Price Policies",
    "description": "Lecture, three hours. Requisites: courses 405, 411. Consideration of environment of pricing decision—costs, customer, channels, competition, and regulation. Analysis of when and how to apply specific pricing strategies, including two-part tariffs, quantity discounts, product differentiation, bundling, and auctions. Letter grading.",
    "prerequisites": [
      "MGMT 405",
      "MGMT 411"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT262"
  },
  {
    "course_code": "MGMT 263A",
    "units": 4,
    "title": "Consumer Behavior",
    "description": "Lecture, three hours. Requisite: course 411. Study of nature and determinants of consumer behavior. Emphasis on influence of sociopsychological factors such as personality, small groups, demographic variables, social class, and culture on formation of consumers’ attitudes, consumption, and purchasing behavior. S/U or letter grading.",
    "prerequisites": [
      "MGMT 411"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT263A"
  },
  {
    "course_code": "MGMT 264A",
    "units": 4,
    "title": "Market Research",
    "description": "Lecture, three hours. Requisite: course 411. Designed for prospective users of research results rather than for specialists in research. Marketing research is aid to management decision making. Development of problem-analysis skills, providing knowledge of concepts and methods of marketing research, with increased sensitivity to limitations of marketing data. Letter grading.",
    "prerequisites": [
      "MGMT 411"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT264A"
  },
  {
    "course_code": "MGMT 264B",
    "units": 4,
    "title": "Data Analytics for Marketing and Finance",
    "description": "Lecture, three hours. Enforced requisite: course 402. How to fit predictive models and visualize multivariate data using examples and topics from marketing and finance. Topics include conditional prediction and predictive models, advanced treatment of regression, visualization and graphics, automating analysis for high dimensional data. Use of industry-leading R/Rstudio statistical environment. S/U or letter grading.",
    "prerequisites": [
      "MGMT 402"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT264B"
  },
  {
    "course_code": "MGMT 265",
    "units": 4,
    "title": "Brand Management",
    "description": "Lecture, three hours. Requisite: course 411. Introduction to considerations in development, implementation, and management of brands. Discussion of challenges to creating and maintaining strong brands. Topics include building brand knowledge and identities, marketing mix and brands, brand architectures, and brand equity. Letter grading.",
    "prerequisites": [
      "MGMT 411"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT265"
  },
  {
    "course_code": "MGMT 266A",
    "units": 4,
    "title": "New Product Development",
    "description": "Lecture, three hours. Requisite: course 411. Examination of new product development (NPD) process with objective of learning key tools and methods and applying them to case studies, exercises, and course project. Products viewed through three lenses: quantifiable rational attributes, appeal due to emotional characteristics, and cost/technology/competitive tradeoffs. NPD process also investigated through five key phases: ideation, concept generation and selection, detailed design, prototyping and testing, and ramp-up and product launch. Coverage of mass customization, parallel prototyping, cost reduction, and creativity. Letter grading.",
    "prerequisites": [
      "MGMT 411"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT266A"
  },
  {
    "course_code": "MGMT 266B",
    "units": 4,
    "title": "Advertising and Marketing Communications",
    "description": "Lecture, three hours. Requisite: course 411. Detailed study of decisions regarding media and forms of advertising and marketing communications to develop integrated strategies. Review of use and effectiveness of advertising and communication tools. Evaluation of advertising and promotional policies from development through implementation. Letter grading.",
    "prerequisites": [
      "MGMT 411"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT266B"
  },
  {
    "course_code": "MGMT 267",
    "units": 4,
    "title": "Digital Marketing Analytics",
    "description": "Lecture, three hours. Requisites: courses 402, 411. Use of notion of customer life cycle as organizing principle and application to digital marketing context. Frameworks and data-analytical tools for interacting with customers and learning about their preferences as they evolve through four stages of customer life cycle: (1) customer acquisition, (2) initial post-promotion purchasing, (3) mid-maturity purchase and transaction behavior, and (4) customer attrition or switchover to other product lines. S/U or letter grading.",
    "prerequisites": [
      "MGMT 402",
      "MGMT 411"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT267"
  },
  {
    "course_code": "MGMT 268",
    "units": 4,
    "title": "Selected Topics in Marketing",
    "description": "Lecture, three hours. Requisite: course 411. Study of selected areas of marketing knowledge and thought. Specific subjects vary each term depending on particular interests of instructor and students. Individual projects and reports. May be repeated for credit. S/U or letter grading.",
    "prerequisites": [
      "MGMT 411"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT268"
  },
  {
    "course_code": "MGMT 270C",
    "units": 4,
    "title": "Web Business",
    "description": "Lecture, three hours. Doing business on Web. Web infrastructure and ecology. Web business models and strategies. Web business development, operation, and marketing. New frontiers, such as Web services, social networking, and semantic Web. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT270C"
  },
  {
    "course_code": "MGMT M271A",
    "units": 4,
    "title": "Medtech Innovation I: Entrepreneurial Opportunities in Medical Technology",
    "description": "(Same as Bioengineering M233A.) Lecture, three hours; outside study, nine hours. Designed for graduate and professional students in engineering, dentistry, design, law, management, and medicine. Focus on understanding how to identify unmet clinical needs, properly filtering through these needs using various acceptance criteria, and selecting promising needs for which potential medtech solutions are explored. Students work in groups to expedite traditional research and development processes to invent and implement new medtech devices that increase quality of clinical care and result in improved patient outcomes in hospital system. Introduction to intellectual property basics and various medtech business models. Letter grading.",
    "cross_listed": [
      "BIOENGR M233A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMTM271A"
  },
  {
    "course_code": "MGMT M271B",
    "units": 4,
    "title": "Medtech Innovation II: Prototyping and New Venture Development",
    "description": "(Same as Bioengineering M233B.) Lecture, three hours; outside study, nine hours. Requisite: course M271A. Designed for graduate and professional students in engineering, dentistry, design, law, management, and medicine. Development of medtech solutions for unmet clinical needs previously identified in course M271A. Steps necessary to commercialize viable medtech solutions. Exploration of concept selection, business plan development, intellectual property filing, financing strategies, and device prototyping. Letter grading.",
    "prerequisites": [
      "MGMT M271A"
    ],
    "cross_listed": [
      "BIOENGR M233B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMTM271B"
  },
  {
    "course_code": "MGMT 272A",
    "units": 4,
    "title": "Information Systems Project Management",
    "description": "Lecture, three hours. Methods and tools for project management in information systems (IS) context. Initiating, planning, executing, controlling, reporting, and closing projects. Project integration, scope, time, cost, quality control, and risk management. Sourcing and external procurement. Contracting and managing partner relationships. Change management. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT272A"
  },
  {
    "course_code": "MGMT 273",
    "units": 2,
    "title": "Current Topics in Entertainment, Media, and Sports",
    "description": "Seminar, two hours. Designed for graduate students. Examination in depth of current issues in entertainment, media, and sports. Topics vary. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT273"
  },
  {
    "course_code": "MGMT 274A",
    "units": 4,
    "title": "Advanced Topics in Management Capstone",
    "description": "Seminar, three hours. Must be taken after completion of first year in program. Faculty-led supervised research project in an academic area of inquiry in management including identification of problems or strategic questions, design of study, collection and analysis of data, development and reporting of implementable recommendations. In Progress grading (credit to be given only on completion of course 274B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT274A"
  },
  {
    "course_code": "MGMT 274B",
    "units": 4,
    "title": "Advanced Topics in Management Capstone",
    "description": "Fieldwork, three hours. Enforced requisite: course 274A. Must be taken after completion of first year in program. Faculty-led supervised research project in an academic area of inquiry in management including, identification of problems or strategic questions, design of study, collection and analysis of data, development and reporting of implementable recommendations. Letter grading.",
    "prerequisites": [
      "MGMT 274A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT274B"
  },
  {
    "course_code": "MGMT 275",
    "units": 2,
    "title": "Current Topics in Emerging Technologies and Markets",
    "description": "Seminar, two hours. Designed for graduate students. Examination in depth of current emerging technologies and related market developments. Topics vary. May be repeated for credit. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT275"
  },
  {
    "course_code": "MGMT M277",
    "units": 1,
    "title": "Real Estate Finance Law",
    "description": "(Same as Law M209.) Lecture, three hours. Concentrated study of law governing financing of land transactions from both national and California perspectives. Topics include California deed of trust, installment land contracts and other mortgaging substitutes, assignments of rents, receiverships, prepayment, foreclosure, priorities, California antideficiency legislation, impact of borrower bankruptcy on mortgage lenders, construction lending, future advances lending, and secondary market. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMTM277"
  },
  {
    "course_code": "MGMT 277A",
    "units": 3,
    "title": "Real Estate Finance Law",
    "description": "Lecture, three hours. Course 277A is enforced requisite to 277B. Concentrated study of law governing financing of land transactions from both national and California perspectives. Topics include California deed of trust, installment land contracts and other mortgaging substitutes, assignments of rents, receiverships, prepayment, foreclosure, priorities, California antideficiency legislation, impact of borrower bankruptcy on mortgage lenders, construction lending, future advances lending, and secondary market. Concurrently scheduled with Law 209. In Progress grading (credit to be given only on completion of course 277B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT277A"
  },
  {
    "course_code": "MGMT 277B",
    "units": 1,
    "title": "Real Estate Finance Law",
    "description": "Lecture, three hours. Enforced requisite: course 277A. Continuation of course 277A. Concentrated study of law governing financing of land transactions from both national and California perspectives. Topics include California deed of trust, installment land contracts and other mortgaging substitutes, assignments of rents, receiverships, prepayment, foreclosure, priorities, California antideficiency legislation, impact of borrower bankruptcy on mortgage lenders, construction lending, future advances lending, and secondary market. Concurrently scheduled with Law 209. S/U or letter grading.",
    "prerequisites": [
      "MGMT 277A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT277B"
  },
  {
    "course_code": "MGMT 278A",
    "units": 4,
    "title": "Urban Real Estate Financing and Investing",
    "description": "Lecture, three hours. Requisites: courses 408, 430. Investor-oriented course in which real estate and business trends are evaluated to determine alternative real estate investment opportunities. Use of current financial, economic, and investment theories and techniques to real estate investment opportunities in case studies and short case problems to illustrate development of investment strategies. S/U or letter grading.",
    "prerequisites": [
      "MGMT 408",
      "MGMT 430"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT278A"
  },
  {
    "course_code": "MGMT 279A",
    "units": 4,
    "title": "Cases in Real Estate Investments",
    "description": "Lecture, three hours. Requisites: courses 408, 430. Development of understanding of principal issues involved with real estate investment and finance. Topics include real estate financial analysis and valuation in variety of contexts (single and multifamily residential, commercial/industrial, shopping center, and hotel properties), real estate taxation, real estate law, development process, securitization, REITs, and leasing and workout of troubled properties. S/U or letter grading.",
    "prerequisites": [
      "MGMT 408",
      "MGMT 430"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT279A"
  },
  {
    "course_code": "MGMT 279B",
    "units": 4,
    "title": "Entrepreneurial Real Estate Development",
    "description": "Lecture, three hours. Requisites: courses 278A (or 279A), 408, 430. Introduction to various aspects of real estate development from perspectives of entrepreneur and investor. Coverage of all types of developments, including single family, multifamily, hotel, office, retail, and industrial. Industry guest speakers to help reinforce principles taught. Real estate development simulation and group presentations to panel of investors included. S/U or letter grading.",
    "prerequisites": [
      "MGMT 278A",
      "MGMT 279A",
      "MGMT 408",
      "MGMT 430"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT279B"
  },
  {
    "course_code": "MGMT 279C",
    "units": 4,
    "title": "Real Estate Economics, Capital Markets, and Securitization",
    "description": "Lecture, three hours. Exploration of linkages between real estate, macroeconomy, and capital markets. New insights as to structure and practice of macroeconomic regulation, crisis policy formulation, and related capital markets and real estate outcomes. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT279C"
  },
  {
    "course_code": "MGMT 281B",
    "units": 4,
    "title": "People in Organizations",
    "description": "Designed for graduate students. Introduction to different philosophical perspectives for understanding human behavior. Theories and concepts important for understanding human behavior in organizations, as well as managerial implications of individual, group, and social behavior. Special attention to knowledge about satisfaction, motivation, and productivity in organizations.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT281B"
  },
  {
    "course_code": "MGMT 282",
    "units": 4,
    "title": "Optimizing Team Performance",
    "description": "Lecture, three hours. Enforced requisites: courses 409, 414A. Optimization of team performance by diagnosing complex team dynamics and taking appropriate action to improve team functioning to help students strengthen their teamwork skills in ways that are proven to increase effectiveness and performance of teams. Letter grading.",
    "prerequisites": [
      "MGMT 409",
      "MGMT 414A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT282"
  },
  {
    "course_code": "MGMT 284C",
    "units": 4,
    "title": "Managing Entrepreneurial Organizations",
    "description": "Lecture, three hours. Issues involved in developing and managing entrepreneurial organizations. Topics include organizational growth, managerial tools, strategic planning, organizational design, management development, control systems, leadership, and cultural management. Examination of transitions that individuals must make as organizations grow. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT284C"
  },
  {
    "course_code": "MGMT 285A",
    "units": 4,
    "title": "Leadership, Motivation, and Power",
    "description": "Discussion, three hours. Designed for graduate students. Theoretical and practical approaches to influencing and motivating people. Relative effectiveness of various leadership styles, different motivation theories, and power tactics from managerial point of view. Use of experience-based learning methods to aid diagnosis and understanding of one’s own influence styles. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT285A"
  },
  {
    "course_code": "MGMT 285B",
    "units": 4,
    "title": "Managerial Interpersonal Communication",
    "description": "Discussion, three hours. Designed for graduate students. Interpersonal and personality factors affecting managerial communications. Styles and modes of communication in one-to-one, group, and large-systems settings. Opportunities offered to deepen understanding of one’s own communication styles and skills, considering verbal, nonverbal perceptual, and cross-cultural aspects. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT285B"
  },
  {
    "course_code": "MGMT 286",
    "units": 4,
    "title": "Negotiations Behavior",
    "description": "Discussion, three hours. Presentation of theoretical principles and concepts from psychology, sociology, and economics through lectures and readings, with focus primarily on improving practical negotiating skills through experiential learning (i.e., negotiations simulations). Participants learn not only to enhance their individual abilities in dyadic and group situations, but also to analyze contexts for most effective application of these skills. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT286"
  },
  {
    "course_code": "MGMT 291",
    "units": 4,
    "title": "Strategies for Technology-Based Corporate Development",
    "description": "Lecture, three hours. Enforced requisite: course 420. Focus on key aspects of corporate business development transactions, including strategic deal selection, mergers and acquisitions deal integration, deal structure (including accounting and tax issues), and economic analysis of transactions. Examination of technology and digital media markets. Letter grading.",
    "prerequisites": [
      "MGMT 420"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT291"
  },
  {
    "course_code": "MGMT M292B",
    "units": 4,
    "title": "Growth, Science, and Technology",
    "description": "(Same as Public Policy M280B.) Lecture, three hours. Economic growth and change. Role of advances in science and technology, and actions of maximizing innovators and factors impinging on their behavior. How technological breakthroughs (or discontinuities) can form new industries or transform nature of and population of firms in existing industries. S/U or letter grading.",
    "cross_listed": [
      "PUB PLC M280B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMTM292B"
  },
  {
    "course_code": "MGMT M293A",
    "units": 4,
    "title": "Political Environment of American Business",
    "description": "(Same as Public Policy M281.) Lecture, three hours. Evaluation of certain criticisms made by business of American political system. Designed to provide clearer understanding of principal features of American politics, especially as they influence business enterprise. S/U or letter grading.",
    "cross_listed": [
      "PUB PLC M281"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMTM293A"
  },
  {
    "course_code": "MGMT 293C",
    "units": 4,
    "title": "Ethical Considerations in Business",
    "description": "Lecture, three hours. Examination of a range of ethical considerations in business decisions involving the individual, corporation, society, and international business. Analysis of cases for classroom presentation and discussion.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT293C"
  },
  {
    "course_code": "MGMT 294",
    "units": 2,
    "title": "Law and Economics Workshop",
    "description": "Seminar, two hours. Requisite: course 405 or Economics 201A. Knowledge of empirical methods and basic calculus required. Interdisciplinary speaker series bringing together outside speakers with scholars and students from UCLA Law School and academic departments. Topics include contracts, torts, intellectual property, and business law. Students write graded reaction papers. May be repeated for credit. Concurrently scheduled with Economics 206 and Law 648. S/U or letter grading.",
    "prerequisites": [
      "MGMT 405",
      "ECON 201A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT294"
  },
  {
    "course_code": "MGMT 295A",
    "units": 4,
    "title": "Entrepreneurship and Venture Initiation",
    "description": "Exploration in entrepreneurship particularly concerned with formation and operation of new business ventures. Significant and crucial aspects of exploring new business opportunities and starting a business.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT295A"
  },
  {
    "course_code": "MGMT 295B",
    "units": 4,
    "title": "Family Business",
    "description": "Lecture, three hours. Overview of family business, including what is required for family harmony and business continuity. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT295B"
  },
  {
    "course_code": "MGMT 295C",
    "units": 4,
    "title": "Corporate Entrepreneurship",
    "description": "Inquiry into nature of entrepreneurship and effective implementation of entrepreneurial strategies in large industrial enterprises. Emphasis primarily on managerial effects aimed at identification, development, and exploitation of technical and organizational innovations, management of new product or process developments, and effective new venture management in a corporate context.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT295C"
  },
  {
    "course_code": "MGMT 295D",
    "units": 4,
    "title": "Business Plan Development",
    "description": "Lecture, three hours. Enforced requisite: course 295A. Fundamentals of developing effective written business plans. Basic principles of developing plans for sales, marketing, product or service, operations, financials, and management and staffing functions of new startup businesses. S/U or letter grading.",
    "prerequisites": [
      "MGMT 295A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT295D"
  },
  {
    "course_code": "MGMT 295F",
    "units": 4,
    "title": "Social Entrepreneurship",
    "description": "Lecture, three hours. Exposes future change leaders to different business models for social impact and to fundamental opportunities and challenges of designing, funding, managing, and scaling enterprises with social mission. Through lectures, readings, case studies, speakers and research project, exploration of competitive advantages and limitations of different approaches to creating social impact across sectors—private/for profit, public, and nonprofit. Introduction of frameworks for understanding and analyzing problems facing society and cultivation of critical thinking skills to identify diverse ways to address those problems through sustainable programs and enterprises. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT295F"
  },
  {
    "course_code": "MGMT 296",
    "units": 4,
    "title": "Social Impact Consulting",
    "description": "Lecture, three hours. Builds skills and competencies of students interested in field of social impact consulting. Through lectures, readings, videos, speakers, and consulting project with social impact organization, students learn and then apply key consulting skills—both consulting-focused, such as project scoping and client management, and nonprofit-focused, such as governance and strategy, impact measurement, and sources of funding. Readings and discussion expose students to best practices of high-performing nonprofits as well as how diversity, equity, and inclusion can create competitive advantage and increase impact of social impact organizations. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT296"
  },
  {
    "course_code": "MGMT 296A",
    "units": 4,
    "title": "International Business Management",
    "description": "Discussion, three hours. Identification, analysis, and resolution of managerial issues of policy and action within context of a multinational corporation, with emphasis on problems of adaptation to different sociological, cultural, legal, political, and economic environmental characteristics on planning, structuring of organizational relationships, and coordination and control in multinational firms. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT296A"
  },
  {
    "course_code": "MGMT 297B",
    "units": 4,
    "title": "International Business Strategy",
    "description": "Discussion, three hours. Analysis of key strategic problems encountered by multinational corporations entering foreign markets. Application of concepts and theories acquired in other courses to series of complex cases on international business or by use of a complex simulation of competition in global markets. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT297B"
  },
  {
    "course_code": "MGMT 297C",
    "units": 4,
    "title": "International Business Law",
    "description": "Prerequisites: courses 205A, 296A. Legal environments in which international business operates; overseas business relationships and organizations; antitrust, taxation, transfer of capital, and technology regulations; patent, trademark, and copyright safeguards; arbitration of international business disputes; expropriation of foreign investments; international business and government relations.",
    "prerequisites": [
      "MGMT 205A",
      "MGMT 296A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT297C"
  },
  {
    "course_code": "MGMT 297D",
    "units": 4,
    "title": "International Business Negotiations",
    "description": "Prerequisite: course 296A. Exploration of international business negotiations of multinational enterprises with governmental agencies and foreign-based firms on a wide range of issues, such as establishment/dissolution of joint ventures, extent of foreign ownership/management control, terms/conditions for technology transfer, investment incentives.",
    "prerequisites": [
      "MGMT 296A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT297D"
  },
  {
    "course_code": "MGMT 297E",
    "units": 4,
    "title": "Business and Economics in Emerging Markets",
    "description": "Lecture, three hours. Requisite: course 205A or 405. Analysis of changing economic, political, demographic, and sociocultural conditions in developing countries as they affect the business environment. Process of economic growth, market-oriented reforms, and creation of domestic capital markets. Inflation and stabilization programs, identification of business risks and opportunities, as well as tools needed to manage firms under these conditions. S/U or letter grading.",
    "prerequisites": [
      "MGMT 205A",
      "MGMT 405"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT297E"
  },
  {
    "course_code": "MGMT 298D",
    "units": 4,
    "title": "Special Topics in Management",
    "description": "Lecture, three hours. Designed for graduate students. In-depth examination of problems or issues of current concern in management, with numerous topics offered each year. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT298D"
  },
  {
    "course_code": "MGMT 298E",
    "units": 2,
    "title": "Special Topics in Management",
    "description": "Lecture, 90 minutes. Designed for graduate students. In-depth examination of problems or issues of current concern in management, with numerous topics offered each year. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT298E"
  },
  {
    "course_code": "MGMT 298F",
    "units": 1,
    "title": "Special Topics in Management",
    "description": "Lecture, one hour. Designed for graduate students. In-depth examination of problems or issues of current concern in management, with numerous topics offered each year. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT298F"
  },
  {
    "course_code": "MGMT 298G",
    "units": 4,
    "title": "Special Topics in Management",
    "description": "Lecture, three hours. Designed for graduate students. In-depth examination of problems or issues of current concern in management, with numerous topics offered each year. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT298G"
  },
  {
    "course_code": "MGMT 298H",
    "units": 2,
    "title": "Special Topics in Management",
    "description": "Lecture, 90 minutes. Designed for graduate students. In-depth examination of problems or issues of current concern in management, with numerous topics offered each year. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT298H"
  },
  {
    "course_code": "MGMT 298I",
    "units": 1,
    "title": "Special Topics in Management",
    "description": "Lecture, one hour. Designed for graduate students. In-depth examination of problems or issues of current concern in management, with numerous topics offered each year. May be repeated for credit. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT298I"
  },
  {
    "course_code": "MGMT 406",
    "units": 4,
    "title": "Global Macroeconomy",
    "description": "Lecture, three hours. Requisites: courses 402, 403, 405. Provides analytical framework required for understanding way changing macroeconomic conditions in world economy affect economic growth, inflation, interest rates behavior, exchange rate determination, global competitiveness, unemployment, and trade account. Provides skills to enable students to assess critically how developments in world economy affect particular industry environments. Letter grading.",
    "prerequisites": [
      "MGMT 402",
      "MGMT 403",
      "MGMT 405"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT406"
  },
  {
    "course_code": "MGMT 407",
    "units": 4,
    "title": "Business Analytics with Spreadsheets",
    "description": "Lecture, three hours. Requisite: course 402. Introduction to uses of analytical methods for making strategic, tactical, and operational decisions arising from accounting, finance, marketing, and production, with focus on three key areas in problem solving: formal problem definition, spreadsheet model formulation, alternatives evaluation. Letter grading.",
    "prerequisites": [
      "MGMT 402"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT407"
  },
  {
    "course_code": "MGMT 422",
    "units": 4,
    "title": "Analysis and Communications",
    "description": "Discussion, three hours. Prerequisite: graduate standing. Study and practice of oral and written management communications, including audience analysis, persuasion, revising and editing, presentation of technical information, and uses of computer technology. Organized around writing and speaking exercises. Personal attention to students’ written communications and oral presentations.",
    "prerequisites": [],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT422"
  },
  {
    "course_code": "MGMT 424",
    "units": 2,
    "title": "Strategic Business Presenting",
    "description": "Lecture, 90 minutes. Improvement of strategic business presenting skills such as presentation delivery techniques, visual and verbal persuasion principles, building arguments with supporting evidence, art of business storytelling, and other related topics, with focus on individual student presentations. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT424"
  },
  {
    "course_code": "MGMT 425",
    "units": 4,
    "title": "Leadership Communication",
    "description": "Lecture, three hours. Study centers on communicative dimensions of leadership, executive presence, and persuasion. Frameworks allow for emerging and current leaders to excel in presenting sticky messages to investors, executives, boards, clients, and others. Hands-on nature of course allows for considerable communication practice. Student presentations are videotaped and analyzed. Topics include communicating with executive presence, strategic networking, designing compelling visuals, engaging with data, making complex (and technical) information understandable, overcoming message resistance, and creating clear and concise messages. Also covered are question and answer methods, leadership storytelling, and ways to grab and keep attention. Examination of delivery variables such as verbal and non-verbal communication. Message topics can be generated from student needs (e.g., venture capital investors pitch, senior executives or client presentation). S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT425"
  },
  {
    "course_code": "MGMT 430",
    "units": 4,
    "title": "Corporate Finance",
    "description": "Lecture, three hours. Requisite: course 408. Consideration of broad range of issues faced by corporate financial managers. Analysis of firm’s investment and financing decisions. Impact on firm of agency costs and asymmetric information. Study of mergers and acquisitions through use of empirical studies. Security design also covered. Letter grading.",
    "prerequisites": [
      "MGMT 408"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT430"
  },
  {
    "course_code": "MGMT 455E",
    "units": 2,
    "title": "International Exchange Program",
    "description": "Lecture, 30 hours; discussion, 10 hours. Students attend up to four MBA-level courses at institutions with exchange agreements with Anderson School. Some courses may be taught in local language. In addition to learning subject matter of courses, provides opportunity for students to enhance their knowledge of region while exchanging ideas and views with their peers at that institution. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT455E"
  },
  {
    "course_code": "MGMT 457A",
    "units": 2,
    "title": "Fieldwork in Investment Management",
    "description": "Seminar, two hours; fieldwork, one hour. Four-term course. Introduction to academic theories of portfolio management and management structure. Review of literature to identify investment strategies. Knowledge transfer and training before outgoing and incoming class leadership transition. In Progress grading (credit to be given only on completion of courses 457B, 457C, and 457D).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT457A"
  },
  {
    "course_code": "MGMT 457B",
    "units": 2,
    "title": "Fieldwork in Investment Management",
    "description": "Seminar, two hours; fieldwork, one hour. Four-term course. Faculty-guided portfolio-management implementation. Back testing of investment strategy. Visits to portfolio management firms to gain expert guidance. In Progress grading (credit to be given only on completion of courses 457C and 457D).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT457B"
  },
  {
    "course_code": "MGMT 457C",
    "units": 2,
    "title": "Fieldwork in Investment Management",
    "description": "Seminar, two hours; fieldwork, one hour. Four-term course. Monitoring of implemented strategy. Documentation and analysis of portfolio performance. Development of new strategy for incoming class. In Progress grading (credit to be given only on completion of course 457D).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT457C"
  },
  {
    "course_code": "MGMT 457D",
    "units": 2,
    "title": "Fieldwork in Investment Management",
    "description": "Seminar, two hours; activity, one hour. Four-term course. Culmination and transition of portfolio management project. Formal presentation of new strategy to incoming class and delivery of annual report. Training of incoming class with knowledge transfer and dissemination of tools for back testing. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT457D"
  },
  {
    "course_code": "MGMT 458A",
    "units": 2,
    "title": "Global Immersion: Two-Quarter Plan",
    "description": "Lecture, three hours; presentations, site visits, and discussion, 20 hours. Course 458A is enforced requisite to 458B. Taught in English. Designed for MBA, EMBA, FEMBA, and GEMBA students. Four on-campus academic sessions and one intensive week in another country for blend of lectures, guest speakers, panel discussions, and company site visits, with focus on doing business in other countries. Exposure to economy, legal and political environment, major industries and businesses, local culture, key historical events, and many aspects of conducting business outside U.S. Taught by school faculty members in conjunction with lectures by faculty members from top institutional partners, as well as local and regional government officials and ministers, local business executives, and influential leaders from country of focus. May be repeated for credit based on program requirements. In Progress grading (credit to be given only on completion of course 458B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT458A"
  },
  {
    "course_code": "MGMT 458B",
    "units": 2,
    "title": "Global Immersion: Two-Quarter Plan",
    "description": "Fieldwork, three hours; presentations, site visits, and discussion, 20 hours. Enforced requisite: course 458A. Taught in English. Designed for MBA, EMBA, FEMBA, and GEMBA students. Four on-campus academic sessions and one intensive week in another country for blend of lectures, guest speakers, panel discussions, and company site visits, with focus on doing business in other countries. Exposure to economy, legal and political environment, major industries and businesses, local culture, key historical events, and many aspects of conducting business outside U.S. Taught by school faculty members in conjunction with lectures by faculty members from top institutional partners, as well as local and regional government officials and ministers, local business executives, and influential leaders from country of focus. May be repeated for credit based on program requirements. Letter grading.",
    "prerequisites": [
      "MGMT 458A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT458B"
  },
  {
    "course_code": "MGMT 459E",
    "units": 4,
    "title": "International Exchange",
    "description": "Lectures/discussion, 30 hours (one week). Preparation: completion of first-year core courses. Open to EMBA and FEMBA students. Taught in English. Intensive one-week study at international partner university. Taught by faculty members from partner institution in destination country. Topics vary but are tailored to MBA curriculum. May be repeated once for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT459E"
  },
  {
    "course_code": "MGMT 460A",
    "units": 2,
    "title": "Managing Finance and Financing Emerging Enterprises",
    "description": "Lecture, three hours. Course 460A is enforced requisite to 460B. Designed for second-year graduate students. Emphasis on financial, control, and investment issues confronting rapidly growing companies in entrepreneurial settings. Consideration and selection of financing vehicles that may be appropriate to securing money requirements of organizations. In Progress grading (credit to be given only on completion of course 460B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT460A"
  },
  {
    "course_code": "MGMT 460B",
    "units": 2,
    "title": "Managing Finance and Financing Emerging Enterprises",
    "description": "Lecture, three hours. Enforced requisite: course 460A. Designed for second-year graduate students. Emphasis on financial, control, and investment issues confronting rapidly growing companies in entrepreneurial settings. Consideration and selection of financing vehicles that may be appropriate to securing money requirements of organizations. Letter grading.",
    "prerequisites": [
      "MGMT 460A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT460B"
  },
  {
    "course_code": "MGMT 466B",
    "units": 4,
    "title": "Advanced Financial Policy for Managers",
    "description": "Lecture, four hours. Limited to Executive MBA Program students. Modern financial management deals with decision making under uncertainty for corporate financial management, portfolio investment decisions, financial institutions, and international financial management. Focus on learning sound theoretical tools and applying them in casework. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT466B"
  },
  {
    "course_code": "MGMT 468",
    "units": 4,
    "title": "Macroeconomics and Economic Forecasting",
    "description": "Lecture, four hours. Limited to Executive MBA Program students. Macroeconomic theory and its application to business forecasting. Major economic indicators and their historical description of the U.S. economy; theoretical tools that business economists use to analyze impacts of monetary and fiscal policy; macroeconometric techniques applicable to business decisions. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT468"
  },
  {
    "course_code": "MGMT 472B",
    "units": 4,
    "title": "Customer Information Strategy",
    "description": "Lecture, four hours. Limited to Executive MBA Program students. Exploration of innovation and marketing of products and services to customers. Use of creativity tools, customer research, and marketing science to create value and allocate resources so as to maximize revenues and profits that result. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT472B"
  },
  {
    "course_code": "MGMT 479E",
    "units": 2,
    "title": "International Exchange: Executive MBA Program",
    "description": "Lecture, three hours; discussion and site visits, 20 hours. Preparation: completion of first-year core courses in Executive MBA Program. Intensive one-week program in one foreign country, with courses taught by faculty members from partner institutions in destination country. Topics vary but are tailored to MBA curriculum, including but not limited to finance, marketing, global economics, strategy, human resources, operations, and technology management. Exposure to local business practices, company site visits, and exploration of local cultural and historical sites. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT479E"
  },
  {
    "course_code": "MGMT 481A",
    "units": 2,
    "title": "Negotiations Behavior",
    "description": "Lecture, three hours. Course 481A is enforced requisite to 481B. Limited to Global Executive MBA students. Presentation of theoretical principles and concepts from psychology, sociology, and economics through lectures and readings, with focus primarily on improving practical negotiating skills through experiential learning (i.e., negotiations simulations). Participants learn to enhance their individual abilities in dyadic and group situations and to analyze contexts for most effective application of these skills. In Progress grading (credit to be given only on completion of course 481B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT481A"
  },
  {
    "course_code": "MGMT 481B",
    "units": 2,
    "title": "Negotiations Behavior",
    "description": "Lecture, three hours. Enforced requisite: course 481A. Limited to Global Executive MBA students. Presentation of theoretical principles and concepts from psychology, sociology, and economics through lectures and readings, with focus primarily on improving practical negotiating skills through experiential learning (i.e., negotiations simulations). Participants learn to enhance their individual abilities in dyadic and group situations and to analyze contexts for most effective application of these skills. Letter grading.",
    "prerequisites": [
      "MGMT 481A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT481B"
  },
  {
    "course_code": "MGMT 484A",
    "units": 2,
    "title": "Management of Technology and Innovation",
    "description": "Lecture, three hours. Course 484A is enforced requisite to 484B. Limited to Global Executive MBA students. Problems of managing technological innovation in Asia. Topics include incorporation of technological consideration into strategy, adoption of technological innovation, promoting innovation through organizational design and leadership, e-business, and m-business. In Progress grading (credit to be given only on completion of course 484B).",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT484A"
  },
  {
    "course_code": "MGMT 484B",
    "units": 2,
    "title": "Management of Technology and Innovation",
    "description": "Lecture, three hours. Enforced requisite: course 484A. Limited to Global Executive MBA students. Problems of managing technological innovation in Asia. Topics include incorporation of technological consideration into strategy, adoption of technological innovation, promoting innovation through organizational design and leadership, e-business, and m-business. Letter grading.",
    "prerequisites": [
      "MGMT 484A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT484B"
  },
  {
    "course_code": "MGMT 485",
    "units": 4,
    "title": "Corporate Entrepreneurship",
    "description": "Lecture, three hours. Managerial efforts aimed at identification, development, and exploitation of technical and organizational innovations, management of new product or process developments, and effective new venture management in context of large corporations in manufacturing and service industries. Development of awareness and understanding of range, scope, and complexity of issues related to creation of organizational environment that is supportive of entrepreneurial endeavors, and insight concerning effective implementation of technological and organizational innovations in corporate setting. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT485"
  },
  {
    "course_code": "MGMT 488",
    "units": 4,
    "title": "Business Plan Development",
    "description": "Lecture, four hours. Enforced requisites: courses 487A, 487B. Limited to Executive MBA Program students. How to develop business plans, understanding of analytical processes required to produce plans, improvement of student writing and oral presentation skills, and review of business plans of other entities. Writing of one complete business plan and presentation of it to experienced investors. Letter grading.",
    "prerequisites": [
      "MGMT 487A",
      "MGMT 487B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT488"
  },
  {
    "course_code": "MGMT 489",
    "units": 4,
    "title": "Entrepreneurship and Venture Initiation",
    "description": "Lecture, 90 minutes. Limited to Executive MBA Program students. Introduction to basic tools and jargon required for entrepreneurship that requires financing or management of intellectual property. Terminology used by lawyers, accountants, venture capitalists, and other investors when forming and financing new companies. Assessment of feasibility of business concept and communication of concept to potential investors, employees, and business partners. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT489"
  },
  {
    "course_code": "MGMT 495",
    "units": 2,
    "title": "Teaching Assistant Training Seminar",
    "description": "Seminar, 90 minutes. Required to serve as teaching assistant, associate, or fellow in Anderson-based course. Introduction to universal teaching and learning issues, core pedagogical principles and practices, and strategies for promoting and assessing student learning outcomes. Designed to prepare students for graduate-level teaching and provide professional development. Discussion of practical and theoretical issues about teaching in a graduate business school. Emphasis on adult learning theory and pedagogy, theory versus practice in business, and electronic data interchange (EDI) initiatives within business school academic settings. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT495"
  },
  {
    "course_code": "MGMT 501",
    "units": 2,
    "title": "Cooperative Program",
    "description": "Preparation: consent of UCLA AGSM graduate adviser and assistant dean, and host campus instructor, department chair, and graduate dean. Used to record enrollment of UCLA students in courses taken under cooperative arrangements with USC. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT501"
  },
  {
    "course_code": "MGMT 596",
    "units": 1,
    "title": "Research in Management",
    "description": "Directed individual study or research. May be repeated. S/U or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT596"
  },
  {
    "course_code": "MGMT 597",
    "units": 4,
    "title": "Preparation for Qualifying Examinations",
    "description": "Preparation for master’s comprehensive examination or PhD qualifying examinations. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT597"
  },
  {
    "course_code": "MGMT 598",
    "units": 4,
    "title": "Thesis Research in Management",
    "description": "Research for and preparation of master’s thesis. May be repeated. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT598"
  },
  {
    "course_code": "MGMT 599",
    "units": 4,
    "title": "PhD Dissertation Research in Management",
    "description": "Research for and preparation of PhD dissertation. S/U grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MGMT599"
  }
]