[
  {
    "course_code": "ARCHEOL 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHEOL19"
  },
  {
    "course_code": "ARCHEOL 30",
    "units": 4,
    "title": "Science in Archaeology",
    "description": "Lecture, three hours; discussion, one hour. Archaeology is rapidly developing due to ongoing introduction of new hardware, software, and information dissemination technology. It is multidisciplinary field of study, combining its own research methods and technologies with elements from geology, history, ethnography, geography, material science, statistics, biology, biochemistry, medicine, and others, presenting opportunities not only to obtain new scholarly insights, but also to provide integrated instruction in science, technology, engineering, and mathematics (STEM) skills. Use of archaeological data as paradigm in STEM education. Instant practical application of mathematics during surveying, geology during ceramic analysis or geophysical research, biochemistry during archaeological residue analysis, or biology during zooarchaeological or paleoethnobotanical research offers point of departure for instructors as well as motivation to students. P/NP or letter grading.",
    "satisfies": [
      "General Education - Life Sciences without Lab Credit (Scientific Inquiry)",
      "General Education - Physical Sciences without Lab Credit (Scientific Inquiry)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHEOL30"
  },
  {
    "course_code": "ARCHEOL 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHEOL89"
  },
  {
    "course_code": "ARCHEOL 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHEOL89HC"
  },
  {
    "course_code": "ARCHEOL 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHEOL99"
  },
  {
    "course_code": "ARCHEOL C110",
    "units": 4,
    "title": "Archaeological Materials Identification and Characterization",
    "description": "Lecture, one hour; laboratory, two hours. Laboratory-oriented introduction for archaeologists to identification and quantitative description of solid materials, especially metals, ceramics, and other inorganic and some organic substances. Concurrently scheduled with course C210. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHEOLC110"
  },
  {
    "course_code": "ARCHEOL M112",
    "units": 4,
    "title": "Archaeology and Art of Christian and Islamic Egypt",
    "description": "(Same as Art History M119D, Islamic Studies M112, and Middle Eastern Studies M112.) Lecture, three hours. Culture of Egypt transformed gradually after Muslim conquest in mid-7th century CE. According to material evidence such as ceramics, textiles, architectural forms, and building techniques, it is functionally impossible to separate pre-Islamic Christian Egypt from early Islamic Egypt. Although population may have become largely Muslim by 10th century, Egypt remained Coptic in many senses even to 14th century and retains sizeable Christian minority to present. Survey of archaeological remains and standing architecture of Egypt from 6th to 19th century, charting changes and continuities in material culture and shifts in human geography and land use. P/NP or letter grading.",
    "cross_listed": [
      "ISLM ST M112",
      "M E STD M112",
      "ART HIS M119D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHEOLM112"
  },
  {
    "course_code": "ARCHEOL C120",
    "units": 2,
    "title": "Special Topics in Archaeology",
    "description": "Lecture, three hours. Designed for juniors/seniors. Special topics on theoretical subjects in archaeology such as new strategies, regional synthesis, or current work by core program faculty or special visiting scholars. May be repeated for credit with topic change. Concurrently scheduled with course C220. Final project or paper required if taken for 4 units (P/NP or letter grading); 2-unit course has P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHEOLC120"
  },
  {
    "course_code": "ARCHEOL C159",
    "units": 2,
    "title": "Fieldwork in Archaeology",
    "description": "Fieldwork, to be arranged. Participation in archaeological field excavations or museum research under supervision of staff archaeologists at UCLA. Minimum of one month of field time away from campus required. May be repeated for credit with consent of adviser. Concurrently scheduled with course C259. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHEOLC159"
  },
  {
    "course_code": "ARCHEOL M164",
    "units": 4,
    "title": "Archaeology of Levant",
    "description": "(Same as Ancient Near East M164, Art History M111E, and Middle Eastern Studies M164.) Lecture, three hours. Survey of archaeology of Levant from late fifth millennium through arrival of Alexander the Great (circa 4500-332 BC). Examination of social, economic, political, and cultural developments through archaeological finds from geographic region bounded by Anatolia and Mesopotamia on north, Egypt to south, and Arabian Peninsula to east. Archaeological methods, theory, and practice are addressed; and geographic, environmental, climatological, and textual data are employed to establish broader context for Levantine traditions. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M164",
      "M E STD M164",
      "ART HIS M111E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHEOLM164"
  },
  {
    "course_code": "ARCHEOL C180",
    "units": 6,
    "title": "Ancient and Historic Metals: Corrosion, Technology, and Microstructure",
    "description": "Seminar, four hours; laboratory, four hours. Overview of technology of ancient metals, aspects of extraction and alloying, corrosion that ancient metals undergo, and how this impacts their preservation. Exploration of knowledge and research work of last two decades that has substantially advanced understanding of processes of extraction, alloying, surface patination, metallic coatings, corrosion, and microstructure. Laboratory work in preparation and examination of metallic samples under microscope, as well as lectures on technology of metallic works of art. Discussion of phase and stability diagrams of common alloying systems and environments. Metallographic study samples represent Bronze Age Europe, Renaissance Europe, China from Warring States to Tang dynasty, Japanese swordmaking, Indian high-tin bronze alloys, bronzes, Peruvian, Colombian, Costa Rican, and Panamanian copper and gold-copper alloys. Concurrently scheduled with course C280. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHEOLC180"
  },
  {
    "course_code": "ARCHEOL 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHEOL189"
  },
  {
    "course_code": "ARCHEOL 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHEOL189HC"
  }
]