[
  {
    "course_code": "ARCH&UD 1",
    "units": 2,
    "title": "Introduction to Design",
    "description": "Studio/lecture/field trips, 40 hours. Limited to high school students. Two- or three-week intensive summer course in architectural design, with focus on developing design skills through space making and its representation. Exposure to contemporary architectural practices through studio work, lectures and presentations, field trips, and final demonstration, critique, and exhibition of student work. Offered only as part of Teen Arch Studio summer program. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD1"
  },
  {
    "course_code": "ARCH&UD 10A",
    "units": 5,
    "title": "Histories of Architecture and Urbanism I",
    "description": "Lecture, three hours; discussion, one hour; outside study, 11 hours. Exploration of developments in global architecture and urban design from prehistory to 1600 and critical reflection on terms such as building, architecture, city, history, and culture. Focus on world context, construction and technology, and history of architectural ideas. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD10A"
  },
  {
    "course_code": "ARCH&UD 10B",
    "units": 5,
    "title": "Histories of Architecture and Urbanism II",
    "description": "Lecture, three hours; discussion, one hour; outside study, 11 hours. Survey of architectural and urban history from 1600 to present in global context. Exploration of buildings, cities, spaces, artifacts, landscapes, and ideas through their relation to geopolitical conditions and through their relation to theories of design. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD10B"
  },
  {
    "course_code": "ARCH&UD 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD19"
  },
  {
    "course_code": "ARCH&UD 30",
    "units": 5,
    "title": "Introduction to Architectural Studies",
    "description": "Lecture, three hours; discussion, one hour; outside study, 11 hours. Exploration of role of built environment in social, cultural, and political life: how buildings are constructed, what they mean, effects they have on world, and ways they imagine new futures and shape private and public life. Focus on series of contemporary case studies for what each reveals about new possibilities for shaping world in which we live, with emphasis on how architecture extends to cities, roads, books, and films. Consideration of historical context and cultural genealogy of particular buildings and environments, material and economic conditions of building, and more. P/NP or letter grading.",
    "satisfies": [
      "General Education - Visual & Performance Arts Analysis & Practice (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD30"
  },
  {
    "course_code": "ARCH&UD 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD89"
  },
  {
    "course_code": "ARCH&UD 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD99"
  },
  {
    "course_code": "ARCH&UD 102",
    "units": 2,
    "title": "Introduction to Representation",
    "description": "Studio, four hours; outside study, two hours. Limited to currently enrolled college/university students and graduates of colleges/universities. Introduction to techniques of spatial representation as they relate to architectural design. How to communicate using two- and three-dimensional drawing and modeling. Analog and digital techniques and opportunity afforded by moving between both. Analog techniques include orthographic and axonometric projection. Digital techniques focus on computer graphics fundamentals, including bit map and vector graphic imaging using Adobe suite and modeling using Rhinoceros. Offered in summer only. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD102"
  },
  {
    "course_code": "ARCH&UD 103",
    "units": 6,
    "title": "Introduction to Architectural Design",
    "description": "Studio, 18 hours. Limited to currently enrolled college/university students and graduates of colleges/universities. Introduction to basic architectural design principles and problem solving. How to control point, line, surface, and volume to shape spaces for human use. Visual analysis as tool for discussing and understanding organization. Techniques of repetition, variation, order, scale, and rhythm. Use of case-study analysis to uncover disciplinary issues within design problems and production of individual solutions to problems. Offered in summer only. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD103"
  },
  {
    "course_code": "ARCH&UD 121",
    "units": 6,
    "title": "Studio I",
    "description": "Studio, eight hours; outside study, 10 hours. Limited to Architectural Studies majors. Introduction to basic architectural design principles and problem solving: how to control point, line, surface, and volume to shape spaces for human use. Visual analysis as tool for discussing and understanding organization. Techniques of repetition, variation, order, scale, and rhythm. Use of case-study analysis to uncover disciplinary issues within design problems, as well as to produce individual solutions to those problems. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD121"
  },
  {
    "course_code": "ARCH&UD 122",
    "units": 6,
    "title": "Studio II",
    "description": "Studio, eight hours; outside study, 10 hours. Enforced requisite: course 121. Limited to Architectural Studies majors. Issues of inhabitation, domesticity, and program. Architectural precedents and principles of spatial organization. Relationship of architectural form to human body and role of architectural space in choreography of human activity. Understanding and application of knowledge of architectural tectonics, structure, and measurement. Letter grading.",
    "prerequisites": [
      "ARCH&UD 121"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD122"
  },
  {
    "course_code": "ARCH&UD 123",
    "units": 6,
    "title": "Studio III",
    "description": "Studio, eight hours; outside study, 10 hours. Enforced requisites: courses 121, 122. Limited to Architectural Studies majors. Introduction to disciplinary issues, techniques, and organizations of landscape and how those can influence design of building and site. Development of material and temporal characteristics of architecture relative to role those play in landscape. Introduction to issues of accessibility and egress as systems of movement. Structure as serial component that relates to site, construction, topography, climatology, accessibility, and their mutual interaction. Letter grading.",
    "prerequisites": [
      "ARCH&UD 121",
      "ARCH&UD 122"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD123"
  },
  {
    "course_code": "ARCH&UD M125B",
    "units": 4,
    "title": "Digital Cultural Mapping Core Course B: Google Earth, Geographic Information Systems, Hypercities, and Timelines",
    "description": "(Same as Ancient Near East M125B.) Laboratory, three hours; discussion, one hour. Enforced requisite: Ancient Near East 125A. Hands-on laboratory-based investigation of emerging digital mapping technologies, including instruction in Web-based mapping applications, virtual globes, and geographic information systems (GIS). Critique and creation of maps of cultural phenomena, applying skills students learned in Ancient Near East 125A to real-world data sets in humanities and social sciences. By mastering emerging technologies in field of digital cultural mapping, students take part in evaluation and production of sophisticated visual representations of complex data, becoming active participants in development of this new field. How to use suite of GIS and neogeography tools. Fostering of creative approaches to and engagement with mapping technologies: What new questions can be asked and answered using these technologies? How does one reason, argue, and solve real-world problems through digital cultural mapping? Design, development, and implementation of student mappi",
    "prerequisites": [
      "AN N EA 125A"
    ],
    "cross_listed": [
      "AN N EA M125B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUDM125B"
  },
  {
    "course_code": "ARCH&UD M125C",
    "units": 4,
    "title": "Digital Cultural Mapping Core Course C: Summer Research",
    "description": "(Same as Ancient Near East M125C.) Laboratory, three hours; fieldwork, one hour. Enforced requisite: course M125B or Ancient Near East M125B. Participation in collaborative geographic information systems (GIS) research project in humanities or social sciences using skills learned in courses 125A and M125B. Gathering and input of datasets from real-world sources, creating visual representations of data through production of digital maps, and performing analysis of larger dataset to answer specific research questions. Final oral presentation required that details student work and provides critical analysis of source material and technological/methodological issues inherent to type of GIS used for investigation. Part of Digital Cultural Mapping Project supported by W.M. Keck Foundation. Offered in summer only. P/NP or letter grading.",
    "prerequisites": [
      "ARCH&UD M125B",
      "AN N EA M125B"
    ],
    "cross_listed": [
      "AN N EA M125C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUDM125C"
  },
  {
    "course_code": "ARCH&UD 131",
    "units": 5,
    "title": "Issues in Contemporary Design",
    "description": "Lecture, three hours; outside study, 12 hours. Limited to Architectural Studies majors. How global design culture today operates as part of set of spatial, economic, political, and social discourses. From development of cities to new formal languages in architecture, consequences of fact that great percentage of our lives is spent in controlled designed environments, including role that research and interdisciplinarity play today in influencing design ideas and processes, as well as how design is influenced by technology and new urban conditions. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD131"
  },
  {
    "course_code": "ARCH&UD 132",
    "units": 5,
    "title": "Histories of Housing and Domesticity: 19th Century to the Present",
    "description": "Lecture, three hours; outside study, 12 hours. Limited to Architectural Studies majors or with consent of instructor. Investigation of relationship between architecture, political economy, and the environment through the medium of housing, from 19th-century philanthropy to cooperative, municipal, and national enterprise. Focus on worldwide examples spanning two centuries, study connects politics, law, industry, and finance to better identify the role of architecture in the materialization of housing. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD132"
  },
  {
    "course_code": "ARCH&UD 133",
    "units": 5,
    "title": "Spatial Justice and the City",
    "description": "Lecture, two hours; discussion, one hour; outside study, 12 hours. Limited to Architectural Studies majors or with consent of instructor. Global cities today, and American cities in particular, are shaped by infrastructure, property, public space, residential and commercial development, preservation, and territoriality. These are the material artifacts not only of construction technologies, but processes like segregation, suburbanization, colonization, reservation, and regulation. Consideration of questions of equity and power in the apparent and repressed histories of places, in contemporary everyday life experiences in cities, and in possible urban futures. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD133"
  },
  {
    "course_code": "ARCH&UD 141",
    "units": 5,
    "title": "Technology I: Projections",
    "description": "Laboratory, four hours; outside study, 11 hours. Limited to Architectural Studies majors. Introduction to techniques of spatial representation as they relate to architectural design. How to communicate using two- and three-dimensional drawing and modeling. Analog and digital techniques and opportunity afforded by moving between both. Analog techniques include orthographic and axonometric projection. Digital techniques focus on computer graphics fundamentals, including bit map and vector graphic imaging using Adobe suite and modeling using Rhinoceros. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD141"
  },
  {
    "course_code": "ARCH&UD 142",
    "units": 5,
    "title": "Technology II: Building Materials and Methods",
    "description": "Laboratory, four hours; outside study, 11 hours. Limited to Architectural Studies majors. Introduction to construction systems and materials in relation to design, such as framed, bearing wall, or hybrid systems. Graphic conventions and organization of construction documents. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD142"
  },
  {
    "course_code": "ARCH&UD 143",
    "units": 5,
    "title": "Technology III: Digital Technology",
    "description": "Laboratory, four hours; outside study, 11 hours. Limited to Architectural Studies majors. Overview of three-dimensional computer-aided visualization concepts, teaching applications of AutoCAD and Maya and their use relative to process of design and visual communication. Basic representation methods and tools and introduction to additional concepts required to dynamically interact with computer and to explore and understand communicative capacities of different methods of representation. Explanation of bitmap versus vector graphics, typography basics, and color output and integration for print and Web, and introduction to three-dimensional digital modeling and fabrication. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD143"
  },
  {
    "course_code": "ARCH&UD CM153",
    "units": 4,
    "title": "Introduction to Sustainable Architecture and Community Planning",
    "description": "(Same as Environment M153.) Lecture, three hours. Relationship of built environment to natural environment through whole systems approach, with focus on sustainable design of buildings and planning of communities. Emphasis on energy efficiency, renewable energy, and appropriate use of resources, including materials, water, and land. Concurrently scheduled with course CM247A. Letter grading.",
    "cross_listed": [
      "ENVIRON M153"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUDCM153"
  },
  {
    "course_code": "ARCH&UD C188CS",
    "units": 4,
    "title": "Special Topics in Architecture and Urban Design—Critical Studies",
    "description": "Lecture, three hours. Limited to seniors in good academic standing. Special topics in critical studies in architectural culture. May be repeated for credit. Concurrently scheduled with course C289CS. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUDC188CS"
  },
  {
    "course_code": "ARCH&UD 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD188SA"
  },
  {
    "course_code": "ARCH&UD 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "ARCH&UD 188S"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD188SB"
  },
  {
    "course_code": "ARCH&UD 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "ARCH&UD 188S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD188SC"
  },
  {
    "course_code": "ARCH&UD C188T",
    "units": 4,
    "title": "Special Topics in Architecture and Urban Design—Technology",
    "description": "Lecture, three hours. Limited to seniors in good academic standing. Special topics in technologies used in architecture. May be repeated for credit. Concurrently scheduled with course C289T. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUDC188T"
  },
  {
    "course_code": "ARCH&UD 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD189"
  },
  {
    "course_code": "ARCH&UD 191",
    "units": 4,
    "title": "Interventions: Urban Humanities in Action (Capstone Studio)",
    "description": "Seminar, four hours; studio, two hours. Requisites: Digital Humanities 30, 151. Using Los Angeles as laboratory, students address issues of spatial justice through scholarly and practical urban interventions. Projects deploy spatial technologies introduced in Digital Humanities 30 and theoretical knowledge learned in Digital Humanities 151 to create urban humanist action-projects. Letter grading.",
    "prerequisites": [
      "Digital Humanities 30",
      "Digital Humanities 151"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD191"
  },
  {
    "course_code": "ARCH&UD 199",
    "units": 2,
    "title": "Directed Research or Senior Project in Architecture and Urban Design",
    "description": "Tutorial, to be arranged. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ARCHUD199"
  }
]