[
  {
    "course_code": "C&EE ST 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEEST19"
  },
  {
    "course_code": "C&EE ST 31",
    "units": 5,
    "title": "Introduction to Slavic, East European, and Central Asian Cultures through Film",
    "description": "Lecture, three hours; discussion, one hour. Interdisciplinary introduction to diversity of languages and cultures represented in Department of Slavic, East European, and Eurasian Languages and Cultures through medium of film. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Social Analysis (Society & Culture)",
      "General Education - Visual & Performance Arts Analysis & Practice (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEEST31"
  },
  {
    "course_code": "C&EE ST 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEEST89"
  },
  {
    "course_code": "C&EE ST 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEEST89HC"
  },
  {
    "course_code": "C&EE ST 91",
    "units": 5,
    "title": "Culture and Society in Central and Eastern Europe",
    "description": "Lecture, three hours; discussion, one hour. Interdisciplinary introduction to main themes and concepts of Central and East European studies, including historical background, nation states and ethnic groups, and languages spoken in area. Focus on politics, society, and culture in communist and early post-communist periods: party control and dissidence; national economic planning and private entrepreneurship; atheist education and state religion; politically engaged literature, mass media, and freedom of expression; sports, visual and performing arts, and nationalism. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEEST91"
  },
  {
    "course_code": "C&EE ST 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEEST99"
  },
  {
    "course_code": "C&EE ST M120",
    "units": 4,
    "title": "Women and Literature in Southeastern Europe",
    "description": "(Same as Comparative Literature M120.) Seminar, three hours. Examination of changing roles of women in Balkan countries (Albania, Bosnia-Herzegovina, Bulgaria, Croatia, Greece, Macedonia, Montenegro, Romania, Serbia, Slovenia, Turkey) in last forty years. Emphasis on cultural, social, political, and economic factors affecting women’s roles during countries’ transition from agricultural to industrial economy and from communism to post-communism (in former communist countries). Sensitizes students to complexity of issues in region and helps them better understand multiplicity of causes of present situation. Interdisciplinary study, drawing on sociological/women’s studies, articles, and short fiction by women writers for analysis. Discussion of topics covered in articles, positions taken by authors, and ways in which aspects of Southeast European realities are rendered in fictional form by women writers from region. P/NP or letter grading.",
    "cross_listed": [
      "COM LIT M120"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEESTM120"
  },
  {
    "course_code": "C&EE ST M125",
    "units": 4,
    "title": "Interwar Central European Prose",
    "description": "(Formerly numbered 125.) (Same as European Languages and Transcultural Studies M125.) Lecture, three hours. Analysis of selected novels, stories, plays, and essays of representative authors of 1920s and 1930s in translation. Special attention to relation between literature and historical and ethnic concerns. P/NP or letter grading.",
    "cross_listed": [
      "ELTS M125"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEESTM125"
  },
  {
    "course_code": "C&EE ST CM126",
    "units": 4,
    "title": "Cold-War Central European Culture",
    "description": "(Formerly numbered C126.) (Same as European Languages and Transcultural Studies CM126.) Lecture, three hours. Examination of cold-war Central European culture through prism of prose fiction, essays, and film from 1947 to 1989. Analysis of strategies of Polish, Czech, Hungarian, and East German writers as articulation of tensions, contradictions, and compromises informing communist rule in central and eastern Europe, with focus on culture as node of resistance as well as accommodation to communist system. Concurrently scheduled with course CM226. P/NP or letter grading.",
    "cross_listed": [
      "ELTS CM126"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEESTCM126"
  },
  {
    "course_code": "C&EE ST 127",
    "units": 4,
    "title": "Central European Culture after Fall of Communism",
    "description": "Lecture, three hours. Examination of Central and East European culture through literature, film, visual arts, music, and other cultural artifacts from 1989 to present. Analysis of Polish, Czech, Slovak, Romanian, Hungarian, former Yugoslav, and East German writers, essayists, filmmakers, musicians, visual artists, and graphic novelists in order to reflect on nature of political and societal changes after fall of communism. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEEST127"
  },
  {
    "course_code": "C&EE ST 130",
    "units": 4,
    "title": "Balkan Cultures in Film and Literature",
    "description": "Lecture, three hours. Examination of cultural and linguistic issues in Western Balkans (Bosnia, Croatia, Serbia) through literature, film, music, and visual arts. Examination of interaction of politics and culture (language, religion, literature, film, and mass media) before and after breakup of Yugoslavia by analyzing movies, literature, and music. All texts and films are in English translation. No prior knowledge of Western Balkan languages is required. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEEST130"
  },
  {
    "course_code": "C&EE ST 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEEST189"
  },
  {
    "course_code": "C&EE ST 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEEST189HC"
  },
  {
    "course_code": "C&EE ST 191",
    "units": 4,
    "title": "Variable Topics Research Seminars: Central and East European Studies",
    "description": "Seminar, three hours. Study and discussion of specialized issues and approaches in history, structure, and thematics of one or more literary traditions of central and eastern Europe. Consult Schedule of Classes for topics to be offered in specific term. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/CEEST191"
  }
]