[
  {
    "course_code": "COM LIT 1A",
    "units": 5,
    "title": "World Literature: Antiquity to Middle Ages",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: satisfaction of Entry-Level Writing requirement. Not open for credit to students with credit for course 2AW or 4AW. Study of major texts in world literature, with emphasis on Western civilization. Texts include major works and authors such as Iliad or Odyssey, Greek tragedies, portions of Bible, Virgil, Petronius, St. Augustine, and others such as Gilgamesh or Tristan and Iseult. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "credit_exclusions": [
      "COM LIT 4AW",
      "COM LIT 2AW"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT1A"
  },
  {
    "course_code": "COM LIT 1B",
    "units": 5,
    "title": "World Literature: Middle Ages to 17th Century",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: satisfaction of Entry-Level Writing requirement. Study of world literature, with emphasis on Western civilization as it grapples with its past and with other civilizations. Examination of works such as Dante's Divine Comedy, Cervantes' Don Quixote, Shakespeare's King Lear, and Sor Juana's Mexican poetry. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT1B"
  },
  {
    "course_code": "COM LIT 1C",
    "units": 5,
    "title": "World Literature: Age of Enlightenment to 20th Century",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: satisfaction of Entry-Level Writing requirement. Not open for credit to students with credit for course 2CW or 4CW. Study of major texts in world literature, with emphasis on Western civilization. Authors include Swift, Voltaire, Diderot, Rousseau, Goethe, Flaubert, Ibsen, Strindberg, Dostoevsky, Kafka, Joyce, Woolf, and Stevens. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "credit_exclusions": [
      "COM LIT 4CW",
      "Age of Enlightenment to 20",
      "COM LIT 2CW",
      "Age of Enlightenment to 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT1C"
  },
  {
    "course_code": "COM LIT 1D",
    "units": 5,
    "title": "Great Books from World at Large",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: satisfaction of Entry-Level Writing requirement. Not open for credit to students with credit for course 2DW or 4DW. Study of major literary texts usually overlooked in courses that focus only on canon of Western literature. Texts from at least three of following areas read in any given term: African, Caribbean, East Asian, Latin American, and Middle Eastern literature. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "credit_exclusions": [
      "COM LIT 4DW",
      "COM LIT 2DW"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT1D"
  },
  {
    "course_code": "COM LIT 1E",
    "units": 5,
    "title": "Social Media and Storytelling: Comparing Cultures",
    "description": "Lecture, two hours; discussion, one hour. Enforced requisite: satisfaction of Entry-Level Writing requirement. Study of ways in which social media construct increasingly diverse and decentered narratives—with which we make localized sense of world. Equal emphasis on textual, visual, and sonic networks in arts, politics, and health care. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT1E"
  },
  {
    "course_code": "COM LIT 1H",
    "units": 5,
    "title": "Health Humanities",
    "description": "Lecture, two hours; discussion, one hour. Enforced requisite: satisfaction of Entry-Level Writing requirement. Introduction to health humanities, including literary and cultural examinations of health, illness, embodiment, medicine, and health care. Focus on the diversity of individual, cultural, and societal experiences. Study of literary texts in dialogue with other disciplines in the social sciences, life sciences, health sciences, humanities, and arts. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT1H"
  },
  {
    "course_code": "COM LIT 2AW",
    "units": 5,
    "title": "Survey of Literature: Antiquity to Middle Ages",
    "description": "Lecture, two hours; discussion, two hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 1A or 4AW. Study of selected texts from antiquity to Middle Ages, with emphasis on literary analysis and expository writing. Texts include works and authors such as Odyssey, Gilgamesh, Sappho, Greek tragedies, Aeneid, Petronius, Beowulf, Marie de France, Tristan and Iseult, One Thousand and One Nights, Popul Vuh. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3",
      "ENGCOMP 3H",
      "ESL 36"
    ],
    "credit_exclusions": [
      "COM LIT 4AW",
      "COM LIT 1A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT2AW"
  },
  {
    "course_code": "COM LIT 2BW",
    "units": 5,
    "title": "Survey of Literature: Middle Ages to 17th Century",
    "description": "Lecture, two hours; discussion, two hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 1B or 4BW. Study of selected texts from Middle Ages to 17th century, with emphasis on literary analysis and expository writing. Texts may include works by authors such as Chaucer, Dante, Cervantes, Marguerite de Navarre, Shakespeare, Calderón, Molière, and Racine. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3",
      "ENGCOMP 3H",
      "ESL 36"
    ],
    "credit_exclusions": [
      "COM LIT 4BW",
      "Middle Ages to 17",
      "COM LIT 1B",
      "Middle Ages to 17"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT2BW"
  },
  {
    "course_code": "COM LIT 2CW",
    "units": 5,
    "title": "Survey of Literature: Age of Enlightenment to 20th Century",
    "description": "Lecture, two hours; discussion, two hours. Enforced requisite: English Composition 3. Not open for credit to students with credit for course 1C or 4CW. Study of selected texts from Age of Enlightenment to 20th century, with emphasis on literary analysis and expository writing. Diderot, Dostoevsky, Flaubert, Goethe, Ibsen, James Joyce, Kafka, Jamaica Kincaid, Garcia Marquez, Rousseau, M. Shelley, Strindberg, Swift, Voltaire. Analysis of texts includes focus on structures, processes, and practices that generate inter-group inequities or conflicts as well as those that support fairness and inclusiveness. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "credit_exclusions": [
      "COM LIT 4CW",
      "Age of Enlightenment to 20",
      "COM LIT 1C",
      "Age of Enlightenment to 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT2CW"
  },
  {
    "course_code": "COM LIT 2DW",
    "units": 5,
    "title": "Survey of Literature: Great Books from World at Large",
    "description": "Lecture, two hours; discussion, two hours. Enforced requisite: English Composition 3. Not open for credit to students with credit for course 1D or 4DW. Study of major literary texts usually overlooked in courses that focus only on canon of Western literature, with emphasis on literary analysis and expository writing. Texts from at least three of following areas read in any given term: African, Caribbean, East Asian, Latin American, and Middle Eastern literature. Analysis of texts includes focus on structures, processes, and practices that generate inter-group inequities or conflicts as well as those that support fairness and inclusiveness. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "Writing II",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "credit_exclusions": [
      "COM LIT 1D",
      "COM LIT 4DW"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT2DW"
  },
  {
    "course_code": "COM LIT 4AW",
    "units": 5,
    "title": "Literature and Writing: Antiquity to Middle Ages",
    "description": "Discussion, four hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 1A or 2AW. Study and discussion of selected texts from antiquity to Middle Ages, with emphasis on literary analysis and expository writing. Texts include works and authors such as Iliad, Odyssey, Gilgamesh, Sappho, Greek tragedies, Aeneid, Petronius, Beowulf, or Marie de France. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3",
      "ENGCOMP 3H",
      "ESL 36"
    ],
    "credit_exclusions": [
      "COM LIT 2AW",
      "COM LIT 1A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT4AW"
  },
  {
    "course_code": "COM LIT 4BW",
    "units": 5,
    "title": "Literature and Writing: Middle Ages to 17th Century",
    "description": "Discussion, four hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 1B or 2BW. Study and discussion of selected texts from Middle Ages to 17th century, with emphasis on literary analysis and expository writing. Texts may include works and authors such as Chaucer, Dante’s Divine Comedy, Cervantes’ Don Quixote, Shakespeare, One Thousand and One Nights, Christine de Pizan, Popul Vuh, Molière, and Racine. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3",
      "ENGCOMP 3H",
      "ESL 36"
    ],
    "credit_exclusions": [
      "COM LIT 2BW",
      "Middle Ages to 17",
      "COM LIT 1B",
      "Middle Ages to 17"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT4BW"
  },
  {
    "course_code": "COM LIT 4CW",
    "units": 5,
    "title": "Literature and Writing: Age of Enlightenment to 20th Century",
    "description": "Discussion, four hours. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course 1C or 2CW. Study and discussion of selected texts from Age of Enlightenment to 20th century, with emphasis on literary analysis and expository writing. Texts may include works by authors such as Swift, Voltaire, Diderot, Rousseau, Goethe, M. Shelley, Flaubert, Ibsen, Strindberg, Dostoevsky, Gogol, Kafka, Joyce, Beckett, L. Hughes, and Garcia Marquez. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3",
      "ENGCOMP 3H",
      "ESL 36"
    ],
    "credit_exclusions": [
      "COM LIT 2CW",
      "Age of Enlightenment to 20",
      "COM LIT 1C",
      "Age of Enlightenment to 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT4CW"
  },
  {
    "course_code": "COM LIT 4DW",
    "units": 5,
    "title": "Literature and Writing: Great Books from World at Large",
    "description": "Seminar, four hours. Enforced requisite: English Composition 3. Not open for credit to students with credit for course 1D or 2DW. Study and discussion of major literary texts usually overlooked in courses that focus only on canon of Western literature, with emphasis on literary analysis and expository writing. Texts from at least three of following areas read in any given term: African, Caribbean, East Asian, Latin American, and Middle Eastern literature. Texts may include works by authors such as Achebe, Can Xue, Desai, Emecheta, Kincaid, Neruda, Ngugi, Pak, Rushdie, and El Saadawi. Analysis of texts includes focus on structures, processes, and practices that generate inter-group inequities or conflicts as well as those that support fairness and inclusiveness. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "Writing II",
      "Diversity - Arts and Architecture"
    ],
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "credit_exclusions": [
      "COM LIT 1D",
      "COM LIT 2DW"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT4DW"
  },
  {
    "course_code": "COM LIT 10",
    "units": 5,
    "title": "Virtual Realities: Introduction to Humanities",
    "description": "Lecture, two hours; discussion, two hours. What exactly are humanities? Position of humanities as not science is becoming unclear as human communication, thought, and culture are increasingly tied to technology. Examination of various disciplines within humanities at UCLA to define their place in today’s society, contemplate their possible function in tomorrow’s world, and determine to whom humanities will and will not cater in future. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT10"
  },
  {
    "course_code": "COM LIT 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT19"
  },
  {
    "course_code": "COM LIT 20",
    "units": 5,
    "title": "Blockchain: Future of Absolutely Everything",
    "description": "Lecture, three hours; discussion, one hour. Interdisciplinary examination of social, cultural, and scientific workings of blockchain. Critical exploration of ethical, legal, and cultural effects of blockchain’s potential to improve human behavior and impact our sense of individuality. P/NP or letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT20"
  },
  {
    "course_code": "COM LIT 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT89"
  },
  {
    "course_code": "COM LIT 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT89HC"
  },
  {
    "course_code": "COM LIT 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT99"
  },
  {
    "course_code": "COM LIT 100",
    "units": 5,
    "title": "Introduction to Literary and Critical Theory",
    "description": "Lecture, four hours. Preparation: satisfaction of Entry-Level Writing and College Writing requirements. Requisites: two courses from Comparative Literature 1 or 2 series or English 10 series or Spanish 60 series, etc. Seminar-style introduction to discipline of comparative literature presented through series of texts illustrative of its formation and practice. Letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture"
    ],
    "prerequisites": [
      "COM LIT 1",
      "COM LIT 2",
      "English 10",
      "Spanish 60"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT100"
  },
  {
    "course_code": "COM LIT M101",
    "units": 4,
    "title": "Hebrew Literature in English: Literary Traditions of Ancient Israel—Bible and Apocrypha",
    "description": "(Same as Jewish Studies M150A.) Lecture, three hours. Study of literary culture of ancient Israel through examination of principal compositional strategies of Hebrew Bible and Apocrypha (read in translation). P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M150A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM101"
  },
  {
    "course_code": "COM LIT 102",
    "units": 4,
    "title": "Classical Tradition: Epic",
    "description": "Seminar, three hours. Designed for upper-division literature majors. Analysis of Iliad, Odyssey, Aeneid, Gerusalemme Liberata, and Paradise Lost both in relation to their contemporary societies and to literary traditions. Emphasis on how poets build on work of their predecessors. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT102"
  },
  {
    "course_code": "COM LIT 103",
    "units": 4,
    "title": "People on Run: Migrants, Minorities, and Multiculturalism in Europe",
    "description": "Seminar, three hours. Problem of migrants and refugees in ongoing crisis of European Union. Examination of contemporary crisis of European Union and of European multiculturalism in particular. Overview of history of European integration since World War II, as well as more focused examination of ways in which culture and migration have come to dominate discussions of future of what had primarily been conceived of as one economic union. Offered in summer only. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT103"
  },
  {
    "course_code": "COM LIT 104",
    "units": 4,
    "title": "Art of Film Adaptation",
    "description": "Seminar, three hours. Engagement with current debates and key theoretical texts about film adaptation. Exploration of art of film adaptation in broad sense, including transformation of short stories, plays, novels, historical accounts, biographies, paintings, musical compositions, or philosophical concepts into multilayered medium of cinema. Adaptations addressed include selection of films from range of cultural and linguistic traditions by directors such as Kiarostami, Varda, Kurosawa, Babenco, Rossellini, Hitchcock, Antonioni, Kieslowski, and Taymor. Specific directors, films, and cinematic traditions vary year to year. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT104"
  },
  {
    "course_code": "COM LIT C105",
    "units": 4,
    "title": "Comic Vision",
    "description": "Lecture, three hours. Designed for upper-division literature majors. Literary masterpieces, both dramatic and nondramatic, selected to demonstrate varieties of comic expression. May be concurrently scheduled with course C205. Undergraduate students read all works in translation. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITC105"
  },
  {
    "course_code": "COM LIT 106",
    "units": 4,
    "title": "Archetypal Heroes in Literature",
    "description": "Seminar, three hours. Designed for juniors/seniors. Survey and analysis of function and appearance of such archetypal heroes as Achilles, Ulysses, Prometheus, Oedipus, and Orpheus in literature from antiquity to modern period. All works read in translation. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT106"
  },
  {
    "course_code": "COM LIT 107",
    "units": 4,
    "title": "Film on Brain",
    "description": "Seminar, three hours; discussion/analysis, two hours; film laboratory, one hour. Designed for juniors/seniors. Survey and analysis of intersections between film analysis and neuroscience. Exploration of questions such as how do cues on screen prompt emotions in mind; what are viewers’ neurological responses to comedy; what are potential affective impacts of color; how do brains respond to screen violence. Investigation of emotional contagion that occurs between certain screen characters and certain viewers, including in narrative structures acknowledged to be fictitious. Analysis of filmic strategies and techniques employed by directors to elicit emotional responses from audiences. Students learn to produce five- to eight-minute film on relevant topic in film laboratory. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT107"
  },
  {
    "course_code": "COM LIT 108",
    "units": 5,
    "title": "Autobiography in Francophone and Anglophone Worlds",
    "description": "Seminar, three hours. Designed for juniors/seniors. Focus on number of narratives that use autobiographical mode to situate self in relation to history of nations and biography of family members. Introduction to theories of subjectivity and to genre of self-writing in France, Africa, and Caribbean. Comparison of serial autobiographies of Assia Djebar, Annie Ernaux, and Jamaica Kincaid to better understand limits of genre. Texts represent different limit cases of autobiography and can be read as biography, auto/ethnography, and auto/historiography. Examination of differences that emerge between autobiographical pact (Lejeune) that some authors create with their readers and liberties that others take with history. Attention to way visual culture (painting, photography, film) helps authors make their point, access memory, or create metaphors of self. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT108"
  },
  {
    "course_code": "COM LIT M110",
    "units": 4,
    "title": "One Thousand and One Nights/Alf Layla Wa-Layla",
    "description": "(Same as Arabic M110.) Lecture, three hours. Knowledge of Arabic not required. Since its appearance in Europe in 1704, One Thousand and One Nights is most well-known work of Arabic literature in West. Examination of cycle of tales more commonly known as Arabian Nights, including history of its translation, contemporary oral performances of tales in Arabic-speaking world, literary emergence of vernacular language in relation to classical Arabic, and Western appropriations of tales in music, film, and novels (Ravel, Rimsky-Korsakov, Barth, Poe, and Walt Disney). P/NP or letter grading.",
    "cross_listed": [
      "ARABIC M110"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM110"
  },
  {
    "course_code": "COM LIT 111",
    "units": 5,
    "title": "Histories and Methodologies of Comparative Literature",
    "description": "Seminar, three hours. Preparation: satisfaction of Entry-Level Writing and College writing requirements. Requisites: two courses from Comparative Literature 1 or 2 series or English 10 series or Spanish 60 series. Recommended: course 100. Exploration of history of comparative literature discipline and variety of central methodological past and present debates concerning nature of discipline. Introduction to several key theoretical texts from early 20th century to present, addressing these and other related questions: what does it mean to read comparatively? What is significance of reading literature across existing national and linguistic borders? What are criteria for conducting such comparative readings? Is comparative reading more concerned with finding similarities or differences? P/NP or letter grading.",
    "prerequisites": [
      "COM LIT 1",
      "COM LIT 2",
      "English 10",
      "Spanish 60"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT111"
  },
  {
    "course_code": "COM LIT 112",
    "units": 4,
    "title": "Poetics of Hip-Hop",
    "description": "Seminar, three hours. Exploration of poetics of hip-hop within tradition of comparative literature. Examination of rhythm, rhymes, flow, wordplay, traditions of signifying, beats, samples, production, and hermeneutics of music videos within historical framework. Historical and current hip-hop criticism and scholarship from comparative perspective, with goal of developing methods, approaches, and strategies for interpreting and writing about hip-hop. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT112"
  },
  {
    "course_code": "COM LIT 113",
    "units": 4,
    "title": "Opera in LA Live",
    "description": "Seminar, three hours; field trips. Interpretation of operas currently being performed in Los Angeles from critical perspective of comparative literature studies. Content varies to match changing repertoire. Critical exploration and relation of every aspect of opera as literary and musical form. Analysis and interpretation of original literary source and libretto, music, singing, staging, dramaturgy, reception, and live performance. Two or more field trips to LA Opera, UCLA Opera, and/or Long Beach Opera to experience opera. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT113"
  },
  {
    "course_code": "COM LIT M119",
    "units": 4,
    "title": "Al-Andalus: Literature of Islamic Spain",
    "description": "(Same as Arabic M155.) Lecture, three hours. Study of literature of Islamic Spain to learn about interaction of Arabic and Western and Arabic and Jewish cultures and to recognize Islamic culture as vital force in European life and letters. P/NP or letter grading.",
    "cross_listed": [
      "ARABIC M155"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM119"
  },
  {
    "course_code": "COM LIT M120",
    "units": 4,
    "title": "Women and Literature in Southeastern Europe",
    "description": "(Same as Central and East European Studies M120.) Seminar, three hours. Examination of changing roles of women in Balkan countries (Albania, Bosnia-Herzegovina, Bulgaria, Croatia, Greece, Macedonia, Montenegro, Romania, Serbia, Slovenia, Turkey) in last forty years. Emphasis on cultural, social, political, and economic factors affecting women’s roles during countries’ transition from agricultural to industrial economy and from communism to post-communism (in former communist countries). Sensitizes students to complexity of issues in region and helps them better understand multiplicity of causes of present situation. Interdisciplinary study, drawing on sociological/women’s studies, articles, and short fiction by women writers for analysis. Discussion of topics covered in articles, positions taken by authors, and ways in which aspects of Southeast European realities are rendered in fictional form by women writers from region. P/NP or letter grading.",
    "cross_listed": [
      "C&EE ST M120"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM120"
  },
  {
    "course_code": "COM LIT C122",
    "units": 4,
    "title": "Renaissance Drama",
    "description": "Lecture, three hours. Designed for upper-division literature majors. Broad introduction to subject matter and types of plays in Renaissance, with consideration of historical and literary influences on plays. Readings include works of such dramatists as Tasso, Machiavelli, Lope de Vega, Racine, Jonson, Shakespeare. May be concurrently scheduled with course C222. Undergraduate students read all works in translation. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITC122"
  },
  {
    "course_code": "COM LIT M123",
    "units": 4,
    "title": "Oral Literature and Performance of Arab World",
    "description": "(Same as Arabic M123.) Lecture, three hours. Knowledge of Arabic not required. Introduction to study of living oral traditions of troubadours, storytellers, oral poets, and performers in Arabic-speaking Middle East. P/NP or letter grading.",
    "cross_listed": [
      "ARABIC M123"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM123"
  },
  {
    "course_code": "COM LIT M132",
    "units": 4,
    "title": "Comparative Media Studies",
    "description": "(Same as Russian M132.) Lecture, three hours. History, form, and function of various media. Grounded in political and commercial experience of eastern Europe, comparative investigation of media technologies, today’s burgeoning markets, and yesterday’s tragic abuses. Development of media form(s) and content across various times, places, and cultures, with special attention to Slavic phenomena. Letter grading.",
    "cross_listed": [
      "RUSSN M132"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM132"
  },
  {
    "course_code": "COM LIT M142",
    "units": 4,
    "title": "Travel Narratives, Testimony, Autobiography",
    "description": "(Same as Portuguese M142C.) Lecture, four hours. Taught in English. Exploration of travel, memory, and narrative in Portuguese-speaking world. Primary and secondary texts depict issues of displacement, cultural contact, and assimilation. Overview of connections among Portuguese-speaking cultures. May be repeated for credit with topic change. P/NP or letter grading.",
    "cross_listed": [
      "PORTGSE M142C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM142"
  },
  {
    "course_code": "COM LIT M148",
    "units": 4,
    "title": "Contemporary Arab Film and Song",
    "description": "(Same as Arabic M148.) Seminar, three hours. Exploration of conjunctions between contemporary Arab film and song and between popular cultures and cultures of commitment (Iltizam), with possible focus on specific genres such as realist/neorealist Arab film; feminist Arab film or popular Arab film and song; topics such as nation, gender, and representation or democracy and human rights or censorship, reception, and resistance. Possible examination of various national cinemas such as Tunisian, Egyptian, Moroccan, Algerian, and Palestinian. Various musical genres such as Rai, Mizoued, and Hip-hop also examined in relation to emergence not only of national cinemas, national music industries, and iconic singers but also of video clip, satellite TV, star academy, and reality shows—all products of transnational and pan-Arab mass media. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture"
    ],
    "cross_listed": [
      "ARABIC M148"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM148"
  },
  {
    "course_code": "COM LIT C152",
    "units": 5,
    "title": "Symbolism and Decadence",
    "description": "Seminar, four hours. Designed for upper-division literature majors. Study of symbolist and decadent movements in 19th- and 20th-century English and French poetry and prose, including authors such as Baudelaire, Rimbaud, Verlaine, Mallarmé, Wilde, Yeats, and Eliot. May be concurrently scheduled with course C252. Undergraduate students may read all required French texts in translation. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITC152"
  },
  {
    "course_code": "COM LIT C153",
    "units": 5,
    "title": "Post-Symbolist Poetry and Poetics",
    "description": "Seminar, four hours. Designed for upper-division literature majors. Study of specific poets and poetics related to them during first half of 20th century. Texts may include poets such as W.B. Yeats, Ezra Pound, T.S. Eliot, Paul Valéry, R.M. Rilke, Gunnar Ekelöf, and Wallace Stevens. May be concurrently scheduled with course C253. Undergraduate students may read all works in translation. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITC153"
  },
  {
    "course_code": "COM LIT 154",
    "units": 5,
    "title": "Adventures of Avant-Garde",
    "description": "Seminar, four hours. Designed for upper-division literature majors. Interdisciplinary study of avant-garde literature and art, including futurism, Dadaism, Expressionism, Surrealism, new avant-gardes. Works by Marinetti, Boccioni, Picasso, Stein, Malevich, Popova, Mayakovsky, Brecht, Fritz Lang, Duchamp, Breton, Buñuel, Lispector, Warhol, Orlan. Emphasis on cross-fertilization among different kinds of aesthetic expression. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT154"
  },
  {
    "course_code": "COM LIT C156",
    "units": 4,
    "title": "Fantastic Fictions",
    "description": "Seminar, three hours. Designed for upper-division literature majors. Time and again in modern literature, corpses become conduits or catalysts for revelation. What are ghosts that fiction frequently cannot put to rest, and what is their connection to national history or nation language or narrative? Readings from James Joyce, John Banville, Henry James, Toni Morrison, Adolfo Bioy Casares, Juan Carlos Onetti, Juan Rulfo, and Carlos Fuentes, with films by Alejandro Amenabar, Andrei Tarkovsky, and Kenji Mizoguchi. May be concurrently scheduled with course C256. Undergraduate students read all works in translation. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITC156"
  },
  {
    "course_code": "COM LIT C160",
    "units": 4,
    "title": "Literature and Visual Arts",
    "description": "Lecture, three hours. Designed for juniors/seniors. Knowledge of art history valuable but not required. Assuming that literature and visual arts are in some degree expressions of cultural and philosophical patterns of eras, study of relationships between writers and movements in painting, architecture, and sculpture. Interdisciplinary investigation of similarities and differences between plastic and verbal arts in comparative study. May be repeated for credit with instructor and/or topic change. May be concurrently scheduled with course C260. Undergraduate students read all works in translation. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITC160"
  },
  {
    "course_code": "COM LIT C161",
    "units": 4,
    "title": "Fiction and History",
    "description": "Seminar, three hours. Designed for upper-division literature majors. Analysis of use of historical events, situations, and characters in literary works of Renaissance and/or modern period. Texts and individual assignments range from Renaissance historical narratives (Italian humanists, Machiavelli) to 19th- and 20th-century novels by authors such as Stendhal, Verga, Tomasi di Lampedusa, Carpentier, and Kundera. Use of fictional methods by historians. Emphasis on how aesthetic, ideological, and political factors influence authors’ choice and use of historical material. May be concurrently scheduled with course C261. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITC161"
  },
  {
    "course_code": "COM LIT M162",
    "units": 4,
    "title": "Israel Seen through Its Literature",
    "description": "(Same as Jewish Studies M162.) Lecture, three hours. Attempt to impart profound understanding of Israel as seen through its literature. Examination of variety of literary texts—stories, novels, and poems—and reading of them in context of their historical backgrounds. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M162"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM162"
  },
  {
    "course_code": "COM LIT C163",
    "units": 5,
    "title": "Crisis of Consciousness in Modern Literature",
    "description": "Seminar, three hours. Designed for upper-division literature majors. Study of modern European and American works that are concerned both in subject matter and artistic methods with growing self-consciousness of human beings and their society, with focus on works of Kafka, Rilke, Woolf, Sartre, and Stevens. May be concurrently scheduled with course C263. Undergraduate students may read all works in translation. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITC163"
  },
  {
    "course_code": "COM LIT C164",
    "units": 5,
    "title": "Modern European Novel",
    "description": "Seminar, three hours. Designed for upper-division literature majors. Study of modern European novel’s development from 19th to 21st century. Use of authors such as Hardy, Strindberg, Lagerkvist, Gide, Proust, Mann, Joyce, Kafka, Woolf, Nabokov, Grass, Christa Wolf, and Enquist to focus on development of themes such as shifting authority, gender conflicts, change versus stability, formal experimentation, and self-consciousness in narrative. May be concurrently scheduled with course C264. Undergraduate students may read all works in translation but are encouraged to read in original language whenever possible. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITC164"
  },
  {
    "course_code": "COM LIT M165",
    "units": 4,
    "title": "Holocaust in Literature",
    "description": "(Same as Jewish Studies M187.) Lecture, three hours. Investigation of how Holocaust informs variety of literary and cinema works and raises wide range of aesthetic and moral questions. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M187"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM165"
  },
  {
    "course_code": "COM LIT M166",
    "units": 4,
    "title": "Modern Jewish Literature in English: Diaspora Literature",
    "description": "(Same as Jewish Studies M151A.) Lecture, three hours. Study of literary responses of Jews to modernity, its challenges, and threats. Readings in texts originally written in English or translated from Hebrew, Yiddish, German, Russian, French, and Italian. Analysis of formal aspects of each work. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M151A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM166"
  },
  {
    "course_code": "COM LIT M167",
    "units": 4,
    "title": "Modern Arabic Literature in English",
    "description": "(Same as Arabic M151.) Lecture, three hours. Designed for upper-division literature majors. Topics may include constructions of otherness in modern Arab culture; East-West debate; memory, trauma, and mourning; violence, narrative, and ethics; globalization, oil, and cultural insurgency; Arab culture in transnational context or questions of reception, exoticism, translation, and marketing. Genres may include prison narratives; novel of terror; memoirs by women and/or by refugees and exiles; 19th- and 20th-century travel narratives; Arabic romantic poetry; literature of pre-1948; rise of Arab novel. Areas may range from generic look at Arab world to narrow focus on Maghreb or one country such as Algeria, Palestine, Iraq, Lebanon, or Egypt. May also be organized around Arab literatures written in one specific language, namely English, Arabic, or French. Letter grading.",
    "cross_listed": [
      "ARABIC M151"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM167"
  },
  {
    "course_code": "COM LIT 169",
    "units": 4,
    "title": "Continental African Authors",
    "description": "Lecture, three hours. Requisite: one course from 1A, 1B, 1C, 2AW, 2BW, 2CW, or English Composition 3 or 3H. Introduction to new set of African authors and attempt to discern similarities or differences they may have with major authors such as Achebe, Ngugi, Armath, Soyinka, etc. P/NP or letter grading.",
    "prerequisites": [
      "COM LIT 1A",
      "COM LIT 1B",
      "COM LIT 1C",
      "COM LIT 2AW",
      "COM LIT 2BW",
      "COM LIT 2CW",
      "ENGCOMP 3",
      "ENGCOMP 3H"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT169"
  },
  {
    "course_code": "COM LIT CM170",
    "units": 5,
    "title": "Alternate Traditions: In Search of Female Voices in Contemporary Literature",
    "description": "(Same as Gender Studies CM170.) Seminar, three hours. Designed for upper-division literature majors. Investigation of narrative texts by contemporary French, German, English, American, Spanish American, African, and Asian women writers from cross-cultural perspective. Common themes, problems, and techniques. Concurrently scheduled with course CM270. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "GENDER CM170"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITCM170"
  },
  {
    "course_code": "COM LIT M171",
    "units": 4,
    "title": "Chinese Immigrant Literature and Film",
    "description": "(Same as Asian American Studies M130B and Chinese M153.) Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. In-depth look at Chinese immigrant experience by reading literature and watching films. Theories of diaspora, gender, and race to inform thinking and discussion of relevant issues. P/NP or letter grading.",
    "cross_listed": [
      "CHIN M153",
      "ASIA AM M130B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM171"
  },
  {
    "course_code": "COM LIT C172",
    "units": 4,
    "title": "Postmodern Novel",
    "description": "Seminar, three hours. Designed for upper-division literature majors. Study of postmodern novel as it developed out of modernism. Postmodernism defined in three different ways—philosophically, scientifically, and economically. Emphasis on relationship of recent novels to theories of structuralism and poststructuralism. Readings include authors such as Borges, Beckett, Nabokov, Pynchon, Fuentes, Grass, Böll, and Calvino. Concurrently scheduled with course C272. Undergraduate students read all works in translation. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITC172"
  },
  {
    "course_code": "COM LIT M175",
    "units": 5,
    "title": "Race, Gender, Class",
    "description": "(Same as Asian American Studies M165.) Seminar, three hours. Theoretical and literary readings combined to explore three main aspects of social and cultural experience (race, gender, class) as separate but interconnected spheres affecting both minority and majority populations in U.S. Examination of these issues from comparative perspectives. P/NP or letter grading.",
    "cross_listed": [
      "ASIA AM M165"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM175"
  },
  {
    "course_code": "COM LIT M176",
    "units": 4,
    "title": "Literature and Technology",
    "description": "(Same as Japanese M156.) Lecture, three hours. Knowledge of Japanese not required. Examination of representation of technology in 20th-century fiction. Discussion of impact of technology on shifting images of gender, subjectivity, and national identity. P/NP or letter grading.",
    "cross_listed": [
      "JAPAN M156"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM176"
  },
  {
    "course_code": "COM LIT 177",
    "units": 5,
    "title": "Comparative Studies of Francophone and Anglophone Caribbean",
    "description": "Seminar, three hours. Designed for juniors/seniors. Introduction to literature and culture of Caribbean basin from New Orleans to Haiti, Martinique, Guadeloupe, Jamaica, Antigua, or Trinidad. Topics include history of French and English colonial influences and rivalries, Haitian revolution and its literary legacies, emergence of nationalist discourses, search for cultural identity, rhetoric of negritude, global poetics of relation, créolité movement, and literary achievements of African diaspora. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT177"
  },
  {
    "course_code": "COM LIT C178",
    "units": 5,
    "title": "India Ink: Literature and Culture of Modern South Asia",
    "description": "Seminar, three hours. Survey of significant issues in history of 20th-century Indian literature and culture. Great works of modern Indian culture by such figures as Rabindranath Tagore, Satyajit Ray, Faiz Ahmed Faiz, and U.R. Anantha Murthy, including novels, short stories, poetry, films, music, and works in cultural criticism and historical scholarship. Central and defining issue for 20th-century Indian culture is experience of British colonial rule and massive cultural and material changes that accompanied it. Exploration of manner in which literature and culture have developed in interaction with powerful social forces, such as struggle for national independence from Britain under leaders like Mahatma Gandhi and expansion of Indian diaspora. Concurrently scheduled with course C278. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITC178"
  },
  {
    "course_code": "COM LIT M179SL",
    "units": 5,
    "title": "Movement in Art, Philosophy, and Daily Life",
    "description": "(Same as Middle Eastern Studies M179SL.) Seminar, three hours; fieldwork, three hours. Exploration of relation between humans and world. Only relevant output of brain, irrespective of what may or may not go on inside it, is control over movements. In living animals, sentience or consciousness exists to integrate often complex input and decide on course of action. Similarly, ownership and agency are inseparably associated with biological systems that control our movements. Movements play vital part in constructing psychosocial environment that permeates and surrounds us. Exploration of how humans and animals move, and how movement, as well as limitations of mobility, relate to personal and community identity. P/NP or letter grading.",
    "cross_listed": [
      "M E STD M179SL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM179SL"
  },
  {
    "course_code": "COM LIT 180",
    "units": 4,
    "title": "Variable Topics: Medical Humanities in Comparative Contexts",
    "description": "Seminar, three hours. Designed for juniors/seniors. Study and discussion of defined periods and approaches in medical humanities, giving pride of place to literary and cultural expressions in dialogue with other disciplines such as anthropology, history, linguistics, philosophy, psychology, or sociology. Consult Schedule of Classes for topics to be offered in specific term. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT180"
  },
  {
    "course_code": "COM LIT 180SL",
    "units": 4,
    "title": "Variable Topics: Medical Humanities in Comparative Contexts and Community-Based Learning",
    "description": "Seminar, three hours; fieldwork, three hours. Exploration of topics in medical humanities with community service component, giving pride of place to literary and cultural expressions with other disciplines such as art, philosophy, or sociology. Ways in which medical humanities can make contributions to Los Angeles community through service learning. Consult Schedule of Classes for topics to be offered in specific term. May be repeated for credit with topic or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT180SL"
  },
  {
    "course_code": "COM LIT 186",
    "units": 4,
    "title": "Undergraduate Research Seminar: Comparative Literature",
    "description": "Seminar, three hours. Preparation: satisfaction of Entry-Level Writing and College Writing requirements. Designed for undergraduate students interested in learning more about research and/or writing honors thesis. Introduction to research in comparative literature, with focus on critical and theoretical methodologies and approaches to analyzing literary texts. Students complete final paper on topic of their own design. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT186"
  },
  {
    "course_code": "COM LIT C187",
    "units": 5,
    "title": "Reading across Culture",
    "description": "Seminar, three hours. What is it we do when we try to understand words, habits, gestures, and beliefs not our own? Do we understand something foreign to us by immersing ourselves in it or by standing apart? Does ability to understand something foreign imply taking universal standpoint? Can we make judgments about beliefs other than our own? Questions of cultural interpretation have long history in both Western and non-Western cultures. Discussion of history of questions about cross-cultural interpretation and comparative interpretation of cultures in both comparative literature and cultural anthropology. Reading of some very complex and influential works by such writers as Claude Lévi-Strauss, Amitav Ghosh, James Clifford, Edward Said, Gayatri Spivak, and Erich Auerbach. Concurrently scheduled with course C287. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITC187"
  },
  {
    "course_code": "COM LIT 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT188SA"
  },
  {
    "course_code": "COM LIT 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "COM LIT 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT188SB"
  },
  {
    "course_code": "COM LIT 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "COM LIT 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT188SC"
  },
  {
    "course_code": "COM LIT 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT189"
  },
  {
    "course_code": "COM LIT 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT189HC"
  },
  {
    "course_code": "COM LIT 190",
    "units": 2,
    "title": "Research Colloquia in Comparative Literature",
    "description": "Seminar, three hours. Designed to bring together students undertaking supervised tutorial research in seminar setting with one or more faculty members to discuss their own work or related work in discipline. Led by one supervising faculty member. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT190"
  },
  {
    "course_code": "COM LIT 191",
    "units": 4,
    "title": "Variable Topics in Comparative Literature",
    "description": "Seminar, three hours. Designed for juniors/seniors. Study and discussion of limited periods and specialized issues and approaches in literary theory, especially in relation to other modes of discourse such as history, philosophy, psychology, linguistics, anthropology. Development of culminating project required. Consult Schedule of Classes for topics to be offered in specific term. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT191"
  },
  {
    "course_code": "COM LIT M191P",
    "units": 4,
    "title": "Careers in Humanities",
    "description": "(Same as English M191P and Musicology M176.) Seminar, three hours. Challenges misassumptions regarding humanities majors and their practical applications to life after graduation. Exploration of wide range of careers, with hands-on practice in crafting professional narrative. Guest lectures from UCLA professionals and alumni—all experts in career planning and local industry. Students engage with workplace leaders, and simultaneously build professional dossier—on paper or online—in preparation for life after UCLA with a humanities degree. P/NP or letter grading.",
    "cross_listed": [
      "ENGL M191P"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLITM191P"
  },
  {
    "course_code": "COM LIT 197",
    "units": 2,
    "title": "Individual Studies in Comparative Literature",
    "description": "Tutorial, three hours. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT197"
  },
  {
    "course_code": "COM LIT 198",
    "units": 2,
    "title": "Honors Research in Comparative Literature",
    "description": "Tutorial, three hours. Limited to senior comparative literature honors students. Development and completion of honors thesis or comprehensive project on comparative topic selected by student and written under supervision of core faculty member. Students expected to meet regularly with supervisor throughout term. No more than one course may be used to fulfill four-course requirement for Comparative Literature majors. May be repeated once for maximum of 8 units. Individual contract required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT198"
  },
  {
    "course_code": "COM LIT 199",
    "units": 2,
    "title": "Directed Research or Senior Project in Comparative Literature",
    "description": "Tutorial, three hours. Requisite: course 100. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit with consent of chair. Individual contract required. P/NP or letter grading.",
    "prerequisites": [
      "COM LIT 100"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/COMLIT199"
  }
]