[
  {
    "course_code": "DUTCH 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH19"
  },
  {
    "course_code": "DUTCH 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH89"
  },
  {
    "course_code": "DUTCH 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH89HC"
  },
  {
    "course_code": "DUTCH 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH99"
  },
  {
    "course_code": "DUTCH 103A",
    "units": 4,
    "title": "Elementary Dutch",
    "description": "Lecture, four hours; language laboratory. Course 103A is requisite to 103B. Introduction to standard language of Netherlands and one of three standard languages of Belgium. Practice in grammar, listening, speaking, reading, and writing. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH103A"
  },
  {
    "course_code": "DUTCH 103B",
    "units": 4,
    "title": "Elementary Dutch",
    "description": "Lecture, four hours; language laboratory. Requisite: course 103A. Introduction to standard language of Netherlands and one of three standard languages of Belgium. Practice in grammar, listening, speaking, reading, and writing. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 2"
    ],
    "prerequisites": [
      "DUTCH 103A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH103B"
  },
  {
    "course_code": "DUTCH 103C",
    "units": 4,
    "title": "Intermediate Dutch",
    "description": "Lecture, four hours; language laboratory. Requisite: course 103B. Grammatical exercises, conversation, reading and analysis of simple texts. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 3"
    ],
    "prerequisites": [
      "DUTCH 103B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH103C"
  },
  {
    "course_code": "DUTCH 104A",
    "units": 6,
    "title": "Accelerated Dutch",
    "description": "Lecture, four hours; discussion, one hour; laboratory, two hours. Covers material in courses 103A, 103B, 103C in two terms rather than three. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH104A"
  },
  {
    "course_code": "DUTCH 104B",
    "units": 6,
    "title": "Accelerated Dutch",
    "description": "Lecture, four hours; discussion, one hour; laboratory, two hours. Covers material in courses 103A, 103B, 103C in two terms rather than three. Letter grading.",
    "satisfies": [
      "Foreign Language - Level 3"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH104B"
  },
  {
    "course_code": "DUTCH 113",
    "units": 4,
    "title": "Modern Dutch and Flemish Literature in Translation",
    "description": "Lecture, three hours. Readings and analysis of works by selected authors of Netherlands and northern (Flemish) Belgium such as Boon, Claus, Couperus, Hermans, Mulisch, Multatuli, and Reve and selected poets such as Campert, Gezelle, Gorter, Kloos, Lucebert, Nijhoff, Van Ostaijen, and Vroman. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH113"
  },
  {
    "course_code": "DUTCH 120",
    "units": 4,
    "title": "Introduction to Dutch Studies",
    "description": "Lecture, three hours. Brief review of Dutch grammar. Reading and discussion of selections from contemporary Dutch literature, contemporary Dutch literary criticism, and modern Dutch linguistics. Emphasis on developing reading skill and on acquiring familiarity with and appreciation of scope of 20th-century Neerlandistiek. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH120"
  },
  {
    "course_code": "DUTCH 131",
    "units": 4,
    "title": "Introduction to Modern Dutch Literature",
    "description": "Discussion, three hours. Requisite: course 103B or 120. Selected works of literature of Netherlands and northern (Flemish) Belgium from mid-1850s to present, including novels by such writers as Multatuli, Couperus, Hermans, Mulisch, and Reve and poetry by such groups as symbolist Beweging van Tachtig and post-War Beweging van Vijftig. P/NP or letter grading.",
    "prerequisites": [
      "DUTCH 103B",
      "DUTCH 120"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH131"
  },
  {
    "course_code": "DUTCH 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH189"
  },
  {
    "course_code": "DUTCH 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH189HC"
  },
  {
    "course_code": "DUTCH 199",
    "units": 4,
    "title": "Directed Research or Senior Project in Dutch",
    "description": "Tutorial, three hours. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/DUTCH199"
  }
]