[
  {
    "course_code": "EE BIOL 10",
    "units": 4,
    "title": "Plants and Civilization",
    "description": "Lecture, three hours; demonstration, one hour. Designed for nonmajors. Origin of crop plants; man’s role in development, distribution, and modification of food, fiber, medicinal, and other plants in relation to their natural history. P/NP or letter grading.",
    "satisfies": [
      "General Education - Life Sciences without Lab Credit (Scientific Inquiry)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL10"
  },
  {
    "course_code": "EE BIOL 11",
    "units": 5,
    "title": "Biomedical Research Issues in Minority Communities",
    "description": "Discussion, four hours. Limited to 30 students. Discussions and student presentations on biomedical research as it affects minority communities, with emphasis on methodology, design, consequences, and ethics of current research. Discussion leaders provide information on preparation and training for research careers. P/NP or letter grading.",
    "satisfies": [
      "General Education - Life Sciences without Lab Credit (Scientific Inquiry)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL11"
  },
  {
    "course_code": "EE BIOL 12",
    "units": 4,
    "title": "Biodiversity and Extinction: Crisis and Conservation",
    "description": "Lecture, three hours; discussion, one hour. Examination of ecological and evolutionary principles necessary to understand nature and importance of worldwide environmental crisis. Research by students of specific conservation issues and presentation of results to class. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL12"
  },
  {
    "course_code": "EE BIOL 17",
    "units": 5,
    "title": "Evolution for Everyone",
    "description": "Lecture, three hours; discussion, two hours. Exploration in detail of Darwinian natural selection, with emphasis on evidence and implications for modern problems people and societies face, including antibiotic resistance, insect resistance to pesticides, and coevolution of pollinators with crop plants. Nature of science in context of questions about ongoing real-time Darwinian processes. Letter grading.",
    "satisfies": [
      "General Education - Life Sciences without Lab Credit (Scientific Inquiry)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL17"
  },
  {
    "course_code": "EE BIOL 18",
    "units": 5,
    "title": "Why Ecology Matters: Science Behind Environmental Issues",
    "description": "Lecture, three hours; laboratory, two hours. Basic ecological concepts, scientific method, and ecological basis for local and global environmental issues. Major challenges to be faced in this century, including need to find interdisciplinary and collaborative solutions to world’s worsening environmental problems (e.g., global climate change, biodiversity loss, deforestation, pollution, declining water resources, declining fisheries). Environmental literacy to equip students to become leaders in growing green economy and to help forge solutions to current and future environmental crises that threaten natural resource base. P/NP or letter grading.",
    "satisfies": [
      "General Education - Life Sciences with Lab Credit (Scientific Inquiry)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL18"
  },
  {
    "course_code": "EE BIOL 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL19"
  },
  {
    "course_code": "EE BIOL 21",
    "units": 4,
    "title": "Field Biology",
    "description": "Lecture, three hours; discussion, two hours, or field trips, three to four hours. Recommended preparation: Life Sciences 15. Not open for credit to students with credit for course 122 or Life Sciences 1. Introduction to natural history of Western North America, especially Southern California. Classification, distribution, and ecology of common plants and animals. P/NP or letter grading.",
    "satisfies": [
      "General Education - Life Sciences with Lab Credit (Scientific Inquiry)",
      "General Education - Physical Sciences with Lab Credit (Scientific Inquiry)"
    ],
    "credit_exclusions": [
      "EE BIOL 122"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL21"
  },
  {
    "course_code": "EE BIOL 25",
    "units": 5,
    "title": "Living Ocean",
    "description": "Lecture, three hours; laboratory, one hour; field trips, three hours. Not open for credit to students with credit for Earth, Planetary, and Space Sciences 15. Physical and chemical processes that take place in oceans, with emphasis on their effects on organisms. P/NP or letter grading.",
    "satisfies": [
      "General Education - Life Sciences with Lab Credit (Scientific Inquiry)"
    ],
    "credit_exclusions": [
      "EPS SCI 15"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL25"
  },
  {
    "course_code": "EE BIOL 50",
    "units": 4,
    "title": "Desert Life",
    "description": "Lecture, three hours; laboratory, two hours. Introduction to fundamental structural, physiological, and behavioral features of desert organisms, with special emphasis on deserts of Western North America. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL50"
  },
  {
    "course_code": "EE BIOL 87",
    "units": 1,
    "title": "California's DNA: Field Course",
    "description": "Lecture, one hour; fieldwork, four hours (every other week). Limited to freshmen. Students join CALeDNA community science program and do fieldwork to sample soil and sediments in California. Familiarization with University of California natural reserves spanning coast to woodland, and desert to mountains. Analysis of samples for DNA to capture snapshot of local biodiversity. Prepares students for more intensive, related upper-division science course. Guided Saturday field trips or independent trips. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL87"
  },
  {
    "course_code": "EE BIOL 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL89"
  },
  {
    "course_code": "EE BIOL 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL89HC"
  },
  {
    "course_code": "EE BIOL 95",
    "units": 4,
    "title": "Lower-Division Internship in Biology",
    "description": "Tutorial/fieldwork, three hours per week per unit. Internship course for lower-division students to be supervised by Center for Community Learning, fieldwork site, and faculty adviser. Consult Undergraduate Office for more information. May be repeated twice. Individual contract with supervising faculty member required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL95"
  },
  {
    "course_code": "EE BIOL 96",
    "units": 2,
    "title": "Communicating Science: Bringing Complex Concepts to Life",
    "description": "Seminar, three hours. Limited to Ecology and Evolutionary Biology Department majors. Development of tools for research, integrating and presenting complex scientific concepts concisely and effectively. Basic animation techniques and work in groups to illustrate life sciences concepts. How to engage audiences and convey clear messages. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL96"
  },
  {
    "course_code": "EE BIOL 97",
    "units": 1,
    "title": "Variable Topics in Ecology and Evolutionary Biology",
    "description": "Seminar, three to 12 hours. Current issues in research in ecology and evolutionary biology. Consult Schedule of Classes for topics and instructors. May be repeated for credit with consent of instructor. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL97"
  },
  {
    "course_code": "EE BIOL 97XA",
    "units": 1,
    "title": "PEERS Freshman Seminar: Succeeding in Science",
    "description": "Seminar, one hour. Limited to students in Program for Excellence in Education and Research in Sciences (PEERS). Series of lectures, workshops, and discussions to enhance student success in sciences by developing critical academic survival skills, acquainting students with practice of science, and highlighting opportunities available to participate in research as undergraduate students. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL97XA"
  },
  {
    "course_code": "EE BIOL 97XB",
    "units": 1,
    "title": "PEERS Sophomore Seminar: Pathways in Science",
    "description": "Seminar, one hour. Limited to students in Program for Excellence in Education and Research in Sciences (PEERS). Series of lectures and workshops to enhance student success in sciences by acquainting students with practice of science, opportunities available to participate in research as undergraduate students, and careers available to students with science degrees. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL97XB"
  },
  {
    "course_code": "EE BIOL 97XC",
    "units": 1,
    "title": "AAP Freshman Seminar: Succeeding in Science Majors and Careers",
    "description": "Seminar, one hour. Limited to science majors in Academic Advancement Program (AAP) who took Mathematics 1 in fall term. Series of lectures, workshops, and discussions designed to enhance student success in sciences by developing critical academic survival skills, acquainting students with campus resources, introducing students to practice of science, and highlighting opportunities available to participate in research as undergraduate students. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL97XC"
  },
  {
    "course_code": "EE BIOL 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL99"
  },
  {
    "course_code": "EE BIOL 100",
    "units": 4,
    "title": "Introduction to Ecology and Behavior",
    "description": "Lecture, three hours; discussion, one hour. Requisite: Life Sciences 7B. Not open for credit to students with credit for course 118, 122, 124A, 124B, 125, C126, 129, 132, 134B, 136, or 151B. Introduction to methods and topics in ecology and behavior. Growth and regulation of populations, organization of communities and ecosystems, biogeography, and behaviors animals use to find food, choose mates, and interact in social groups. Letter grading.",
    "prerequisites": [
      "LIFESCI 7B"
    ],
    "credit_exclusions": [
      "EE BIOL 129",
      "EE BIOL C126",
      "EE BIOL 136",
      "EE BIOL 122",
      "EE BIOL 132",
      "EE BIOL 124A",
      "EE BIOL 124B",
      "EE BIOL 134B",
      "EE BIOL 151B",
      "EE BIOL 118",
      "EE BIOL 125"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL100"
  },
  {
    "course_code": "EE BIOL 100L",
    "units": 4,
    "title": "Introduction to Ecology and Behavior Laboratory",
    "description": "Laboratory, four hours. Requisites: course 100 (may be taken concurrently), Life Sciences 1 or 7B. Introduction to research methods in ecology and behavior, resulting in independent research proposals and to gain understanding of scientific method, critical evaluation of research papers, and development of scientific writing skills. Involves work outside and off-campus meetings. To apply this course to the Biology upper-division major laboratory requirement, the corresponding lecture course must be completed with a passing grade. Letter grading.",
    "prerequisites": [
      "EE BIOL 100",
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL100L"
  },
  {
    "course_code": "EE BIOL 101",
    "units": 6,
    "title": "Marine Botany",
    "description": "Lecture, four hours; laboratory, six hours; three to four field trips. Requisite: Life Sciences 1 or 7B. Introduction to biology and ecology of marine plants, including algae, sea grasses, and mangroves, with focus on form and function of marine plants and their ecological role in different marine habitats and ecosystems. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL101"
  },
  {
    "course_code": "EE BIOL 102",
    "units": 4,
    "title": "Biology of Marine Invertebrates",
    "description": "Five-week intensive course. Lecture, five hours; laboratory, 15 hours. Requisite: Life Sciences 1 or 7B. Morphology, systematics, life histories and natural history, ecology, behavior, and physiology of marine invertebrates. Given off campus at marine science center. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL102"
  },
  {
    "course_code": "EE BIOL 103",
    "units": 5,
    "title": "Plant Diversity and Evolution",
    "description": "Lecture, three hours; laboratory, three hours; field trip. Requisites: Life Sciences 1 and 4, or 7A and 7B. Introduction to green plant tree of life, with emphasis on using phylogenetic perspective to examine major transitions in plant evolution, including evolution and diversification of land plants, vascular plants, seed plants, and currently ecologically dominant flowering plants. Introduction to phylogenetics, providing overview of theory and methodology to reconstruct and use phylogenetic trees to study organismal evolution. Exploration of 700 million years of plant evolution, with emphasis on morphological, functional, ecological, and biogeographical perspectives. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 4",
      "LIFESCI 7A",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL103"
  },
  {
    "course_code": "EE BIOL 104",
    "units": 4,
    "title": "Plants and People",
    "description": "Lecture, two and one half hours; discussion, one hour. Enforced requisites: Life Sciences 7A, 7B, 7C. Plants are the foundation of most terrestrial ecosystems and humans are utterly dependent on them for survival and reproduction. Exploration of diversity of plants that provide significant economies and those that intersect with certain cultural cosmologies. Examination of their ecological, evolutionary, and economic histories while studying plant morphology and function. Highlights importance of plants to human cultures from biological and cultural perspectives in historical and modern contexts. Letter grading.",
    "prerequisites": [
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL104"
  },
  {
    "course_code": "EE BIOL 105",
    "units": 6,
    "title": "Biology of Invertebrates",
    "description": "Lecture, three hours; laboratory/field trips, six hours. Requisite: Life Sciences 1 or 7B. Introduction to systematics, evolution, natural history, morphology, and physiology of invertebrates. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL105"
  },
  {
    "course_code": "EE BIOL 106",
    "units": 4,
    "title": "Experimental Marine Invertebrate Biology",
    "description": "Lecture, two hours; laboratory, 12 hours. Requisites: course 105, Physiological Science 166 (may be taken concurrently). Offered either as 6-unit quarter-long course or as 4-unit Marine Biology Quarter course. Advanced course of natural history, physiology, biochemistry of invertebrates, with emphasis on independent laboratory and field investigations. P/NP or letter grading.",
    "prerequisites": [
      "EE BIOL 105",
      "PHYSCI 166"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL106"
  },
  {
    "course_code": "EE BIOL 107",
    "units": 6,
    "title": "Evolution, Development, and Function of Invertebrate Animals",
    "description": "Lecture, three hours; laboratory, three hours; three weekend field trips. Requisite: course 105 or completion of Marine Biology Quarter. Advanced invertebrate biology course exploring evolutionary relationship of animal groups and evolution of marine species, comparative development and developmental genetics of invertebrate form, and form and function as they relate to marine invertebrates. Letter grading.",
    "prerequisites": [
      "EE BIOL 105"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL107"
  },
  {
    "course_code": "EE BIOL 108",
    "units": 5,
    "title": "Biodiversity in Age of Humans",
    "description": "Lecture, two and one half hours; discussion, one hour; field trip, six to eight hours. Students learn how to use scientific method, ask and answer questions about eDNA, analyze literature, and develop professional skills applicable to any major or career. Series of biointeractive videos, interactive worksheets, and short lectures outside of class set baseline knowledge for problem solving and applied learning in classroom. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL108"
  },
  {
    "course_code": "EE BIOL 109",
    "units": 4,
    "title": "Introduction to Marine Science",
    "description": "Lecture, three hours; discussion, one hour. Requisite: Life Sciences 1 or 7B. Strongly recommended for prospective Marine Biology Quarter students. Introduction to physical and biological world of 70 percent of planet: oceans. Designed to be integrative, with focus on geological evolution of seas, physical and chemical properties of water, and how these abiotic processes shape ecology and evolution of marine organisms and environments. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL109"
  },
  {
    "course_code": "EE BIOL 109L",
    "units": 4,
    "title": "Introduction to Marine Science Laboratory",
    "description": "Laboratory, three hours; four field trips. Requisites: course 109 (may be taken concurrently), Life Sciences 1 or 7B. Introduction to marine environments and methods used to study them. Exploration of variety of concepts in marine science, ranging from oceanography to behavior, primary productivity, and marine biodiversity, with emphasis on experimental design and scientific writing. To apply this course to the Biology upper-division major laboratory requirement, the corresponding lecture course must be completed with a passing grade. Letter grading.",
    "prerequisites": [
      "EE BIOL 109",
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL109L"
  },
  {
    "course_code": "EE BIOL 110",
    "units": 6,
    "title": "Vertebrate Morphology",
    "description": "Lecture, three hours; laboratory, five hours. Requisites: Life Sciences 1, 2, and 3, or 7A and 7B. Study of vertebrate morphology, function, and evolution from viewpoint of comparative anatomy of adult forms, biomechanics, development, and paleontology. Laboratory study of selected vertebrates. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 2",
      "LIFESCI 3",
      "LIFESCI 7A",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL110"
  },
  {
    "course_code": "EE BIOL 111",
    "units": 5,
    "title": "Biology of Vertebrates",
    "description": "Lecture, three hours; laboratory, three hours; four one- to two-day field trips. Requisite: Life Sciences 1 or 7B. Adaptations, behavior, and ecology of vertebrates. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL111"
  },
  {
    "course_code": "EE BIOL 112",
    "units": 6,
    "title": "Ichthyology",
    "description": "Lecture, three hours; laboratory, six hours; field trips. Requisite: Life Sciences 1 or 7B. Highly recommended: courses 110, 111. Biology of freshwater and marine fishes, with emphasis on their evolution, systematics, morphology, zoogeography, and ecology. Field trips to examine fishes of Southern California shoreline, tidepools, and coastal streams. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL112"
  },
  {
    "course_code": "EE BIOL 113A",
    "units": 4,
    "title": "Herpetology",
    "description": "Lecture, three hours; discussion, one hour. Requisite: Life Sciences 1 or 7B. Recommended requisite: course 120. Exploration and summarization of evolution, ecology, life history, and conservation biology of world’s reptile and amphibian fauna. Topics include conservation assessments both globally and in California, discussion sections focused on student-led critical evaluations of current literature, and in-class meetings with professional herpetologists to share their professional experiences and job opportunities. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL113A"
  },
  {
    "course_code": "EE BIOL 113AL",
    "units": 4,
    "title": "Herpetology Laboratory",
    "description": "Laboratory, six hour; field trips. Corequisite: course 113A. Primary focus on learning defining features, biogeography, and natural history of world’s reptile and amphibian fauna, with special focus on California species. Field trips to observe living species in field, including one extended three-day trip. Letter grading.",
    "corequisites": [
      "EE BIOL 113A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL113AL"
  },
  {
    "course_code": "EE BIOL 113B",
    "units": 8,
    "title": "Field Herpetology",
    "description": "Requisite: Life Sciences 1. Recommended: courses 100, 111. Two weeks of off-campus research projects followed by two-week lecture course and offered only as part of Field Biology Quarter. Biology, particularly ecology and behavior, of reptiles and amphibians in their natural habitat. Students carry out supervised research projects, then write up and orally present their results in seminar fashion. Letter grading.",
    "prerequisites": [
      "LIFESCI 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL113B"
  },
  {
    "course_code": "EE BIOL 114A",
    "units": 5,
    "title": "Ornithology",
    "description": "Lecture, three hours; laboratory/field trips, three hours. Requisite: Life Sciences 1 or 7B. Recommended: course 100. Systematics, distribution, physiology, behavior, and ecology of birds. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL114A"
  },
  {
    "course_code": "EE BIOL 114B",
    "units": 8,
    "title": "Field Ornithology",
    "description": "Requisite: Life Sciences 1. Recommended: course 100. Two to three weeks of off-campus research projects followed by lecture course and offered only as part of Field Biology Quarter. Biology, particularly ecology and behavior, of birds in their natural habitat. Letter grading.",
    "prerequisites": [
      "LIFESCI 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL114B"
  },
  {
    "course_code": "EE BIOL 115",
    "units": 5,
    "title": "Mammalogy",
    "description": "Lecture, three hours; laboratory, three hours. Requisite: Life Sciences 1 or 7B. Topics in mammalian biology, including evolution, ecology, behavior, functional morphology, systematics, physiology, and biogeography. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL115"
  },
  {
    "course_code": "EE BIOL 116",
    "units": 4,
    "title": "Conservation Biology",
    "description": "Lecture, three hours; discussion, two hours. Requisite: Life Sciences 1 or 7B. Recommended: course 100. Not open for credit to students with credit for Environment 121. Study of ecological and evolutionary principles as they apply to preservation of genetic, species, and ecosystem diversity. Discussion sections focus on interactions of science, policy, and economics in conserving biodiversity. Oral and written student presentation on specific conservation issues. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "credit_exclusions": [
      "ENVIRON 121"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL116"
  },
  {
    "course_code": "EE BIOL 117",
    "units": 5,
    "title": "Evolution of Vertebrates",
    "description": "Lecture, three hours; laboratory, three hours. Recommended requisite: course 110. Survey of origin and evolution of vertebrates through examination of fossil record. Focus on fossil record of tetrapods, with emphasis on anatomical and physiological transformations in amphibians, reptiles, birds, and mammals. Letter grading.",
    "prerequisites": [
      "EE BIOL 110"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL117"
  },
  {
    "course_code": "EE BIOL 118",
    "units": 8,
    "title": "Plant Adaptations",
    "description": "Lecture, one hour; field trip, 10 hours. Requisite: course 100. Five-week course offered only as part of Field Biology Quarter. Field-oriented introduction to mechanisms by which vascular plants adapt themselves to their abiotic and biotic environments using community, population, and ecophysiological levels of integration. Letter grading.",
    "prerequisites": [
      "EE BIOL 100"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL118"
  },
  {
    "course_code": "EE BIOL C119A",
    "units": 4,
    "title": "Mathematical and Computational Modeling in Ecology",
    "description": "Lecture, three hours; discussion, one hour. Requisite: Life Sciences 30B or Mathematics 3B or 31A. Recommended: courses 100, 122, Life Sciences 1 or 7B, Mathematics 3C. Introduction to modeling dynamics of ecological systems, including formulation and analysis of mathematical models, basic techniques of scientific programming, probability and stochastic modeling, and methods to relate models to data. Examples from ecology but techniques and principles applicable throughout life and physical sciences. Concurrently scheduled with course C219A. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 30B",
      "MATH 3B",
      "MATH 31A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLC119A"
  },
  {
    "course_code": "EE BIOL C119B",
    "units": 4,
    "title": "Modeling in Ecological Research",
    "description": "Lecture, two hours; discussion, two hours. Recommended requisite: course C119A. Advanced techniques in mathematical and computational modeling of ecological dynamics and other population dynamic problems. Independent research projects developed by students. Topics include model formulation, stochastic models, fitting models to data, sensitivity analysis, presentation of model results, and other topics from current literature. Concurrently scheduled with course C219B. P/NP or letter grading.",
    "prerequisites": [
      "EE BIOL C119A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLC119B"
  },
  {
    "course_code": "EE BIOL 120",
    "units": 4,
    "title": "Evolution",
    "description": "Lecture, three hours; discussion, two hours. Requisites: Life Sciences 1, 2, 3, 4, and 23L, or 7A, 7B, 7C, and 23L, Mathematics 3A and 3B (or 31A or Life Sciences 30B). Not open for credit to students with credit for course 185. Designed for departmental majors specializing in environmental and population biology. Introduction to mechanics and processes of evolution, with emphasis on natural selection, population genetics, speciation, evolutionary rates, and patterns of adaptation. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 2",
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "MATH 3A",
      "MATH 3B",
      "MATH 31A",
      "LIFESCI 30B"
    ],
    "credit_exclusions": [
      "EE BIOL 185"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL120"
  },
  {
    "course_code": "EE BIOL 121",
    "units": 4,
    "title": "Molecular Evolution",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Life Sciences 3, 4, and 23L, or 7A and 23L. Molecular biology, with emphasis on evolutionary aspects. DNA replication, RNA transcription, protein synthesis, gene expression, and molecular evolution. Letter grading.",
    "prerequisites": [
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL121"
  },
  {
    "course_code": "EE BIOL 122",
    "units": 4,
    "title": "Ecology",
    "description": "Lecture, three hours; discussion, two hours. Requisites: course 100, Life Sciences 1 or 7B, Mathematics 3B or 31A or Life Sciences 30B. Highly recommended: Mathematics 31B, 32A. Designed for departmental majors specializing in environmental and population biology. Introduction to population and community ecology, with emphasis on growth and distributions of populations, interactions between species, and structure, dynamics, and functions of communities and ecosystems. P/NP or letter grading.",
    "prerequisites": [
      "EE BIOL 100",
      "LIFESCI 1",
      "LIFESCI 7B",
      "MATH 3B",
      "MATH 31A",
      "LIFESCI 30B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL122"
  },
  {
    "course_code": "EE BIOL 123A",
    "units": 4,
    "title": "Field Marine Ecology",
    "description": "Lecture, five hours; laboratory, 15 hours. Recommended requisites: courses 100, 122. Offered either as 4- or 8-unit five-week intensive course given off campus as part of Marine Biology Quarter that is in residence at research station located outside continental U.S. Survey of current topics in marine ecology, including analysis of primary research literature combined with field study of ecology of marine organisms, populations, communities, and ecosystems. Original research project required. Letter grading.",
    "prerequisites": [
      "EE BIOL 100",
      "EE BIOL 122"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL123A"
  },
  {
    "course_code": "EE BIOL 123B",
    "units": 4,
    "title": "Field Marine Ecology",
    "description": "Lecture, five hours; laboratory, 15 hours. Recommended requisites: courses 100, 122. Offered either as 4- or 8-unit five-week intensive course given off campus as part of Marine Biology Quarter that is in residence at research station located within U.S., including Alaska and Hawaii. Survey of current topics in marine ecology, including analysis of primary research literature combined with field study of ecology of marine organisms, populations, communities, and ecosystems. Original research project required. Letter grading.",
    "prerequisites": [
      "EE BIOL 100",
      "EE BIOL 122"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL123B"
  },
  {
    "course_code": "EE BIOL 124A",
    "units": 4,
    "title": "Field Ecology",
    "description": "Lecture, five hours; laboratory or field trip, 15 hours. Requisites: course 100, Life Sciences 1 or 7B. Recommended: courses 111, 120, 122. Offered as part of Field Biology Quarter that is in residence at research station located outside continental U.S. for part of or for duration of term. Field and laboratory research in ecology; collection, analysis, and write-up of numerical data, with emphasis on design and execution of field studies. Letter grading.",
    "prerequisites": [
      "EE BIOL 100",
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL124A"
  },
  {
    "course_code": "EE BIOL 124B",
    "units": 4,
    "title": "Field Ecology",
    "description": "Lecture, five hours; laboratory or field trip, 15 hours. Requisites: course 100, Life Sciences 1 or 7B. Recommended: courses 111, 120, 122. Offered as part of Field Biology Quarter that is in residence at research station located within U.S., including Alaska and Hawaii, for part of or for duration of term. Field and laboratory research in ecology; collection, analysis, and write-up of numerical data, with emphasis on design and execution of field studies. Letter grading.",
    "prerequisites": [
      "EE BIOL 100",
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL124B"
  },
  {
    "course_code": "EE BIOL 125",
    "units": 4,
    "title": "Tropical Animal Communication",
    "description": "Lecture, three hours; discussion, two hours. Requisites: course 100, Life Sciences 1 or 7B. Offered either as 4-unit quarter-long course or as 8-unit Field Biology Quarter course. Animal communication behavior, tropical vertebrate biology, and evolution of information processing systems. Eight-unit course covers same basic lecture material in five or six intensive weeks, followed by extended field trips where students do individual projects in animal communication. Letter grading.",
    "prerequisites": [
      "EE BIOL 100",
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL125"
  },
  {
    "course_code": "EE BIOL C126",
    "units": 4,
    "title": "Behavioral Ecology",
    "description": "Lecture, three hours; discussion, two hours. Requisites: course 100, Life Sciences 1 or 7B, Mathematics 3C or 32A or Life Sciences 30B. Recommended: course 129. Offered either as 4-unit quarter-long course or as 8-unit Field Biology Quarter course. Evolutionary perspective of behavioral ecology, with extended consideration of selfish DNA, conflict with genomes, natural selection and coevolution, kin selection and diversity in group functioning and cooperation, social learning, game theory and alternative life histories, and human behavioral ecology. Eight-unit course covers several major areas in animal behavior more broadly, including foraging, sexual selection and predator-prey interactions in five intensive weeks, followed by extended field trip where students do individual projects. Concurrently scheduled with course C242. Letter grading.",
    "prerequisites": [
      "EE BIOL 100",
      "LIFESCI 1",
      "LIFESCI 7B",
      "MATH 3C",
      "MATH 32A",
      "LIFESCI 30B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLC126"
  },
  {
    "course_code": "EE BIOL M127",
    "units": 4,
    "title": "Soils and Environment",
    "description": "(Same as Environment M102 and Geography M102.) Lecture, three hours; discussion, one hour; field trips. General treatment of soils and environmental implications: soil development, morphology, and worldwide distribution of soil orders; physical, chemical, hydrologic, and biological properties; water use, erosion, and pollution; management of soils as related to plant growth and distribution. P/NP or letter grading.",
    "cross_listed": [
      "ENVIRON M102",
      "GEOG M102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLM127"
  },
  {
    "course_code": "EE BIOL M127L",
    "units": 1,
    "title": "Soils and Environment: Field",
    "description": "(Same as Environment M102L and Geography M102L.) Laboratory, one hour; field excursions. Corequisite: course M127. Investigations and demonstrations supporting material in course M127, including excavating, describing, and naming soils in field, soil forming processes, geomorphology, and soils. P/NP or letter grading.",
    "corequisites": [
      "EE BIOL M127"
    ],
    "cross_listed": [
      "ENVIRON M102L",
      "GEOG M102L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLM127L"
  },
  {
    "course_code": "EE BIOL 128",
    "units": 5,
    "title": "Plant Physiological Ecology",
    "description": "Lecture, three hours; laboratory, three hours; one two-day field trip. Requisites: Life Sciences 1 or 7B, Physics 1C and 4BL, or 5B or 6C. Study of plant/environment interactions under natural conditions. Transpiration and photosynthesis, leaf temperatures, and water movement in soil/plant/atmosphere continuum. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B",
      "PHYSICS 1C",
      "PHYSICS 4BL",
      "PHYSICS 5B",
      "PHYSICS 6C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL128"
  },
  {
    "course_code": "EE BIOL 129",
    "units": 4,
    "title": "Animal Behavior",
    "description": "Lecture, three hours; discussion, two hours. Requisites: course 100, Life Sciences 1 or 7B. Introduction to behavioral ecology. Methods and results of evolutionary approaches to study of animal behavior, including foraging strategies, social competition, sexual selection, mating systems, cooperation, and social organization. Letter grading.",
    "prerequisites": [
      "EE BIOL 100",
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL129"
  },
  {
    "course_code": "EE BIOL 130",
    "units": 4,
    "title": "Principles of Systematic Biology",
    "description": "Lecture, three hours; discussion, two hours. Requisite: Life Sciences 1 or 7B. Recommended: courses 120, 135. Concepts, principles, and methods of comparative biology as they apply to inference of evolutionary relationships among organisms. Principles and application of biological nomenclature. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL130"
  },
  {
    "course_code": "EE BIOL M131",
    "units": 4,
    "title": "Ecosystem Ecology",
    "description": "(Same as Geography M110.) Lecture, three hours; field trips. Requisite: Geography 1 or Life Sciences 7B. Designed for juniors/seniors. Development of principles of ecosystem ecology, with focus on understanding links between ecosystem structure and function. Emphasis on energy and water balances, nutrient cycling, plant-soil-microbe interactions, landscape heterogeneity, and human disturbance to ecosystems. P/NP or letter grading.",
    "prerequisites": [
      "Geography 1",
      "LIFESCI 7B"
    ],
    "cross_listed": [
      "GEOG M110"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLM131"
  },
  {
    "course_code": "EE BIOL 132",
    "units": 8,
    "title": "Field Behavioral Ecology",
    "description": "Lecture, two hours; laboratory/field trip, 10 hours. Requisites: course 100, Life Sciences 1 or 7B. Recommended: course 129. Five-week course offered only as part of Field Biology Quarter. Field research in behavioral ecology, emphasizing animal communication. Design and execution of individual and small group field projects during extended field trip. Letter grading.",
    "prerequisites": [
      "EE BIOL 100",
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL132"
  },
  {
    "course_code": "EE BIOL 133",
    "units": 4,
    "title": "Elements of Theoretical and Computational Biology",
    "description": "Lecture, three hours; discussion, one hour; laboratory, two hours. Requisites: Life Sciences 1, 2, 3, 4, 23L, and Mathematics 3A, 3B, and 3C, or 31A and 31B, or Life Sciences 30B. Strongly recommended: elementary statistics course. Introduction of basic core mathematical ideas and models necessary to understand contemporary ecology and evolutionary biology. Population ecology and growth, community ecology, population genetics, natural selection. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 2",
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 23L",
      "MATH 3A",
      "MATH 3B",
      "MATH 3C",
      "MATH 31A",
      "MATH 31B",
      "LIFESCI 30B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL133"
  },
  {
    "course_code": "EE BIOL 134B",
    "units": 8,
    "title": "Field Physiological Ecology of Desert Animals",
    "description": "Fieldwork, 15 hours. Requisite: Life Sciences 1 or 7B. Recommended: course 100. Two weeks of off-campus research projects with two-week lecture course (four hours per day) and offered only as part of Field Biology Quarter. Consideration of physiological, behavioral, morphological, and ecological mechanisms desert animals use to enhance their survival in arid habitat. Students carry out supervised research projects, then write up and orally present their results in seminar fashion. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL134B"
  },
  {
    "course_code": "EE BIOL C135",
    "units": 4,
    "title": "Population Genetics",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: Life Sciences 4 or 7A. Strongly recommended: course 100, Mathematics 31A, and 31B or Life Sciences 30B. Basic principles of genetics of population, dealing with genetic structure of natural populations and mechanisms of evolution. Equilibrium conditions and forces altering gene frequencies, polygenic inheritance, molecular evolution, and methods of quantitative genetics. Concurrently scheduled with course C235. Letter grading.",
    "prerequisites": [
      "LIFESCI 4",
      "LIFESCI 7A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLC135"
  },
  {
    "course_code": "EE BIOL 136",
    "units": 6,
    "title": "Ecological Restoration",
    "description": "Lecture, two and one half hours; laboratory, three hours; three field trips. Requisites: course 100, Life Sciences 1 or 7B. Study of ecosystems that have been degraded by overuse or unsustainable extraction of natural resources, foundation of restoration ecology including historical knowledge, reference sites, soil preparation, biodiversity, California natives, succession, disturbances, and best management practices when restoring landscape. Students learn to identify classic symptoms of unhealthy ecosystem and important metrics to determine if and when ecosystem is recovering. Students evaluate Stone Canyon Creek at UCLA. Students develop site and vegetation maps, conduct soil and water tests, and assess overall health of area. Students develop recommendations for restoration plan. Mandatory all-day field trips. Letter grading.",
    "prerequisites": [
      "EE BIOL 100",
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL136"
  },
  {
    "course_code": "EE BIOL 137",
    "units": 4,
    "title": "Chemical Communication",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Chemistry 14A, 14B, 14BL, 14C, 14CL, and 14D, or 20A, 20B, 20L, 30A, 30AL, 30B, and 30BL, Life Sciences 1, 2, 3, 23L. Chemical signals are most important means by which organisms communicate. Exploration of how chemical signals are produced, transported, and influence behavior of microbes, plants, and animals. Synthetic approach, with emphasis on applications to cell biology, physiology, and ecology. P/NP or letter grading.",
    "prerequisites": [
      "CHEM 14A",
      "CHEM 14B",
      "CHEM 14BL",
      "CHEM 14C",
      "CHEM 14CL",
      "CHEM 14D",
      "CHEM 20A",
      "CHEM 20B",
      "CHEM 20L",
      "CHEM 30A",
      "CHEM 30AL",
      "CHEM 30B",
      "CHEM 30BL",
      "LIFESCI 1",
      "LIFESCI 2",
      "LIFESCI 3",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL137"
  },
  {
    "course_code": "EE BIOL M139",
    "units": 4,
    "title": "Introduction to Chemical Oceanography",
    "description": "(Same as Atmospheric and Oceanic Sciences M105.) Lecture, three hours; discussion, one hour. Introductory course for physical sciences, life sciences, and engineering majors interested in oceanic environment. Chemical composition of oceans and nature of physical, chemical, and biological processes governing this composition in past and present. Cycles of major and minor oceanic constituents, with focus on those that are most important for life (i.e., carbon, nitrogen, phosphorus, silicon, and oxygen). Investigation of primary production, export production, remineralization, diagenesis, air-sea gas exchange processes. Letter grading.",
    "cross_listed": [
      "A&O SCI M105"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLM139"
  },
  {
    "course_code": "EE BIOL 140",
    "units": 4,
    "title": "Biology of Marine Mammals",
    "description": "Lecture, three hours; discussion, one hour. Requisite: Life Sciences 1 or 7B. Examination of evolution, systematics, natural history, anatomy, physiology, and conservation of mammals secondarily adapted to life in oceans: cetaceans, pinnipeds, sirenians, marine otters, and polar bear. Through lectures and readings from recent primary literature, students gain understanding of special adaptations to mammalian life in aquatic environment, roles of marine mammals in oceanic ecosystems, and general principles of marine mammal population biology. Study of historical and contemporary exploitation, conservation, and management of marine mammal stocks. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL140"
  },
  {
    "course_code": "EE BIOL 142",
    "units": 4,
    "title": "Aquatic Communities",
    "description": "Lecture, three hours; discussion, one hour. Requisite: Life Sciences 1 or 7B. Overview of species and communities in marine and freshwater environments. Exploration of interactions of physical and biological factors that shape communities and how scientists test hypotheses. Emphasis on critical reading of primary literature. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL142"
  },
  {
    "course_code": "EE BIOL 143",
    "units": 4,
    "title": "Viral Ecology and Evolution",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Life Sciences 7A, 7B, 7C, 23L. Viruses are most common biological entity on planet, and have broad-ranging ecological and evolutionary environmental and medical impacts. This makes understanding roles of viruses central to understanding how ecosystems work, how microorganisms change over time in face of viral infection, how viral pandemics occur and progress, and how many human diseases affect individual health. Students gain comprehensive understanding of how viruses operate in environmental and medical systems, and how they and their hosts evolve over time; and reasoned perspective on future impacts of viruses in changing ecosystems, and on human societies and health. Emphasis on development of mechanistic understanding of viruses. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL143"
  },
  {
    "course_code": "EE BIOL 144",
    "units": 4,
    "title": "Prehistoric California",
    "description": "Lecture, three hours; discussion, one hour; field trips. Requisite: Life Sciences 7B. Recommended: course 100. Survey of history of life as illustrated in fossil record of California. Emphasis on how faunas have changed over time, especially during periods of diversification and extinction. Relation of influence of major events of geologic, climatic, and environmental change on living organisms to environmental change on human timescales. Emphasis on how scientists collect and evaluate fossil data through understanding of living organisms. Letter grading.",
    "prerequisites": [
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL144"
  },
  {
    "course_code": "EE BIOL 144L",
    "units": 4,
    "title": "Prehistoric California Laboratory",
    "description": "Laboratory, three hours. Corequisite: course 144. Survey of major groups of organisms from oceans and on land that can be found in fossil record of California, and relation of them to some of major events in history of life. Emphasis on how faunas have changed over time, especially during periods of diversification and extinction. Consideration of what can be ascertained about life and environments of past from fossils of California and rocks that contain them. Letter grading.",
    "corequisites": [
      "EE BIOL 144"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL144L"
  },
  {
    "course_code": "EE BIOL M145",
    "units": 4,
    "title": "Advanced Paleontology",
    "description": "(Same as Earth, Planetary, and Space Sciences M118.) Lecture, three hours. Requisite: course 110 or 117 or Earth, Planetary, and Space Sciences 116. Consideration of major factors that have influenced history of life, including analytical approaches to analyzing patterns in fossil record, nature of rock record, and contribution of data from stable isotopes, functional morphology, phylogenetics, and developmental biology. P/NP or letter grading.",
    "prerequisites": [
      "EE BIOL 110",
      "EE BIOL 117",
      "EPS SCI 116"
    ],
    "cross_listed": [
      "EPS SCI M118"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLM145"
  },
  {
    "course_code": "EE BIOL C146",
    "units": 4,
    "title": "Conservation Genetics",
    "description": "Lecture three hours; discussion, one hour. Requisites: course 150 or Life Sciences 107, Life Sciences 7A, 7B, 7C. Conservation genetics is interdisciplinary field that integrates genetic methods and concepts from population genetics, evolutionary biology, molecular ecology, and systematics to understand how to conserve and manage populations and species of natural organisms, and understand genetic processes underlying why some go extinct. Case studies of plants and animals cover range of topics including habitat loss, population size, and inbreeding depression; landscape change and genetic connectivity of populations; climate change and local adaptation; management of wild and natural populations; and invasive species. Concurrently scheduled with course C246. Letter grading.",
    "prerequisites": [
      "EE BIOL 150",
      "LIFESCI 107",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLC146"
  },
  {
    "course_code": "EE BIOL 147",
    "units": 4,
    "title": "Biological Oceanography",
    "description": "Five-week intensive course. Lecture, five hours; laboratory, 15 hours. Requisites: Chemistry 14A, 14B, and 14BL, or 20A, 20B, 20L, and 30AL, Life Sciences 1, 3, 23L. Lectures include physical, chemical, and biological factors affecting abundance and distribution of organisms in marine environment. Laboratory includes experimental studies of local marine organisms, with emphasis on primary and secondary production and nutrient flux. Letter grading.",
    "prerequisites": [
      "CHEM 14A",
      "CHEM 14B",
      "CHEM 14BL",
      "CHEM 20A",
      "CHEM 20B",
      "CHEM 20L",
      "CHEM 30AL",
      "LIFESCI 1",
      "LIFESCI 3",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL147"
  },
  {
    "course_code": "EE BIOL 148",
    "units": 4,
    "title": "Biology of Marine Plants",
    "description": "Five-week intensive course. Lecture, five hours; laboratory, 15 hours. Requisites: Chemistry 14A, 14B, and 14BL, or 20A, 20B, 20L, and 30AL, Life Sciences 1, 3, and 23L, or 7A, 7B, and 23L. Introduction to general biology of marine algae, including basics of structure reproduction, life histories, systematics, and introduction to physiology and ecology of marine algae. Techniques in culture and laboratory investigation and utilization of algae. Given off campus at marine science center. Letter grading.",
    "prerequisites": [
      "CHEM 14A",
      "CHEM 14B",
      "CHEM 14BL",
      "CHEM 20A",
      "CHEM 20B",
      "CHEM 20L",
      "CHEM 30AL",
      "LIFESCI 1",
      "LIFESCI 3",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL148"
  },
  {
    "course_code": "EE BIOL 149",
    "units": 4,
    "title": "Evolutionary Genomics",
    "description": "Lecture, two hours; laboratory, two hours. Requisites: Life Sciences 7A, 7B, 7C, 23L. Evolutionary genomics is study of variation and changes in genomic sequences due to natural selection pressures. Virtually all organisms on this planet experience evolutionary pressures. Evolutionary pressures act on genomic variation, and in turn can change genomic composition of populations and whole species. Study of how evolutionary forces of mutation, drift, selection, recombination, and migration can change genomes. Analysis of genomic data to make evolutionary inferences. Letter grading.",
    "prerequisites": [
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL149"
  },
  {
    "course_code": "EE BIOL 150",
    "units": 4,
    "title": "Principles of Genetics",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Chemistry 14A or 20A, 14C or 30A, Life Sciences 7A, 7B, 7C, 23L. Genetics in most diverse and inclusive of biological sciences. Fields as divergent as medicine and evolution require understanding of fundamental concepts of heredity as they apply to individuals and populations. Many important social questions require understanding of genetics for informed decision making. Study of foundations of genetics at level expected of all biologists. Students learn basic terminology of field and physical and biochemical basis of various modes of heredity. Students gain understanding of some social implications of various aspects of genetics, and tools necessary to form informed opinions on these issues. Letter grading.",
    "prerequisites": [
      "CHEM 14A",
      "CHEM 20A",
      "CHEM 14C",
      "CHEM 30A",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL150"
  },
  {
    "course_code": "EE BIOL 150L",
    "units": 4,
    "title": "Principles of Genetics Laboratory",
    "description": "Laboratory, four hours. Corequisite: course 150. Genetics is most diverse and most inclusive of biological sciences. Fields as divergent as medicine and evolution require understanding of fundamental concepts of heredity as they apply to individuals and populations, and skills to ask and answer questions using genetic techniques. Letter grading.",
    "corequisites": [
      "EE BIOL 150"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL150L"
  },
  {
    "course_code": "EE BIOL 151A",
    "units": 4,
    "title": "Tropical Ecology",
    "description": "Lecture, one hour; discussion, two hours. Requisite: Life Sciences 1 or 7B. Broad introduction to biodiversity, community structure, and dynamics and ecosystem function of range of tropical forest habitats. Discussion of such themes as biogeography, forest structure, plant growth forms, animal communities, herbivory, forest dynamics, and disturbance regimes. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL151A"
  },
  {
    "course_code": "EE BIOL 151B",
    "units": 8,
    "title": "Field Tropical Ecology",
    "description": "Lecture, three hours; fieldwork, five hours. Requisites: course 100, Life Sciences 1 or 7B. Two weeks of off-campus research projects followed by two-week lecture course and offered only as part of Field Biology Quarter. Introduction to biodiversity, community structure, and dynamics and ecosystem function in tropical forest habitat. Letter grading.",
    "prerequisites": [
      "EE BIOL 100",
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL151B"
  },
  {
    "course_code": "EE BIOL 152",
    "units": 4,
    "title": "World Vegetation Ecology and Ecophysiology",
    "description": "Lecture, three hours; discussion, one hour. Requisite: Life Sciences 1 or 7B. Diversity of physiological and ecological adaptations in biomes of world, explaining distribution and dynamics of world vegetation types. Focus on processes across scales from cells to ecosystem to globe, instrumentation for environmental and ecophysiological measurements, and experiments used to make discoveries about plant adaptation. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL152"
  },
  {
    "course_code": "EE BIOL 153",
    "units": 4,
    "title": "Physics and Chemistry of Biotic Environments",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Chemistry 14A, 14B, and 14BL (or 20A, 20B, and 20L), Life Sciences 1. Recommended: Life Sciences 2, 3, 4, 23L, Physics 6A. Chemical and physical principles that are critical to functional responses by organisms to their habitats. Focus is integrative, providing comprehensive training in basic sciences of physics and chemistry as applied to environmental processes, and consequences of these processes for individual performance, populations, and communities. Covers variety of topics in applied chemistry, including proton pumps, carbonate biogeochemistry and ocean acidification, and allometric scaling of metabolism and effects of temperature on physiological function. Fundamentals of boundary-layer physics and their role in organism’s life history. Physics as natural life process, including how organisms are mechanically structures to avoid, resist, or comply to fluid (air and water) motion. P/NP or letter grading.",
    "prerequisites": [
      "CHEM 14A",
      "CHEM 14B",
      "CHEM 14BL",
      "CHEM 20A",
      "CHEM 20B",
      "CHEM 20L",
      "LIFESCI 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL153"
  },
  {
    "course_code": "EE BIOL 154",
    "units": 5,
    "title": "California Ecosystems",
    "description": "Lecture, three hours; laboratory or field trip, four hours. Requisite: Life Sciences 1 or 7B. Recommended: course 100. Introduction to structure, biodiversity, and dynamics of California ecosystems, with focus on Southern California, and impact of human activities on these systems. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL154"
  },
  {
    "course_code": "EE BIOL 155",
    "units": 4,
    "title": "Community Ecology",
    "description": "Lecture, three hours; discussion, one hour. Requisite: Life Sciences 1 or 7B. Recommended: course 100 or 122. Community ecology is study of biodiversity in ecological context: structure and dynamics of natural species assemblages in space and time, and ecological and evolutionary mechanisms that determine which species are present or absent from particular assemblages. Examination of existing theories of community organization and evidence, both observational and experimental, bearing on these theories. Consideration of diverse array of communities—plant, animal, microbial, terrestrial, and marine—to give appreciation of extraordinary natural history and diversity of life on Earth as it exists in its living ecological context. Discussion of how ecological communities are responding now and will respond in future to anticipated global change, and conservation implications of these changes. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL155"
  },
  {
    "course_code": "EE BIOL 156",
    "units": 4,
    "title": "Biology and Social Justice",
    "description": "Lecture, four hours. Consideration of intersection of biological discovery and human society to better understand how scientific advances have both promoted and mitigated social inequality. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL156"
  },
  {
    "course_code": "EE BIOL M157",
    "units": 4,
    "title": "Biology of Superheroes: Exploring Limits of Form and Function",
    "description": "(Same as Society and Genetics M157.) Lecture, four hours; discussion, one hour. Requisites: Life Sciences 1 and 4, or 7A and 7B. Combines topics posed in popular graphic novels, movies, and television with primary scientific literature to explore bizarre phenomena in natural world and delve into basic scientific theory and principles. Topics covered include evolution, genetics, physiology, biomechanics, brain-machine interfacing, and artificial intelligence among others. Students synthesize primary literature on diverse subjects presented. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 4",
      "LIFESCI 7A",
      "LIFESCI 7B"
    ],
    "cross_listed": [
      "SOC GEN M157"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLM157"
  },
  {
    "course_code": "EE BIOL 158",
    "units": 5,
    "title": "Introduction to Diversity, Health Disparities, and Environment",
    "description": "Lecture, three hours; discussion, one hour. Requisite: Life Sciences 7B. Exploration of how environmental and social conditions can combine and lead to disproportionate negative health outcomes in disadvantaged communities. Exploration of the ways in which people are working to understand and remedy these issues. Introduction to environmental drivers of health disparities. Exposure to the diversity of careers and career trajectories of individuals (clinicians, researchers, public health officials, etc.) focused on promoting health equity, at times by addressing problems in the environments where different communities live and work. Letter grading.",
    "prerequisites": [
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL158"
  },
  {
    "course_code": "EE BIOL M159",
    "units": 5,
    "title": "Biological Modeling: Mathematical and Computational Approaches",
    "description": "(Same as Computational and Systems Biology M150.) Lecture, four hours; laboratory, three hours. Requisites: Life Sciences 7A, 7B, 7C, Mathematics 33A and 33B, with grades of C or better. Recommended Requisites: Physics 1A, 1B, and 1C, or 5A, 5B, and 5C, with grades of C or better. Students learn how to translate their biological knowledge and intuition into mathematical equations and computer simulations, and how to interpret and glean biological insights from quantitative results and predictions. Review and integration of core mathematical and computational approaches in novel ways. Students gain experience translating and intuition about systems through many examples across range of biological levels, such as predator-prey, disease transmission, cancer initiation, cell migration, neural systems, vascular networks, sleep, drug interactions, gene expression, and more. Students learn how to manipulate data, basics of coding, and how to instantiate their mathematical models and biological intuition through numerical solutions and simulations. Letter grading.",
    "prerequisites": [
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "MATH 33A",
      "MATH 33B"
    ],
    "cross_listed": [
      "C&S BIO M150"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLM159"
  },
  {
    "course_code": "EE BIOL 160",
    "units": 4,
    "title": "Introduction to Plant Biology",
    "description": "Lecture, three hours; discussion, one hour. Not open for credit to students with credit for course 162. Introduction to aspects of plant biology. Topics include plant body, reproduction, plant diversity, gene expression, and basic plant function. Letter grading.",
    "credit_exclusions": [
      "EE BIOL 162"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL160"
  },
  {
    "course_code": "EE BIOL 161",
    "units": 4,
    "title": "Plant Ecology",
    "description": "Lecture, two and one half hours; discussion, one hour. Requisite: Life Sciences 1 or 7B. Introduction to ecology of terrestrial plants, covering individuals, populations, communities, and global processes. Topics include plant form and function, seed dormancy and population dynamics, life histories, disturbance and succession, community structure and dynamics, and global change. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL161"
  },
  {
    "course_code": "EE BIOL 161L",
    "units": 4,
    "title": "Plant Ecology Laboratory",
    "description": "Laboratory, four hours. Requisites: course 161 (may be taken concurrently), Life Sciences 7B. Introduction to foundational principles, theory, and field application of ecology. Emphasis on ecology of terrestrial plants, use of these principles to predict consequences, and uncertainties associated with human-caused changes in environment. Examination of both biotic and abiotic elements of environment that influence distribution and abundance of plant species. Includes range of activities, from observations of plant materials in laboratory and in UCLA botanical garden, to manipulative greenhouse experiments with fast growing annual plants, to computer-based explorations of dynamics of foundational ecological models. Letter grading.",
    "prerequisites": [
      "EE BIOL 161",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL161L"
  },
  {
    "course_code": "EE BIOL 162",
    "units": 4,
    "title": "Plant Physiology",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Life Sciences 1, 2, 3, and 23L, or 7A, 7B, 7C, and 23L. Basic aspects of plant function, including photochemical, biochemical, and physiological aspects of photosynthesis. Carbon and nitrogen metabolism and its regulation; organellar interactions and compartmentation. Water relations, ion transport, flowering, hormone action, and plant responses to stress. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 2",
      "LIFESCI 3",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL162"
  },
  {
    "course_code": "EE BIOL 162L",
    "units": 4,
    "title": "Plant Physiology and Ecophysiology Laboratory",
    "description": "Laboratory, 12 hours. Requisites: course 152 or 162 (may be taken concurrently), Life Sciences 1, 2, 3, and 23L, or 7A, 7B, 7C, and 23L. Focus on whole-plant physiology and ecophysiology from biochemical and molecular processes to whole-plant function and field performance to gain understanding and appreciation of plant function, including dynamic processes of growth, development, and reproduction. Exercises provide training in approaches and instrumentation such that students become scientists, applying physiological techniques to answer questions on plant function, including use of programs such as FunAnatomy (plant anatomy) and FastPlant (growing experiment). To apply this course to the Biology upper-division major laboratory requirement, the corresponding lecture course must be completed with a passing grade. Letter grading.",
    "prerequisites": [
      "EE BIOL 152",
      "EE BIOL 162",
      "LIFESCI 1",
      "LIFESCI 2",
      "LIFESCI 3",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL162L"
  },
  {
    "course_code": "EE BIOL 163",
    "units": 4,
    "title": "Biology of Marine Tetrapods",
    "description": "Lecture, five hours; laboratory and fieldwork, 15 hours. Requisites: Chemistry 14A, 14B, and 14BL, or 20A, 20B, 20L, and 30AL, Life Sciences 1, 3, and 23L, or 7A, 7B, and 23L. Highly recommended: course 111. Five-week intensive course offered only as part of Marine Biology Quarter. Survey of higher vertebrates living in marine habitats, including estuarine amphibians, marine reptiles, seabirds, and marine mammals. Laboratory emphasizes observational and experimental approaches to study of morphology, systematics, ecology, and behavior of local marine birds and mammals. Given off campus at marine science center. Letter grading.",
    "prerequisites": [
      "CHEM 14A",
      "CHEM 14B",
      "CHEM 14BL",
      "CHEM 20A",
      "CHEM 20B",
      "CHEM 20L",
      "CHEM 30AL",
      "LIFESCI 1",
      "LIFESCI 3",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL163"
  },
  {
    "course_code": "EE BIOL 164",
    "units": 4,
    "title": "Field Biology of Marine Fishes",
    "description": "Lecture, five hours; laboratory, 15 hours. Requisite: Life Sciences 1. Recommended: Mathematics 3A, 3B, 3C. Five-week intensive course offered only as part of Marine Biology Quarter. Selected aspects of natural history, ecology, and behavior of diverse assemblage of local marine fishes. Fieldwork strongly emphasized. Given off campus at marine science center. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL164"
  },
  {
    "course_code": "EE BIOL 165",
    "units": 4,
    "title": "Ecological Physiology of Marine Vertebrates",
    "description": "Lecture, five hours; laboratory, 15 hours. Requisites: Chemistry 14B and 14BL, or 20B and 30AL, Life Sciences 1, 3, 23L. Recommended: Life Sciences 30B or Mathematics 3C or 32A, and Physics 1C and 4BL, or 6C or 6CH. Five-week intensive course offered only as part of Marine Biology Quarter. Introduction to physiological adaptations of marine vertebrates to major physicochemical variables in world oceans and to major marine habitats. Given off campus at marine science center. Letter grading.",
    "prerequisites": [
      "CHEM 14B",
      "CHEM 14BL",
      "CHEM 20B",
      "CHEM 30AL",
      "LIFESCI 1",
      "LIFESCI 3",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL165"
  },
  {
    "course_code": "EE BIOL 166",
    "units": 4,
    "title": "Biology of Marine-Land Interface",
    "description": "Lecture, five hours; fieldwork, 15 hours. Enforced requisites: courses 109, 109L, Chemistry 14A, 14B, 14BL (or 20A, 20B, 20L), Life Sciences 1, Physics 6A, Statistics 13. Recommended: Life Sciences 2, 3, 4. Land-sea interface is one of most biologically rich, yet challenging habitats on Earth. Organisms must contend with wide range of environmental conditions, including extreme variations in temperature, oxygen, pH, ultraviolet radiation, osmotic stress, and water availability. These habitats are among best natural laboratories for investigating patterns and processes of organism-environment interactions. Basic training in characterization of physical and chemical environmental features to establish basic tenets of organismal performance, as well as population and community dynamics in response to extreme environmental challenges. Foraging of critical new linkages between chemistry, physics, and biology through lecture, laboratory, and field investigations. Offered as part of Marine Biology Quarter. Letter grading.",
    "prerequisites": [
      "EE BIOL 109",
      "EE BIOL 109L",
      "CHEM 14A",
      "CHEM 14B",
      "CHEM 14BL",
      "CHEM 20A",
      "CHEM 20B",
      "CHEM 20L",
      "LIFESCI 1",
      "PHYSICS 6A",
      "STATS 13"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL166"
  },
  {
    "course_code": "EE BIOL 167",
    "units": 4,
    "title": "Natural History Collections in Biological Sciences",
    "description": "Lecture, two and one half hours; discussion, one hour. Requisite: Life Sciences 7B. Consideration of how natural history collections play vital role in research, learning, and engagement. Topics include history of museum collections; history of naming species; collection curation; collections-based research; decolonization and diversity, equity, accessibility, and inclusion practices; and education and outreach using museum collections. Students learn to curate collections and gain understanding of how collections are used for education, outreach, and research. Letter grading.",
    "prerequisites": [
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL167"
  },
  {
    "course_code": "EE BIOL 167L",
    "units": 4,
    "title": "Natural History Collections in Biological Sciences Laboratory",
    "description": "Lecture, two and one half hours; discussion, one hour. Requisite: course 167 (may be taken concurrently). Consideration of how natural history collections play vital role in research, learning, and engagement. Topics include history of museum collections; history of naming species; collection curation; collections-based research; decolonization and diversity, equity, accessibility, and inclusion practices; and education and outreach using museum collections. Students learn to curate collections and gain understanding of how collections are used for education, outreach, and research. Culminates in final project, where students synthesize and implement their knowledge to produce educational, outreach, or research product using specimens from museum. Letter grading.",
    "prerequisites": [
      "EE BIOL 167"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL167L"
  },
  {
    "course_code": "EE BIOL 168",
    "units": 4,
    "title": "Global Change Ecology",
    "description": "Lecture, three hours; discussion, one hour. Exploration of physical climate system and its variability, carbon cycle and related biogeochemistry and ecosystem processes, land-use change, urbanization, and interactions among ecosystems, climate, biogeochemistry, and impact of global change on societally relevant issues and concerns. Global change ecology is field at interface between ecological systems and all aspects of environmental change that affects substantial part of globe. Focus on use of observations and models, consideration of multiple scales of change (temporal and spatial), interaction of human behaviors and choices with natural systems, and linkages across different aspects of global change science. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL168"
  },
  {
    "course_code": "EE BIOL 169",
    "units": 4,
    "title": "Biology of Bats: The True Superheroes",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: Life Sciences 7B. Comprising 20 percent of all mammals and inhabiting all but one continent, bats are the only mammals capable of powered flight. Bats can also echolocate, hibernate, live longer than humans, and harbor viruses but not get sick. This allows bats to be reservoirs for many viruses that can cause zoonotic diseases in humans, including Ebola and SARS-CoV-2, the virus that causes COVID-19. Exploration of evolution, anatomy, physiology, immunology, longevity, and conservation of bats. Focus on how scientists use bats as model system to address key questions in ecology, evolution, and human health. Letter grading.",
    "prerequisites": [
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL169"
  },
  {
    "course_code": "EE BIOL 170",
    "units": 6,
    "title": "Animal Environmental Physiology",
    "description": "Lecture, three hours; laboratory, six hours. Requisites: Chemistry 14D, or 30B and 30BL, Life Sciences 1, 2, 3, 4, and 23L, or Life Sciences 7A, 7B, 7C, and 23L, 30B or Mathematics 3C or 32A, Physics 1C and 4BL, or 5B or 6C or 6CH. Not open for credit to students with credit for Physiological Science 166. Designed for Ecology, Behavior, and Evolution majors. Introduction to physiology (function) of animal organs and organ systems, with emphasis on environmental interactions and ecological adaptations. Letter grading.",
    "prerequisites": [
      "CHEM 14D",
      "CHEM 30B",
      "CHEM 30BL",
      "LIFESCI 1",
      "LIFESCI 2",
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 30B",
      "MATH 3C",
      "MATH 32A",
      "PHYSICS 1C",
      "PHYSICS 4BL",
      "PHYSICS 5B",
      "PHYSICS 6C",
      "PHYSICS 6CH"
    ],
    "credit_exclusions": [
      "PHYSCI 166"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL170"
  },
  {
    "course_code": "EE BIOL 171",
    "units": 4,
    "title": "Coming of Age on Planet Earth",
    "description": "Lecture, three hours; discussion, one hour. Across phylogenetically broad range of species, individuals in same developmental stage of life share vulnerabilities and similar challenges. Exploration of shared challenges facing animals as they transition from juveniles to mature adults through integration of behavioral ecology, neuroscience, life history theory, and phylogenetic modeling. Emphasis on life history theory, phylogenetic analyses, and development of testable hypotheses. Students gain understanding of how Tinbergean framework can be applied to understanding developmental characteristics; ability to conceive of and perform formal systematic review; skills necessary to create and interpret phylogenies; and framework for applying lenses of behavioral ecology, neuroscience, and evolutionary biology to better understand coming of age on planet Earth. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL171"
  },
  {
    "course_code": "EE BIOL C172",
    "units": 4,
    "title": "Advanced Statistics in Ecology and Evolutionary Biology",
    "description": "Lecture, two hours; laboratory, two hours. Enforced Requisite: Life Sciences 40 or Statistics 10 or 13. Overview of and application of advanced statistical methods that go beyond linear models and mean comparison, including bootstrapping, permutations, Bayesian statistics, mixed models, clustering, and network analysis. At course end students should be able to explain which statistical approaches are appropriate for different types of research questions and critically evaluate their outputs. All statistical analysis conducted in R. Concurrently scheduled with course C202. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 40",
      "STATS 10",
      "STATS 13"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLC172"
  },
  {
    "course_code": "EE BIOL CM173",
    "units": 6,
    "title": "Earth Process and Evolutionary History",
    "description": "(Same as Earth, Planetary, and Space Sciences CM173.) Lecture, four hours; laboratory, three hours. Requisites: Chemistry 14A, 14B (or 20A, 20B), Life Sciences 1, 2, 3, and 4, or 7A, 7B, and 7C (or 7A and introductory course in geology). Exploration of relationship between physical processes, such as tectonics and climate, and how they affect surface and impact biology of Earth. Study of evolution of universe, Earth, and life, with integration of history of science, including Darwinian evolution and plate tectonics revolutions. Study of formation of matter offers tools to understand geologic process of climate and ecology of Earth. Past climate change to examine expected future human-influenced climate. Consideration of major events in history of life on Earth. Data and methods from geology, genetics, and geochemistry are integrated to reconstruct past events. This reveals how Earth processes shaped life and how life shaped Earth. Concurrently scheduled with course CM228. Letter grading.",
    "prerequisites": [
      "CHEM 14A",
      "CHEM 14B",
      "CHEM 20A",
      "CHEM 20B",
      "LIFESCI 1",
      "LIFESCI 2",
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 7A"
    ],
    "cross_listed": [
      "EPS SCI CM173"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLCM173"
  },
  {
    "course_code": "EE BIOL C174",
    "units": 4,
    "title": "Comparative Biology and Macroevolution",
    "description": "Lecture, three hours; laboratory, three hours. Requisite: Life Sciences 1 or 7B. Recommended: one introductory statistics course. Modern comparative biology provides framework for studying broad questions in evolution—How do body shapes evolve? What are dynamics of evolutionary arms race? Why are there so many species in tropics? Why are there so many beetles and so few crocodiles? Did dinosaurs put brakes on diversification of mammals? Examination of why tree of life is essential to understanding patterns of biological diversity and how phylogenetic comparative methods are used to test macroevolutionary hypotheses. Concurrently scheduled with course C230. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLC174"
  },
  {
    "course_code": "EE BIOL 175",
    "units": 4,
    "title": "Evolutionary Dynamics of Sex",
    "description": "Lecture, three hours; discussion, one hour. Requisite: Life Sciences 1 or 7B. Fitness dynamics of reproduction when females and males are in conflict over reproductive decisions, with focus on animals with human examples as appropriate. Emphasis on natural selection thinking, sexual selection, and origins of sexual conflict, including Fisherian sex allocation, evolution of manipulation through deceptive communication, and theory of Darwinian sexual conflict. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL175"
  },
  {
    "course_code": "EE BIOL 176",
    "units": 4,
    "title": "Ecological Ethics",
    "description": "Seminar, four hours. Requisite: Life Sciences 1 or 7B. Debates and discussions on current ethical considerations relevant to fields of ecology, evolution, conservation, and behavior. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL176"
  },
  {
    "course_code": "EE BIOL C177",
    "units": 4,
    "title": "Practical Computing for Evolutionary Biologists and Ecologists",
    "description": "Lecture, three hours; laboratory, two hours. Requisite: Life Sciences 1 or 7B. Introduction to fundamental skills needed for manipulation, analysis, and visualization of large data sets. Basic programming and scripting in Python as well as working in shell, regular expressions, and related topics. Concurrently scheduled with course C234. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLC177"
  },
  {
    "course_code": "EE BIOL M178",
    "units": 5,
    "title": "Computational Systems Biology: Modeling and Simulation of Biological Systems",
    "description": "(Same as Bioengineering CM186, Computational and Systems Biology M186, and Computer Science CM186.) Lecture, four hours; laboratory, two hours; discussion, one hour. Requisites: Life Sciences 30A, 30B, Mathematics 32A or M32T, 33A, and 33B; or Mathematics 31A, 31B, 32A or M32T, 33A, and 33B. Dynamic biosystem modeling and computer simulation methods for studying biological/biomedical processes and systems at multiple levels of organization. Intermediate linear and nonlinear control system, multicompartmental, epidemiological, pharmacokinetic, and other biomodeling methods applied to life sciences problems at molecular, cellular, organ, and population levels. Both theory- and data-driven modeling, with focus on translating biomodeling goals and data into dynamical mathematical models, and implementing them for simulation, quantification, and analysis. Numerical simulation, optimization, and parameter identifiability and search algorithms, with model discrimination and analysis and software exercises in PC laboratory assignments. Letter grading.",
    "prerequisites": [
      "LIFESCI 30A",
      "LIFESCI 30B",
      "MATH 32A",
      "MATH M32T",
      "MATH 33A",
      "MATH 33B"
    ],
    "cross_listed": [
      "C&S BIO M186",
      "COM SCI CM186",
      "BIOENGR CM186"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLM178"
  },
  {
    "course_code": "EE BIOL C179",
    "units": 4,
    "title": "Communicating Science to Informal Audiences",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 158, 187. Science communication is essential skill for advancing scientific research and society. Students work collaboratively to communicate results of original research using formal (e.g., written paper and poster/multimedia presentation) and/or informal (e.g., video, brochure, digital media, etc.) forms of science communication. Students also create reflective communication piece (written, podcast, video) about what they learned through process of research that could be shared with broad audience. Concurrently scheduled with course C237. Letter grading.",
    "prerequisites": [
      "EE BIOL 158",
      "EE BIOL 187"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOLC179"
  },
  {
    "course_code": "EE BIOL 180A",
    "units": 2,
    "title": "Seminar: Biology and Society",
    "description": "Seminar, two hours. Investigations and discussions of current socially important issues involving substantial biological considerations, either or both as background for policy and as consequences of policy. May be repeated once for credit with instructor change. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL180A"
  },
  {
    "course_code": "EE BIOL 180B",
    "units": 4,
    "title": "Seminar: Biology and Society",
    "description": "Seminar, four hours. Investigations and discussions of current socially important issues involving substantial biological considerations, either or both as background for policy and as consequences of policy. May be repeated once for credit with instructor change. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL180B"
  },
  {
    "course_code": "EE BIOL 181",
    "units": 6,
    "title": "Parasitology",
    "description": "Lecture, three hours; laboratory, six hours. Requisites: Life Sciences 1, 3, and 23L, or 7A, 7B, and 23L. Introduction to principles, biology, and evolution of infectiousness, symbiosis, and parasitism, emphasizing protozoan and helminth parasites, including those of man. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 3",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL181"
  },
  {
    "course_code": "EE BIOL 182",
    "units": 4,
    "title": "Marine Parasitology",
    "description": "Lecture, five hours; laboratory, 15 hours. Requisite: Life Sciences 1 or 7B. Recommended: courses 112, 181. Five-week intensive course offered only as part of Marine Biology Quarter. Introduction to natural history and ecology of host-parasite interaction involving intertidal fish hosts. Laboratory includes collection and preparation techniques. Given off-campus at marine science center. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL182"
  },
  {
    "course_code": "EE BIOL 183",
    "units": 4,
    "title": "Finding Ecological Solutions to Environmental Problems",
    "description": "Seminar, two hours; discussion, two and one half hours. Requisite: course 100. Ecological practicum in which students work in teams with client (e.g., non-profit, governmental) to research and propose solutions to diverse ecological problems. Students learn practical skills to apply ecological science to solving of diverse and interdisciplinary environmental problems, in intimate and participatory environment. Students learn and are expected to produce high-quality academic work at professional level. Letter grading.",
    "prerequisites": [
      "EE BIOL 100"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL183"
  },
  {
    "course_code": "EE BIOL 184",
    "units": 4,
    "title": "Evolution, Development, and Disease",
    "description": "Lecture, three hours; discussion, one hour. Requisite: Life Sciences 7B. Recommended requisite: course 103, 110, 120, M157, C174, or 185. Exploration of developmental mechanisms underlying evolution of animal design, including impacts of environment on these mechanisms. Exploration of what happens to animal form, including that of humans, when these developmental mechanisms are disrupted by environmental and genetic factors. Letter grading.",
    "prerequisites": [
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL184"
  },
  {
    "course_code": "EE BIOL 185",
    "units": 4,
    "title": "Evolutionary Medicine",
    "description": "Lecture, two and one half hours; discussion, one hour. Requisite: Life Sciences 1 or 7B. Not open for credit to students with credit for course 120. Designed for departmental majors specializing in environmental and population biology and in medicine. Introduction to mechanics and processes of evolution, with emphasis on natural selection, population genetics, speciation, evolutionary rates, and patterns of adaptation. Coverage of fundamental principles of evolution, with special focus on medicine and human health. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 7B"
    ],
    "credit_exclusions": [
      "EE BIOL 120"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL185"
  },
  {
    "course_code": "EE BIOL 186",
    "units": 4,
    "title": "Evolutionary Medicine: Clinical Perspective on Medical, Surgical, and Psychiatric Disorders",
    "description": "Lecture, three hours; discussion, one hour. From breast cancer and heart failure to self-injury, obsessive-compulsive and eating disorders, all contemporary medical issues have evolutionary roots. Understanding of application of evolutionary thought to issues faced by physicians, veterinarians, psychologists, and other healthcare providers. Development of awareness and understanding of evolutionary roots of these disorders provides future healthcare providers with expanded perspective that enhances their practice and benefits their patients in whatever field they enter. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL186"
  },
  {
    "course_code": "EE BIOL 187",
    "units": 4,
    "title": "Variable Topics in Ecology and Evolutionary Biology",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Life Sciences 1, 2, 3, 4, and 23L, or 7A, 7B, 7C, and 23L. Investigation, discussion, and study of current important issues involving substantial biological considerations in ecology and evolutionary biology. Contact Undergraduate Advising Office for current topics. May be repeated for credit. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 2",
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL187"
  },
  {
    "course_code": "EE BIOL 188",
    "units": 2,
    "title": "Special Courses in Ecology and Evolutionary Biology",
    "description": "Seminar, two hours. Departmentally sponsored experimental or temporary courses, such as those taught by visiting faculty members. May be repeated for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL188"
  },
  {
    "course_code": "EE BIOL 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL188SA"
  },
  {
    "course_code": "EE BIOL 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "EE BIOL 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL188SB"
  },
  {
    "course_code": "EE BIOL 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "EE BIOL 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL188SC"
  },
  {
    "course_code": "EE BIOL 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL189"
  },
  {
    "course_code": "EE BIOL 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL189HC"
  },
  {
    "course_code": "EE BIOL 190",
    "units": 1,
    "title": "Research Colloquia in Ecology and Evolutionary Biology",
    "description": "Seminar, one hour. Designed to bring together students undertaking supervised tutorial research in seminar setting with one or more faculty members to discuss their own work or related work in discipline. Led by one supervising faculty member. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL190"
  },
  {
    "course_code": "EE BIOL 191",
    "units": 4,
    "title": "Variable Topics Research Seminars: Ecology and Evolutionary Biology",
    "description": "Seminar, three hours. Seminars on current issues in research in ecology and evolutionary biology. Consult Schedule of Classes for topics and instructors. If content is approved in advance by Undergraduate Advising Office, undergraduate departmental majors may petition to use course to satisfy or partially satisfy elective requirement. May be repeated for credit with consent of instructor. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL191"
  },
  {
    "course_code": "EE BIOL 192A",
    "units": 4,
    "title": "Undergraduate Assistant in Ecology and Evolutionary Biology",
    "description": "Seminar, 12 hours. Limited to juniors/seniors. Training and supervised practicum for advanced undergraduate students in assisting with courses related to biology. Students assist in preparation of materials and development of innovative programs with guidance of faculty members in small course settings. Consult Undergraduate Advising Office for further information. May not be applied toward course requirements for departmental majors. May be repeated for credit. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL192A"
  },
  {
    "course_code": "EE BIOL 192B",
    "units": 2,
    "title": "Undergraduate Assistant in Ecology and Evolutionary Biology",
    "description": "Seminar, six hours. Limited to juniors/seniors. Training and supervised practicum for advanced undergraduate students in assisting with courses related to biology. Students assist in preparation of materials and development of innovative programs with guidance of faculty members in small course settings. Consult Undergraduate Advising Office for further information. May not be applied toward course requirements for departmental majors. May be repeated for credit. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL192B"
  },
  {
    "course_code": "EE BIOL 193",
    "units": 1,
    "title": "Journal Club Seminars: Ecology and Evolutionary Biology",
    "description": "Seminar, two hours. Enforced corequisite: one course from 198A through 198D or 199. Limited to undergraduate students. Development of in-depth understanding of and ability to discuss current literature in field of students’ own research. May be repeated for credit. P/NP grading.",
    "corequisites": [
      "EE BIOL 198A",
      "EE BIOL 198D",
      "EE BIOL 199"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL193"
  },
  {
    "course_code": "EE BIOL 194A",
    "units": 2,
    "title": "Research Group or Internship Seminars: Access to Research Careers",
    "description": "Seminar, six hours. Designed for juniors/seniors in research traineeships or those who have strong commitment to pursue graduate studies in molecular, biochemical, physiological, or biomedical fields. Weekly presentation and discussion of paper selected from current literature. No more than 4 units may be applied toward departmental majors. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL194A"
  },
  {
    "course_code": "EE BIOL 194B",
    "units": 1,
    "title": "Research Group or Internship Seminars: Ecology and Evolutionary Biology",
    "description": "Seminar, two hours. Corequisite: one course from 198A through 198D or 199. Designed to encourage participation and stimulate progress in specific research areas for undergraduate students who are part of departmental research group or internship. Discussion of use of specific research methods and current literature in field or of research of faculty members or students. May be repeated for credit. P/NP or letter grading.",
    "prerequisites": [
      "EE BIOL 198A",
      "EE BIOL 198D",
      "EE BIOL 199"
    ],
    "corequisites": [
      "EE BIOL 198A",
      "EE BIOL 198D",
      "EE BIOL 199"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL194B"
  },
  {
    "course_code": "EE BIOL 195",
    "units": 4,
    "title": "Community or Corporate Internships in Ecology and Evolutionary Biology",
    "description": "Tutorial, 12 hours. Internship course for juniors/seniors to be supervised by Center for Community Learning, fieldwork site, and faculty adviser. Consult Undergraduate Advising Office for more information. Students meet on regular basis with instructor and provide periodic reports of their experience. May not be applied toward requirements for departmental majors. May be repeated twice for credit. Individual contract with supervising faculty member required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL195"
  },
  {
    "course_code": "EE BIOL 196",
    "units": 2,
    "title": "Research Apprenticeship in Ecology and Evolutionary Biology",
    "description": "Tutorial, three hours per week per unit. Limited to juniors/seniors. Entry-level research apprenticeship for upper-division students under guidance of faculty mentor. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL196"
  },
  {
    "course_code": "EE BIOL 198A",
    "units": 4,
    "title": "Honors Research in Ecology and Evolutionary Biology",
    "description": "Tutorial, 12 hours. Limited to juniors/seniors. Supervised individual research designed to broaden and deepen students’ knowledge of some phase of biology. Must be taken with Ecology and Evolutionary Biology Department faculty for at least two terms and for total of at least 8 units. Eight units may be applied toward departmental majors. Individual contract required. In Progress grading (credit to be given only on completion of course 198B). Students may elect to enroll in additional research through courses 198C and 198D (letter grading). Report on progress must be presented to undergraduate adviser each term 198 course is taken.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL198A"
  },
  {
    "course_code": "EE BIOL 198B",
    "units": 4,
    "title": "Honors Research in Ecology and Evolutionary Biology",
    "description": "Tutorial, 12 hours. Limited to juniors/seniors. Supervised individual research designed to broaden and deepen students’ knowledge of some phase of biology. Must be taken with Ecology and Evolutionary Biology Department faculty for at least two terms and for total of at least 8 units. Eight units may be applied toward departmental majors. Individual contract required. Letter grading. Students may elect to enroll in additional research through courses 198C and 198D (letter grading). Report on progress must be presented to undergraduate adviser each term 198 course is taken.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL198B"
  },
  {
    "course_code": "EE BIOL 198C",
    "units": 4,
    "title": "Honors Research in Ecology and Evolutionary Biology",
    "description": "Tutorial, 12 hours. Limited to juniors/seniors. Supervised individual research designed to broaden and deepen students’ knowledge of some phase of biology. Must be taken with Ecology and Evolutionary Biology Department faculty for at least two terms and for total of at least 8 units. Eight units may be applied toward departmental majors. Students may elect to enroll in additional research through courses 198C and 198D. Report on progress must be presented to undergraduate adviser each term 198 course is taken. Individual contract required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL198C"
  },
  {
    "course_code": "EE BIOL 198D",
    "units": 4,
    "title": "Honors Research in Ecology and Evolutionary Biology",
    "description": "Tutorial, 12 hours. Limited to juniors/seniors. Supervised individual research designed to broaden and deepen students’ knowledge of some phase of biology. Must be taken with Ecology and Evolutionary Biology Department faculty for at least two terms and for total of at least 8 units. Eight units may be applied toward departmental majors. Students may elect to enroll in additional research through courses 198C and 198D. Report on progress must be presented to undergraduate adviser each term 198 course is taken. Individual contract required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL198D"
  },
  {
    "course_code": "EE BIOL 199",
    "units": 2,
    "title": "Directed Research in Ecology and Evolutionary Biology",
    "description": "Tutorial, six to 12 hours. Preparation: submission of written proposal outlining study or research to be undertaken. Studies to involve laboratory or field-related research, not literature surveys or library research. Proposal to be developed in consultation with instructor and submitted for approval to undergraduate adviser before day instruction begins in that term. Limited to juniors/seniors. Supervised individual research under guidance of faculty mentor. At end of term culminating report describing progress of study or research and signed by student and instructor must be presented to undergraduate adviser. Only one 199 course may be applied toward departmental majors. May be repeated for credit. Individual contract required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/EEBIOL199"
  }
]