[
  {
    "course_code": "GENDER 10",
    "units": 5,
    "title": "Introduction to Gender Studies",
    "description": "Lecture, three hours; discussion, one hour. Introduction to key concepts in study of sex and gender. Exploration of topics such as gender socialization, body image, sexualities, masculinities, and women’s subordination. Special emphasis on interaction of gender with other identity markers such as race, nation, ethnicity, sexuality, class, and other differences. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER10"
  },
  {
    "course_code": "GENDER 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER19"
  },
  {
    "course_code": "GENDER 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER89"
  },
  {
    "course_code": "GENDER 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER89HC"
  },
  {
    "course_code": "GENDER 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER99"
  },
  {
    "course_code": "GENDER 101W",
    "units": 5,
    "title": "Writing Gender",
    "description": "Lecture, three hours. Requisite: English Composition 3. Development of critical reading and writing skills necessary for academic success. Students engage assigned readings in conversation with week’s leading question. Generation and continuous development of paper topic as result of in-class discussions and formal writing exercises. Small writing groups assist students in understanding relationship between how written thoughts are presented and how they are comprehended by different readers. Students gain understanding of writing process, including topic conceptualization, objective of writing project, organization of thoughts and resources, selection of objects of study, personal writing style, etc. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER101W"
  },
  {
    "course_code": "GENDER 102",
    "units": 4,
    "title": "Power",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Enforced requisite: course 10. Consideration of how feminist social movements have identified and challenged gender-based subordination and ways feminist theorists have conceived and critiqued traditional theories of power. How have women’s and other social movements defined and challenged social, political, and economic subordination? How have feminist theorists addressed subject of power? How do empire, colonialism, liberalism, neoliberalism, and globalization produce distinctive forms of gendered violence, gendered knowledge, and gendered subjectivities? How are gender and sexuality produced and regulated by law, nation, and economy? P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER102"
  },
  {
    "course_code": "GENDER 103",
    "units": 4,
    "title": "Knowledge",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Enforced requisite: course 10. Exploration of social production of knowledge about gendered subjects and gender systems. Students engage key issues in feminist theory and feminist epistemology. How do feminist scholars identify and frame research questions? How is knowledge about marginalized subjects produced? How has feminism challenged dominant understandings of knowledge, rationality, objectivity, and scientific method? How have social movements sought to challenge traditional modes of knowledge production? P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER103"
  },
  {
    "course_code": "GENDER 104",
    "units": 4,
    "title": "Bodies",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Enforced requisite: course 10. Exploration of scholarly theories and histories of body, with focus on topics such as sex identities, sexuality, gendered violence, and reproductive politics. How has science, medicine, and culture sought to distinguish male from female in different historical periods and locations? How have meanings of terms sex and gender varied across time and place? How has gendered body been represented in different visual cultures? How have embodied identities been produced in different historical and geographic contexts? What is relationship between embodiment and desire? P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER104"
  },
  {
    "course_code": "GENDER M104C",
    "units": 4,
    "title": "Diversity in Aging: Roles of Gender and Ethnicity",
    "description": "(Same as Chicana/o and Central American Studies M106B, Gerontology M104C, Public Affairs M131, and Social Welfare M104C.) Lecture, four hours. Exploration of complexity of variables related to diversity of aging population and variability in aging process. Examination of gender and ethnicity within context of both physical and social aging, in multidisciplinary perspective utilizing faculty from variety of fields to address issues of diversity. Letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "PUB AFF M131",
      "CCAS M106B",
      "SOC WLF M104C",
      "GRNTLGY M104C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM104C"
  },
  {
    "course_code": "GENDER 105",
    "units": 4,
    "title": "Topics in Women and Medicine",
    "description": "Lecture/discussion, three hours. Examination of medical conditions of women in context of issues that impact women’s health, healthcare, and healthcare providers. Discussion of basic health concepts and self-care; consideration of a women’s health speciality and ways to deliver healthcare to women. Exploration of roles and lifestyles of female physicians. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER105"
  },
  {
    "course_code": "GENDER M105A",
    "units": 5,
    "title": "Premodern Queer Literatures and Cultures",
    "description": "(Same as English M101A and Lesbian, Gay, Bisexual, Transgender, and Queer Studies M101A.) Lecture, four hours; discussion, one hour (when scheduled). Enforced requisite: English Composition 3. Survey of discrete period of queer literature from beginning to circa 1850. Works by such writers as Sappho, Plato, Marlowe, Shakespeare, and Thomas Gray may be included. May be repeated for credit with topic or instructor change. P/NP or letter grading.",
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "cross_listed": [
      "ENGL M101A",
      "LGBTQS M101A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM105A"
  },
  {
    "course_code": "GENDER M105B",
    "units": 5,
    "title": "Queer Literatures and Cultures, 1850 to 1970",
    "description": "(Same as English M101B and Lesbian, Gay, Bisexual, Transgender, and Queer Studies M101B.) Lecture, four hours; discussion, one hour (when scheduled). Enforced requisite: English Composition 3. Survey of discrete period of queer literature and culture from circa 1850 to 1970. Works by such authors as Walt Whitman, Radclyffe Hall, Gertrude Stein, Virginia Woolf, Langston Hughes, Tennessee Williams, Henry Blake Fuller, and James Baldwin may be included. May be repeated for credit with topic or instructor change. P/NP or letter grading.",
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "cross_listed": [
      "LGBTQS M101B",
      "Queer Literatures and Cultures, 1850",
      "Queer Literatures and Cultures, 1970",
      "ENGL M101B",
      "Queer Literatures and Cultures, 1850",
      "Queer Literatures and Cultures, 1970"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM105B"
  },
  {
    "course_code": "GENDER M105C",
    "units": 5,
    "title": "Queer Literatures and Cultures after 1970",
    "description": "(Same as English M101C and Lesbian, Gay, Bisexual, Transgender, and Queer Studies M101C.) Lecture, four hours; discussion, one hour (when scheduled). Enforced requisite: English Composition 3. Examination of cultural production, specifically literature, produced by queers after Stonewall rebellion in New York in 1969, widely regarded as origins or beginning of modern lesbian and gay rights movement in U.S. Writings and films by such authors as Andrew Holleran, Leslie Feinberg, Achy Obejas, Essex Hemphill, Audre Lorde, Cheryl Dunye, and Alison Bechdel may be included. May be repeated for credit with topic or instructor change. P/NP or letter grading.",
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "cross_listed": [
      "ENGL M101C",
      "Queer Literatures and Cultures after 1970",
      "LGBTQS M101C",
      "Queer Literatures and Cultures after 1970"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM105C"
  },
  {
    "course_code": "GENDER M105D",
    "units": 5,
    "title": "Studies in Queer Literatures and Cultures",
    "description": "(Same as English M101D and Lesbian, Gay, Bisexual, Transgender, and Queer Studies M101D.) Lecture, four hours; discussion, one hour (when scheduled). Enforced requisite: English Composition 3. Variable specialized studies course in queer literatures and cultures. Topics focus on particular problem or issue in terms of its relationship to queer cultures and writings. May be repeated for credit with topic or instructor change. P/NP or letter grading.",
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "cross_listed": [
      "ENGL M101D",
      "LGBTQS M101D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM105D"
  },
  {
    "course_code": "GENDER M106",
    "units": 5,
    "title": "Imaginary Women",
    "description": "(Same as Honors Collegium M106.) Seminar, four hours. Designed for juniors/seniors. Study of four female cultural archetypes—absconding wife/mother, infanticide mother, intellectual woman, and warrior woman—as they appear in their classical and modern manifestations in European and American cultures. P/NP or letter grading.",
    "cross_listed": [
      "HNRS M106"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM106"
  },
  {
    "course_code": "GENDER M107A",
    "units": 5,
    "title": "Studies in Women's Writing",
    "description": "(Same as English M107A.) Lecture, four hours; discussion, one hour (when scheduled). Enforced requisite: English Composition 3. Focus on women writers that may include historical, regional, national, or thematic emphasis, with possible topics such as authorship, self-writing, sexuality, gender, and genre. May be repeated for credit with topic or instructor change. P/NP or letter grading.",
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "cross_listed": [
      "ENGL M107A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM107A"
  },
  {
    "course_code": "GENDER M107B",
    "units": 5,
    "title": "Studies in Gender and Sexuality",
    "description": "(Same as English M107B and Lesbian, Gay, Bisexual, Transgender, and Queer Studies M107B.) Lecture, four hours; discussion, one hour (when scheduled). Enforced requisite: English Composition 3. Examination of literary and cultural production through lens of gender and sexuality. Depending on instructor, emphasis may be historical, regional, national, comparative, or thematic and include other intersectional vectors of identity and representation such as race and ethnicity. May be repeated for credit with topic or instructor change. P/NP or letter grading.",
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "cross_listed": [
      "ENGL M107B",
      "LGBTQS M107B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM107B"
  },
  {
    "course_code": "GENDER 108S",
    "units": 4,
    "title": "Violence against Women",
    "description": "Lecture, three hours. Requisite: course 10. Factual information and theoretical analyses regarding various forms of violence against women and girls in their homes, workplaces, and communities through critical examination of social structures and social science research. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER108S"
  },
  {
    "course_code": "GENDER M109",
    "units": 4,
    "title": "Women in Jazz",
    "description": "(Same as African American Studies M109, Ethnomusicology M109, and Global Jazz Studies M109.) Lecture, four hours; discussion, one hour. Sociocultural history of women in jazz and allied musical traditions from 1880s to present. Survey of women vocalists, instrumentalists, composers/arrangers, and producers and their impact on development of jazz. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "Diversity - Arts and Architecture"
    ],
    "cross_listed": [
      "GJ STDS M109",
      "AF AMER M109",
      "ETHNMUS M109"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM109"
  },
  {
    "course_code": "GENDER M110C",
    "units": 4,
    "title": "Topics in Feminist Philosophy: Metaphysics and Epistemology",
    "description": "(Same as Philosophy M187.) Lecture, three hours; discussion, one hour (when scheduled). Requisite for Gender Studies majors: course 10; for other students: one philosophy course. Examination in depth of different theoretical positions on gender and women as they have been applied to study of philosophy. Emphasis on theoretical contributions made by new scholarship on women in philosophy. Critical study of concepts and principles that arise in discussion of women’s rights and liberation. Philosophical approach to feminist theories. May be repeated for credit with consent of instructor. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "PHILOS M187"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM110C"
  },
  {
    "course_code": "GENDER M111",
    "units": 6,
    "title": "Women and Film",
    "description": "(Same as Film and Television M111.) Lecture, eight hours; discussion, one hour. Historical issues and critical approaches to women and cinema that may include authorship, stardom, female genres, and images of women in Hollywood cinema, alternative cinema, and independent cinema from silent era to present. Letter grading.",
    "cross_listed": [
      "FILM TV M111"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM111"
  },
  {
    "course_code": "GENDER 112",
    "units": 4,
    "title": "Special Topics in Women and Arts",
    "description": "Lecture, three hours. Requisite: course 10. Selected topics relating feminist theories to creation of art by women, with consideration of cultural contexts in which they work. Approach to be comparative, cross-cultural, and interdisciplinary. Consideration of artistic practice by women in relation to issues of power, representation, and access. May be repeated twice, except for credit toward Gender Studies major. P/NP or letter grading.",
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER112"
  },
  {
    "course_code": "GENDER 113",
    "units": 4,
    "title": "Sex Work",
    "description": "Lecture, three hours. Enforced requisite: course 10. Analysis of variety of contemporary sex work both in U.S. and abroad from feminist perspective. Examination of how race, class, and gender alter experience and perception of erotic labor, and consideration of critically feminist responses by range of authors to sex work. Topics include brothels, phone sex, strip clubs, sex tourism, military prostitution, and international traffic in persons. Reading of texts by sex workers, as well as articles from current philosophical and policy debates about prostitution. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER113"
  },
  {
    "course_code": "GENDER M114",
    "units": 5,
    "title": "Introduction to Lesbian, Gay, Bisexual, Transgender, and Queer Studies",
    "description": "(Same as Lesbian, Gay, Bisexual, Transgender, and Queer Studies M114.) Lecture, three hours; discussion, one hour. Introduction to history, politics, culture, and scientific study of lesbians, gay men, bisexuals, transgendered, and queer people; examination of sexuality and gender as categories for investigation; interdisciplinary theories and research on minority sexualities and genders. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Social Analysis (Society & Culture)",
      "Diversity - Arts and Architecture"
    ],
    "cross_listed": [
      "LGBTQS M114"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM114"
  },
  {
    "course_code": "GENDER M115",
    "units": 4,
    "title": "Topics in Study of Sexual and Gender Orientation",
    "description": "(Same as Lesbian, Gay, Bisexual, Transgender, and Queer Studies M115.) Lecture/discussion, three hours. Requisite: course 10 or M114. Studies in arts, humanities, social sciences, and/or life sciences on aspects of sexual orientation, gender identity, and lesbian, gay, and/or bisexual issues; variable topics may include cultural representations, historical and political change, life and health experiences, and queer or transgender theories; multiethnic and cross-cultural emphases. May be repeated for credit. Letter grading.",
    "prerequisites": [
      "GENDER 10",
      "GENDER M114"
    ],
    "cross_listed": [
      "LGBTQS M115"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM115"
  },
  {
    "course_code": "GENDER M116",
    "units": 4,
    "title": "Sexuality and City: Queer Los Angeles",
    "description": "(Same as Lesbian, Gay, Bisexual, Transgender, and Queer Studies M116.) Lecture, three hours. Requisite: course M114. Investigation of history, culture, and political economy of lesbian, gay, bisexual, and transgender Los Angeles. Letter grading.",
    "prerequisites": [
      "GENDER M114"
    ],
    "cross_listed": [
      "LGBTQS M116"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM116"
  },
  {
    "course_code": "GENDER 117",
    "units": 4,
    "title": "Introduction to Queer Latina/Latino Studies",
    "description": "Lecture, three hours. Examination of production of Latina/Latino identity and its limitations as it emerges within contemporary literature, music, film, and performance art. Engagement with texts that posit queer analytical approach to study how Latinidad is informed by modes of desire and identification that fall out of dominant notions of Latino in popular culture. Critical engagement of limits of knowledge production around Latina/Latino identity to develop new analytics that abide by question of Latinidad rather than posit answer or solution to its political consequences in contemporary U.S. culture. Study draws upon feminist and queer artists such as Ana Mendieta, Nao Bustamante, Asco, Carmelita Tropicana, Gloria Anzadúa, Felix-Gonzales Torres, Gil Cuadros, and Gregg Araki. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER117"
  },
  {
    "course_code": "GENDER M118",
    "units": 4,
    "title": "Queering American History",
    "description": "(Same as Lesbian, Gay, Bisexual, Transgender, and Queer Studies M118.) Lecture, four hours. Enforced requisite: one prior lesbian, gay, bisexual, transgender, and queer studies course. History of sexual and gender minorities in U.S. Topics include changing norms, romantic friendships, medical discourse, liberation politics, post-Stonewall culture, AIDS, transgender movement, queer theory, and politics. P/NP or letter grading.",
    "prerequisites": [],
    "cross_listed": [
      "LGBTQS M118"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM118"
  },
  {
    "course_code": "GENDER 119",
    "units": 4,
    "title": "Racial Violence and Law",
    "description": "Lecture, three hours. Requisite: course 10. Through feminist, anti-colonial, and anti-racist framework, exploration of racial violence and appropriate anti-violence strategies. Offers theoretical approach for understanding racial violence. Consideration of what is racial violence and racial terror; how feminists should respond to racial violence; connection between historical moments of extraordinary racial violence and our everyday world; how we understand violence at specific sites, e.g., carceral sites, schools, streets, borders, and in different historical contexts; how individuals come to participate in, remain indifferent to, or approve of violence; role of hegemonic masculinity and femininity in these processes; and how violence is sexualized. Exploration of these broad questions through consideration of anti-indigenous/colonial violence, anti-Black and anti-Mexican violence, racial violence underpinning anti-migrant and anti-refugee movements, torture, terror, and state violence. P/NP or letter grading.",
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER119"
  },
  {
    "course_code": "GENDER 120SL",
    "units": 4,
    "title": "Feminist Praxis: Community-Based Learning",
    "description": "Seminar, three hours; fieldwork, four hours. Preparation: at least two gender studies core courses. Requisites: course 10 and one course from 102, 103, or 104. Service-learning course combining seminar with practical experience working on gender issues and connecting these experiences to methodological and theoretical themes explored in gender studies core courses. Community partners selected in advance by instructor in consultation with Center for Community Learning. Letter grading.",
    "prerequisites": [
      "GENDER 10",
      "GENDER 102",
      "GENDER 103",
      "GENDER 104"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER120SL"
  },
  {
    "course_code": "GENDER M121",
    "units": 4,
    "title": "Topics in Gender and Disabilities",
    "description": "(Same as Disability Studies M121.) Lecture, three and one half hours. Limited to juniors/seniors. Ways in which issues of disability are affected by gender, with particular attention to various roles, positions, and concerns of women with disabilities. Approach is intersectional, exploring how social categories of class, race, ethnicity, religion, age, sexuality, nationality, and citizenship affect and are affected by gender and disability. Topics may include law (civil rights, nondiscrimination), representation (arts, literature), education, public policy, health. May be repeated for credit with topic and instructor change. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture"
    ],
    "cross_listed": [
      "DIS STD M121"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM121"
  },
  {
    "course_code": "GENDER 122",
    "units": 4,
    "title": "Masculinities",
    "description": "Lecture, three hours. Enforced requisite: course 10. Masculinity as theorized by feminists and shaped by race, class, age, and nation. Topics include feminist theories of masculinity, male body, childhood and adolescent socialization, sport, male violence, homophobia, black masculinity, globalization and masculinity, and men’s movements in 1970s and beyond. Special emphasis on social sciences approaches and methodologies. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER122"
  },
  {
    "course_code": "GENDER 123",
    "units": 4,
    "title": "Gender, Race, and Class in Latin American Literature and Film, 1850 to 1950",
    "description": "Seminar, three hours. Requisite: course 10. Readings and discussion in English. Comparative survey of cultural expression in Latin America, with emphasis on works produced or set in late-19th and early-20th centuries. Historical and social circumstances of women in different Latin American cultural contexts, with particular concentration on how gender, sexuality, race, and class are absorbed and reflected in literature and film. Within this genealogy, examination of how cultural production sustains or interrogates categories used to construct social, political, and cultural hierarchies. Topics include questions of authorship and authority such as women’s participation in formation of national cultures, engagement with artistic movements, and strategies of self-figuration. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER123"
  },
  {
    "course_code": "GENDER M124",
    "units": 6,
    "title": "Sex, Race, and Difference in Transnational Film",
    "description": "(Same as Film and Television M124.) Lecture, three hours; discussion, one hour. Drawing on feminist media studies, training of students in media literacy so they acquire necessary skills to critically interrogate film as medium of communication and to appreciate how film provides lens to examine some of most critical issues of our time. Development of understanding of transnationality to examine how circulations of capital, labor, and commodities transect, render problematic, and sometimes reinforce national borders. Examination of role of film in both exemplifying and representing these conditions of transnationality. How films enable understanding of historical and contemporary relationships between mobility, coercion, and migration; colonialism and settler colonialism; Orientalism, geopolitics, and sexuality; cultural identity and diaspora; transnational conceptions of sexual desire and embodiment; immigration and religious difference; and criminalization of racial difference. P/NP or letter grading.",
    "cross_listed": [
      "FILM TV M124"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM124"
  },
  {
    "course_code": "GENDER 125",
    "units": 4,
    "title": "Perspectives on Women's Health",
    "description": "Lecture/discussion, three hours. Requisite: course 10. Examination in depth of various ways women provide healthcare in both paid and unpaid capacities and of political, economic, and social factors affecting women as recipients of healthcare. P/NP or letter grading.",
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER125"
  },
  {
    "course_code": "GENDER M126",
    "units": 5,
    "title": "Feminist and Queer Theory",
    "description": "(Same as English M126 and Lesbian, Gay, Bisexual, Transgender, and Queer Studies M126.) Lecture, four hours; discussion, one hour (when scheduled). Enforced requisite: English Composition 3. Recommended: one course from 102, 103, 104, English 120, or 121. Investigation of key concepts and debates in study of gender, sexuality, and kinship, with focus on their interrelated significance for making of culture. Readings to be interdisciplinary, with possible emphasis on impact of changing ideas of gender and sexuality on specific historical cultures. May be repeated for credit with topic or instructor change. P/NP or letter grading.",
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "cross_listed": [
      "LGBTQS M126",
      "ENGL M126"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM126"
  },
  {
    "course_code": "GENDER M127",
    "units": 4,
    "title": "Women in Russian Literature",
    "description": "(Same as Russian M127.) Lecture, three hours. Designed for juniors/seniors. Lectures and readings in English. Introduction to alternative tradition of women’s writings in Russia and Soviet Union. Emphasis on images of women expressed in this tradition as compared with those found in works of contemporary male writers. P/NP or letter grading.",
    "cross_listed": [
      "RUSSN M127"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM127"
  },
  {
    "course_code": "GENDER M128",
    "units": 4,
    "title": "Roots of Patriarchy: Ancient Goddesses and Heroines",
    "description": "(Same as Honors Collegium M118.) Lecture, three hours. Examination of ancient goddesses and heroines—European, Neolithic, Near Eastern, Celtic, Scandinavian, Balto-Slavic, Indo-Iranian, and Greco-Roman—using translations of ancient texts, archaeological evidence, and feminist methodology in order to discover implications of ancient patriarchy on modern society. P/NP or letter grading.",
    "cross_listed": [
      "HNRS M118"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM128"
  },
  {
    "course_code": "GENDER 129",
    "units": 4,
    "title": "Women and Gender in Caribbean",
    "description": "Seminar, three hours. Requisite: course 10. Exploration of way in which gender discourses have been central to making of Caribbean history and to some most enduring experiments in European empire, capitalist development, and coercive labor. Emphasis on women who lived through slavery and indentured servitude and who continue to live under systems of globalization and neoliberal exploitation. How Caribbean women have historically empowered themselves and their communities, working in various ways to survive, radicalize, and transform their worlds. Ways in which ideas about gender and sexuality have shaped emergence of new nations and national cultures in Caribbean, and consideration of some dominant images of women in public space and popular culture. Exploration of complicated ways in which gender, race, class, sexuality, and national identity intersect in different Caribbean contexts. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER129"
  },
  {
    "course_code": "GENDER 130",
    "units": 4,
    "title": "Women of Color in the U.S.",
    "description": "Lecture/discussion, three hours. Requisite: course 10. Exploration of experiences of African American, Asian American, Chicana, and Native American women in order to assess intersections of race, ethnicity, class, and gender. Contemporary and/or historical and/or theoretical perspectives on racism and its relation to feminism as defined by women of color. P/NP or letter grading.",
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER130"
  },
  {
    "course_code": "GENDER 131",
    "units": 4,
    "title": "Feminist Politics in Korea and Diaspora",
    "description": "Lecture, three hours. Examination of gender, religion, and social movements in Korea and Korean diaspora through interdisciplinary feminist and critical area studies approach. Use of postcolonial, anti-racist, and intersectional feminist lens to discuss Korea and Korean diaspora as site of inquiry and field of knowledge. Close examination of several contemporary political issues, focusing on salient political theologies and oppositional social movements mobilized by religious groups, and wide range of ideas, institutions, and practices that are animated by complex politics of gender, sexuality, and religion. Topics include Korean and transnational diasporic activism concerning war, imperialism, and militarism; anticommunism and xenophobia; pro-democracy movements and labor organizing; Catholic and Buddhist solidarity and sanctuary geographies; heteropatriarchy and urban megachurches; faith-based pacifism and conscientious objection to military conscription. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER131"
  },
  {
    "course_code": "GENDER CM132A",
    "units": 4,
    "title": "Chicana Feminism",
    "description": "(Same as Chicana/o and Central American Studies CM110.) Lecture, four hours. Enforced requisite: course 10 or Chicana/o and Central American Studies 10A. Examination of theories and practices of women who identify as Chicana feminist. Analysis of writings of Chicanas who do not identify as feminist but whose practices attend to gender inequities faced by Chicanas both within Chicana/Chicano community and dominant society. Attention to Anglo-European and Third World women. Concurrently scheduled with course CM232A. P/NP or letter grading.",
    "prerequisites": [
      "GENDER 10",
      "Central American Studies 10A"
    ],
    "cross_listed": [
      "CCAS CM110"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERCM132A"
  },
  {
    "course_code": "GENDER M132B",
    "units": 4,
    "title": "Contemporary Issues among Chicanas",
    "description": "(Same as Chicana/o and Central American Studies M154.) Lecture, two and one half hours. Requisite: course 10. Overview of conditions facing Chicanas in U.S., including issues on family, immigration, reproduction, employment conditions. Comparative analysis with other Latinas. P/NP or letter grading.",
    "prerequisites": [
      "GENDER 10"
    ],
    "cross_listed": [
      "CCAS M154"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM132B"
  },
  {
    "course_code": "GENDER M133",
    "units": 4,
    "title": "Chicana Lesbian Literature",
    "description": "(Same as Chicana/o and Central American Studies M133 and Lesbian, Gay, Bisexual, Transgender, and Queer Studies M133.) Lecture, four hours. Exploration of intersection of radical First and Third World feminist politics, lesbian sexuality and its relationship to Chicana identity, representation of lesbianism in Chicana literature, meaning of familia in Chicana lesbian lives, and impact of Chicana lesbian theory on Chicana/Chicano studies. Letter grading.",
    "cross_listed": [
      "CCAS M133",
      "LGBTQS M133"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM133"
  },
  {
    "course_code": "GENDER M133A",
    "units": 4,
    "title": "History of Women in Europe, 800 to 1715",
    "description": "(Same as History M133A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History of social, political, and cultural roles of women in Western Europe from early Middle Ages to 18th century. P/NP or letter grading.",
    "cross_listed": [
      "HIST M133A",
      "History of Women in Europe, 800",
      "History of Women in Europe, 1715"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM133A"
  },
  {
    "course_code": "GENDER M133B",
    "units": 4,
    "title": "History of Women in Europe, 1715 to Present",
    "description": "(Same as History M133B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History of social, political, and cultural roles of women in Western Europe from 18th century to present. P/NP or letter grading.",
    "cross_listed": [
      "HIST M133B",
      "History of Women in Europe, 1715"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM133B"
  },
  {
    "course_code": "GENDER M133C",
    "units": 4,
    "title": "History of Prostitution",
    "description": "(Same as History M133C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. History of prostitution from ancient times to present. Topics include toleration in medieval Europe, impact of syphilis, birth of courtesan, regulation in 19th-century Europe, white slavery scare, and contemporary global sex trade. Readings include novels, primary sources, and testimony by sex workers. P/NP or letter grading.",
    "cross_listed": [
      "HIST M133C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM133C"
  },
  {
    "course_code": "GENDER 134",
    "units": 4,
    "title": "Gender, Science, and Theory",
    "description": "Lecture, three hours. Requisite: course 10. Examination of differing theoretical perspectives on relation between ideologies of gender and conceptualization and practice of science and medicine. Study of relations among gender, race, class, and sexual orientation and production and legitimation of scientific knowledge. Applications of theoretical critiques to research design, practice, and interpretation. Letter grading.",
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER134"
  },
  {
    "course_code": "GENDER M135C",
    "units": 4,
    "title": "Bilingual Writing Workshop",
    "description": "(Same as Chicana/o and Central American Studies CM135 and Lesbian, Gay, Bisexual, Transgender, and Queer Studies M135.) Seminar, four hours. Limited to juniors/seniors. Writing sample required; access to course web page mandatory; need not be bilingual to enroll. Technical instruction, analysis, and theoretical discussion of bilingual creative expression through genre of short fiction. Bilingualism as both politics and aesthetics to be central theme. Discussion and analysis of Chicana/Chicano and Latina/Latino short story collections. Peer critique of weekly writing assignments. Emphasis on narrative techniques such as characterization, plot, conflict, setting, point of view, and dialogue, and magical realism as prevailing Chicanesque/Latinesque style. Some attention to process of manuscript preparation, public reading, and publication. Letter grading.",
    "cross_listed": [
      "CCAS CM135",
      "LGBTQS M135"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM135C"
  },
  {
    "course_code": "GENDER M136",
    "units": 5,
    "title": "Music and Gender",
    "description": "(Same as Musicology M136.) Lecture, four hours; discussion, one hour. Analysis of gender ideologies in several musical cultures; representations of gender, body, and sexuality by both male and female musicians; contributions of women to Western art and popular musics; methods in feminist and gay/lesbian theory and criticism. Letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Visual & Performance Arts Analysis & Practice (Arts & Humanities)"
    ],
    "cross_listed": [
      "MUSCLG M136"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM136"
  },
  {
    "course_code": "GENDER M137E",
    "units": 4,
    "title": "Work Behavior of Women and Men",
    "description": "(Same as Psychology M137E.) Lecture, two and one half hours. Requisite: course 10 or Psychology 10. Designed for seniors. Examination of work behavior of women and men. Topics include antecedents of career choice, job findings, leadership, performance evaluation, discrimination and evaluation bias, job satisfaction, and interdependence of work and family roles. P/NP or letter grading.",
    "prerequisites": [
      "GENDER 10",
      "PSYCH 10"
    ],
    "cross_listed": [
      "PSYCH M137E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM137E"
  },
  {
    "course_code": "GENDER 138",
    "units": 5,
    "title": "Gender and Popular Culture",
    "description": "Lecture, three hours; screenings, two hours. Limited to juniors/seniors. Conceptual tools and critical skills necessary to rigorously interrogate gender politics of popular culture in the U.S. context. Consideration of theories of popular culture and exploration of distinctive power and ideological force exerted by popular culture in American public life. Examination of specific representations of male and female bodies to understand visual vocabulary of gender in popular culture, as well as relationship between visual stereotypes and regimes of power. Consideration of debates concerning transformative potential of pop culture and exploration of capacity and limits of popular culture as agent of social change. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER138"
  },
  {
    "course_code": "GENDER 139",
    "units": 4,
    "title": "Women and Art in Contemporary U.S.",
    "description": "Lecture/discussion, three hours. Requisite: course 10. Exploration of some significant cultural issues of contemporary American women’s art movement. Representation, resistance, and critical intervention in relation to gender, race, and class. Emphasis on visual and performance arts as these reflect various perspectives of feminism. Letter grading.",
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER139"
  },
  {
    "course_code": "GENDER M140C",
    "units": 4,
    "title": "Class and Gender in Care Work",
    "description": "(Same as Asian American Studies M162, Chicana/o and Central American Studies M128B, and Labor Studies M143.) Lecture, three hours; discussion, one hour. Examination of how gender, race, class, and citizenship status shape domestic labor in U.S. Examination of domestic worker experiences through film, fiction, and traditional scholarship. Investigation of why domestic work is in high demand, who employs domestic workers, and why immigrants and women of color make up large percentage of this workforce. Exploration of how domestic workers navigate pay and working conditions, and how they build community and family networks in shadows of their privileged employers. P/NP or letter grading.",
    "cross_listed": [
      "CCAS M128B",
      "LBR STD M143",
      "ASIA AM M162"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM140C"
  },
  {
    "course_code": "GENDER 141",
    "units": 4,
    "title": "Gender, Culture, and Capitalism",
    "description": "Lecture, three hours. Dynamic investigation of culture as terrain of production—and reproduction—of and resistance to gendered, racialized, and classed inequalities through active analysis of advertisements, television serials, Disney fairy tales, and performative forms like fortunetelling. Focus on relationships between gender, culture, and capitalism through lenses of transnational feminist and queer cultural studies to explore gendered processed of production and consumption of culture under capitalism. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER141"
  },
  {
    "course_code": "GENDER 142",
    "units": 4,
    "title": "Race, Gender, and Punishment",
    "description": "Seminar, three hours. Enforced requisite: course 10. Examination of what crisis scholars have called prison industrial complex. U.S. has largest prison population in world. How and why is this? Who is imprisoned? What historical conditions and ideologies gave rise to this massive explosion in prisoner population? Does prison function as regime? How have politicians used imprisonment as response to economic transformations and social disorders? How is current crisis analogous to or distinct from regimes of racialized punishment in prior historical moments? How do prisons change environments? How have people mobilized to reduce U.S. prison population? Why do some activists argue for reform and others for abolition? Examination of key topics, including policing and racial profiling, immigrant detention, privatization, spatial transformations, gender violence, prison spending, and political imprisonment. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER142"
  },
  {
    "course_code": "GENDER CM143XP",
    "units": 4,
    "title": "Healing, Ritual, and Transformation",
    "description": "(Formerly numbered CM143.) (Same as World Arts and Cultures CM140XP.) Lecture, four hours. Designed for juniors/seniors. Examination of how various cultures think of health and wellness, not only individually but collectively. Exploration of structural inequalities within health care and medical sciences. Students are required to contribute weekly to service learning component, working with individuals and organizations in fields of health and wellness including healers, non-profits, and organizations working for social justice. May be concurrently scheduled with CM243XP. Letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture"
    ],
    "cross_listed": [
      "WL ARTS CM140XP"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERCM143XP"
  },
  {
    "course_code": "GENDER M144",
    "units": 4,
    "title": "Women's Movement in Latin America",
    "description": "(Same as Chicana/o and Central American Studies M144 and Labor Studies M144.) Lecture, four hours. Course on women’s movements and feminism in Latin America and Caribbean to examine diverse social movements and locations from which women have launched political and gender struggles. Discussion of forms of feminism and women’s consciousness that have emerged out of indigenous rights movements, environmental struggles, labor movements, Christian-based communities, peasant and rural organizing, and new social movements that are concerned with race, sexuality, feminism, and human rights. Through comparative study of women’s movements in diversity of political systems as well as national and transnational arenas, students gain understanding of historical contexts and political conditions that give rise to women’s resistance, as well as major debates in field of study. P/NP or letter grading.",
    "cross_listed": [
      "LBR STD M144",
      "CCAS M144"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM144"
  },
  {
    "course_code": "GENDER 145",
    "units": 4,
    "title": "African American Women's History",
    "description": "Seminar, three hours. Enforced requisite: course 10. Historical examination of black women’s experiences in U.S. from antebellum era to present. By situating their experiences within major historical transitions in American history, exploration of key themes, including gender formation, sexuality, labor and class, collective action, gender and sexual violence, reproduction, and role of law. How have intersecting forms of oppression impacted black women’s historical lives? How is difference constructed through interrelated and overlapping ideologies of race and gender? How do historians uncover their historical lives and what are challenges to such discoveries? Examination of their individual and collective struggles for freedom from racism, sexism, and heteropatriarchy as well as their participation in and challenge to social movements, including suffrage, women’s liberation, civil rights, and black power. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER145"
  },
  {
    "course_code": "GENDER M146",
    "units": 4,
    "title": "Feminist Geography",
    "description": "(Same as Geography M144.) Lecture, three hours; discussion, one hour. Critical engagement of gender as concept of geographic inquiry. Gender as spatial process, analysis of feminist geographic theory and methods, landscapes of gender, challenges of representing gender. Spaces of femininity, masculinity, and sexuality. P/NP or letter grading.",
    "cross_listed": [
      "GEOG M144"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM146"
  },
  {
    "course_code": "GENDER M147A",
    "units": 4,
    "title": "Psychology of Lesbian Experience",
    "description": "(Same as Lesbian, Gay, Bisexual, Transgender, and Queer Studies M147A and Psychology M147A.) Lecture, two hours; discussion, one hour. Requisite: course 10 or M114 or Psychology 10. Designed for juniors/seniors. Review of research and theory in psychology and gender studies to examine various aspects of lesbian experience, impact of heterosexism/stigma, gender role socialization, minority status of women and lesbians, identity development within a multicultural society, changes in psychological theories about lesbians in sociohistorical context. P/NP or letter grading.",
    "prerequisites": [
      "GENDER 10",
      "GENDER M114",
      "PSYCH 10"
    ],
    "cross_listed": [
      "PSYCH M147A",
      "LGBTQS M147A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM147A"
  },
  {
    "course_code": "GENDER M147B",
    "units": 4,
    "title": "History of Women in Colonial British America and Early U.S., 1600 to 1860",
    "description": "(Same as History M147C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Introduction to major themes in history of early American women from initial confrontation of English and American Indian cultures in early 17th century to rise of women’s rights movement in mid-19th century. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "cross_listed": [
      "HIST M147C",
      "HIST 1600",
      "HIST 1860"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM147B"
  },
  {
    "course_code": "GENDER M147C",
    "units": 4,
    "title": "Transnational Women's Organizing in Americas",
    "description": "(Same as Chicana/o and Central American Studies CM147.) Lecture, four hours. Feminist theories of transnational organizing. Examination of gender and race as central to processes of globalization and essential to economic and political struggles encompassed in transnational power relations. Exploration of how questions of race and gender influence global economic policies and impact local actors and their communities. In time when people, capital, cultures, and technologies cross national borders with growing frequency, discussion of process of accelerated globalization has been linked to feminization of labor and migration, environmental degradation, questions of diaspora, sexuality, and cultural displacement, as well as growing global militarization. Problems and issues created by globalization and cultural, social, and political responses envisioned by transnational organizing. P/NP or letter grading.",
    "cross_listed": [
      "CCAS CM147"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM147C"
  },
  {
    "course_code": "GENDER M147D",
    "units": 4,
    "title": "History of Women in U.S., 1860 to 1980",
    "description": "(Same as History M147D.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Introduction to major themes in history of American women from abolition of slavery and Civil War to rise and consequences of second-wave feminism. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions"
    ],
    "cross_listed": [
      "HIST M147D",
      "HIST 1860",
      "HIST 1980"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM147D"
  },
  {
    "course_code": "GENDER M149",
    "units": 5,
    "title": "Media: Gender, Race, Class, and Sexuality",
    "description": "(Same as Communication M149 and Labor Studies M149.) Lecture, four hours; activity, one hour. Limited to junior/senior Communication and Gender Studies majors and Labor Studies minors. Examination of manner in which media culture induces people to perceive various dominant and dominated and/or colonized groups of people. Ways in which women, gay, lesbian, bisexual, transgendered, racial, and ethnic marginalized peoples, class relations, and other subaltern or subordinated groups are presented and often misrepresented in media. Investigation and employment of practical applications of communications and feminist theories for understanding ideological nature of stereotyping and politics of representation through use of media, guest presentations, lectures, class discussions, and readings. Introduction to theory and practice of cultural studies. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "Diversity - Arts and Architecture"
    ],
    "cross_listed": [
      "COMM M149",
      "LBR STD M149"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM149"
  },
  {
    "course_code": "GENDER 152",
    "units": 4,
    "title": "Gender, Disability, and Education",
    "description": "Lecture, three hours. Drawing on critical theory, study engages intersections of disability as it is theorized, constructed, and lived as post/neocolonial condition. Study bridges disability scholarship between global North and South, as well as interdisciplinary fields of feminist disability studies—which assumes disability is always inextricably linked to other social markers, such as gender, race, sexuality, and social class—and indigenous studies—which studies complex and diverse cultures and histories, and their impacts on society. Study locates relationship to disability, gender, and education through decolonial lens and explores topics of phenomenology of lived body and relations to land. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER152"
  },
  {
    "course_code": "GENDER 153",
    "units": 4,
    "title": "Gender and Comics",
    "description": "Seminar, three hours. Study of cultural politics of comics—broadly defined to include comic books, cartoons, graphic novels, manga, manhwa, graphic memoirs, documentary comics, etc.—with focus on feminist genealogies and transnational dynamics. Introduction to comics as form of graphic storytelling and sequential art, beginning with primer on basic terminology for reading, discussing, and making comics. For historical context, consideration of gendered youth culture, superheroes, Cold War geopolitics, and comics industry in U.S. and beyond. Examination of comics written for kids and young adults as well as for mature audiences and critical readers, including comics that range from funny and heartwarming to seriously dark, irreverent, and even risqué. These include alternative comics, underground comix, and feminist and queer comics that circulated through alternative newspapers and small presses before rise of graphic novels. Examination also of graphic memoirs, comics journalism, etc. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER153"
  },
  {
    "course_code": "GENDER M154P",
    "units": 4,
    "title": "Marriage, Family, and Kinship",
    "description": "(Same as Anthropology M145P.) Lecture, three hours. Requisite: Anthropology 3. Examination of understandings of kinship in cross-cultural perspective and impact of kinship on interpersonal relationships, gender roles, and sociocultural systems. Readings from popular materials and formal ethnographic accounts. P/NP or letter grading.",
    "prerequisites": [
      "ANTHRO 3"
    ],
    "cross_listed": [
      "ANTHRO M145P"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM154P"
  },
  {
    "course_code": "GENDER M154Q",
    "units": 4,
    "title": "Selected Topics in Gender Systems",
    "description": "(Same as Anthropology M145Q.) Lecture, three hours. Recommended preparation: prior anthropology or gender studies courses. Designed for junior/senior social sciences majors. Comparative study of women’s lives and gender systems and cultures from anthropological perspective. Critical review of relevant theoretical issues using ethnography, case study, and presentations. Consult Schedule of Classes for topics and instructors. May be repeated for credit with topic change. P/NP or letter grading.",
    "cross_listed": [
      "ANTHRO M145Q"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM154Q"
  },
  {
    "course_code": "GENDER M154R",
    "units": 4,
    "title": "Women and Social Movements",
    "description": "(Same as Anthropology M145R.) Lecture/discussion, three hours. Recommended preparation: prior gender studies or anthropology courses. Comparative studies of social movements (e.g., nationalist, socialist, liberal/reform), beginning with Russia and China and including Cuba, Algeria, Guinea-Bissau, Mozambique, Nicaragua, and Iran. Analysis of women’s participation in social transformations and the centrality of gender interests. P/NP or letter grading.",
    "cross_listed": [
      "ANTHRO M145R"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM154R"
  },
  {
    "course_code": "GENDER M154T",
    "units": 4,
    "title": "Women's Voices: Their Critique of Anthropology of Japan",
    "description": "(Same as Anthropology M145T.) Lecture, three hours. Preparation: introductory sociocultural anthropology course. The anthropology of Japan has long viewed Japan as a homogeneous whole. Restoration of diversity and contradiction in it by listening to voices of Japanese women in various historical contexts. P/NP or letter grading.",
    "cross_listed": [
      "ANTHRO M145T"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM154T"
  },
  {
    "course_code": "GENDER 156A",
    "units": 4,
    "title": "History of Women in the U.S.: Rebellious Women of 20th Century",
    "description": "Lecture, three hours. Limited to juniors/seniors. Introduction to major and minor figures and movements for social change in the U.S., including themes from politics, sports, civil rebellions, and body. Examination of dramatic challenges to gender roles over course of the 20th century through actions of rebellious women who led way for myriad of changes in women’s lives. Offered in summer only. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER156A"
  },
  {
    "course_code": "GENDER M157",
    "units": 4,
    "title": "Chicana Historiography",
    "description": "(Same as Chicana/o and Central American Studies M158 and History M151D.) Lecture, four hours. Examination of Chicana historiography, looking closely at how practice of writing of history has placed Chicanas into particular narratives. Using Chicana feminist approaches to study of history, revisiting of specific historical periods and moments such as Spanish Conquest, Mexican Period, American Conquest, Mexican Revolution, and Chicano Movement to excavate untold stories about women’s participation in and contribution to making of Chicana and Chicano history. P/NP or letter grading.",
    "cross_listed": [
      "CCAS M158",
      "HIST M151D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM157"
  },
  {
    "course_code": "GENDER M158",
    "units": 4,
    "title": "Women, Gender, and Sexuality in Italian Culture",
    "description": "(Same as Italian M158.) Lecture, three hours; discussion, one hour. Analysis of gender roles, images of femininity and masculinity, patriarchy, myths of Madonna and Latin lover, condition of women in Italian society through history, politics, literature, film, and other media. Italian majors required to read texts in Italian. P/NP or letter grading.",
    "cross_listed": [
      "ITALIAN M158"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM158"
  },
  {
    "course_code": "GENDER 160",
    "units": 4,
    "title": "Sporting Bodies",
    "description": "Lecture, three hours. Recommended requisite: course 10. From Don Imus’ 2007 “nappy-headed hos” comment to controversies about transgender athletes or athletes with prosthetics; from covers of magazines to violence in Dodger’s Stadium parking lot; footballers not standing during national anthem, college men’s teams rating women’s teams in terms of sexual positions, unionization of athletes—discourses of sport draw heavily upon extant ideologies of race, gender, sexuality, and class. Introduction to critical analyses of social categories and how they are represented and reproduced in various sports and media. Critical examination of historical social values and how they are reproduced through sport. P/NP or letter grading.",
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER160"
  },
  {
    "course_code": "GENDER M161",
    "units": 4,
    "title": "Sports, Normativity, and Body",
    "description": "(Same as Disability Studies M161.) Lecture, four hours. Since creation of International Olympic Committee in 1894, athletes with disabilities have had, and been denied, formal opportunities to compete with able-bodied athletes. Overview of some major topics of discussion concerning intersections of athletic competition and disability, addressing variety of perspectives and themes on disability and sport, such as passing, sports integration, competition versus charity, and masculinity. Sources include readings, film, television, and biographical writings that address sports, body and disability generally, and Special Olympics specifically. P/NP or letter grading.",
    "cross_listed": [
      "DIS STD M161"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM161"
  },
  {
    "course_code": "GENDER M162",
    "units": 5,
    "title": "Sociology of Gender",
    "description": "(Same as Sociology M162.) Lecture, three hours; discussion, one hour. Enforced requisite: course 10 or Sociology 1. Examination of processes by which gender is socially constructed. Topics include distinction between biological sex and sociological gender, causes and consequences of gender inequality, and recent changes in gender relations in modern industrial societies. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GENDER 10",
      "SOCIOL 1"
    ],
    "cross_listed": [
      "SOCIOL M162"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM162"
  },
  {
    "course_code": "GENDER M163",
    "units": 4,
    "title": "Gender and Work",
    "description": "(Same as Sociology M163.) Lecture, three hours. Requisite: course 10 or Sociology 1. Exploration of relationship of gender to work, concentrating on the U.S. experience but also including some comparative material. Particular emphasis on analysis of causes and consequences of job segregation by gender and of wage inequality. P/NP or letter grading.",
    "prerequisites": [
      "GENDER 10",
      "SOCIOL 1"
    ],
    "cross_listed": [
      "SOCIOL M163"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM163"
  },
  {
    "course_code": "GENDER M164",
    "units": 4,
    "title": "Politics of Reproduction and Everyday Life",
    "description": "(Same as Sociology M164.) Lecture, three hours; discussion, one hour. Limited to juniors/seniors. Social and human reproduction is global policy issue. Government efforts to influence reproduction are important feature of modern state: political intervention into private life, intimacy, and sexuality. Exploration of politics of reproduction—intersection between politics and life cycle or between public sphere and private lives—and coverage of broad range of issues addressing prevention and promotion of reproduction from historical-comparative approach. Reading, discussion, and development of culminating project. P/NP or letter grading.",
    "cross_listed": [
      "SOCIOL M164"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM164"
  },
  {
    "course_code": "GENDER M164A",
    "units": 4,
    "title": "Women, Violence, Globalization: India, Philippines, Singapore, Vietnam",
    "description": "(Same as Asian American Studies M164.) Lecture, four hours. Study of various forms of violence done on women not only in and of themselves but in light of larger systems of oppression, with focus on Pilipino, Vietnamese, Singaporean, and South Asian cultures. Letter grading.",
    "cross_listed": [
      "ASIA AM M164"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM164A"
  },
  {
    "course_code": "GENDER M165",
    "units": 4,
    "title": "Psychology of Gender",
    "description": "(Same as Psychology M165.) Lecture, three hours. Consideration of psychological literature relevant to understanding contemporary sex differences. Topics include sex-role development and role conflict, physiological and personality differences between men and women, sex differences in intellectual abilities and achievement, and impact of gender on social interaction. P/NP or letter grading.",
    "cross_listed": [
      "PSYCH M165"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM165"
  },
  {
    "course_code": "GENDER M167",
    "units": 4,
    "title": "Contested Sexualities",
    "description": "(Same as Lesbian, Gay, Bisexual, Transgender, and Queer Studies M167.) Lecture, three hours; discussion, one hour. Sociological perspectives on formation, control, and resistance of lesbian, gay, bisexual, and transgendered people. Variable topics include identity and community; age, class, gender, and racial diversity; and analysis of contemporary issues affecting contested sexualities. Letter grading.",
    "cross_listed": [
      "LGBTQS M167"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM167"
  },
  {
    "course_code": "GENDER 168",
    "units": 4,
    "title": "Feminist Economics in Globalizing World",
    "description": "Lecture, four hours. Preparation: satisfaction of Letters and Science Writing II requirement. Requisite: course 10. Designed for juniors/seniors. Overview of field of feminist economics, with emphasis on development experiences in globalizing world economy. Overview of gender inequalities such as gender division of labor in paid and unpaid work, patterns of employment and unemployment, and wage gaps between men and women in different world economy regions; feminist critiques of economics and of theoretical debates within gender and development field on topics such as structural adjustment, feminization of labor force, and poverty; examination of efforts and proposals by governments, international policy-making institutions, and civil society organizations to make economic policies and structures gender-equitable. P/NP or letter grading.",
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER168"
  },
  {
    "course_code": "GENDER M169",
    "units": 4,
    "title": "Common Thread: Garment Workers Past, Present, Future",
    "description": "(Same as Chicana/o and Central American Studies M128C and Labor Studies M108.) Lecture, three hours. Study blends frameworks from economics, labor history, and ethnic studies to offer in-depth exploration of lives and experiences of garment industry workers from early 19th century to present. In contrast to traditional narratives, study locates garment workers—majority of whom are immigrant women—at vanguard of U.S. labor movement, showing how they pioneered new forms of worker education and other social welfare programs, and became leaders in fight for women’s, civil, and immigrant rights. Exploration of garment work relationship to American culture, tracing how sweatshop became symbol of worker exploitation, how popular culture and fashion trends impacted lived realities of workers in those shops, and how racial and gendered expectations shaped public perceptions of garment workers. By doing so, study reveals garment work to be central thread that ties together histories of global trade, industrialization, gender and sexuality, immigration, radicalism, unionization, and American imperialism. P/NP or letter grading.",
    "cross_listed": [
      "CCAS M128C",
      "LBR STD M108"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM169"
  },
  {
    "course_code": "GENDER CM170",
    "units": 5,
    "title": "Alternate Traditions: In Search of Female Voices in Contemporary Literature",
    "description": "(Same as Comparative Literature CM170.) Seminar, three hours. Designed for upper-division literature majors. Investigation of narrative texts by contemporary French, German, English, American, Spanish American, African, and Asian women writers from cross-cultural perspective. Common themes, problems, and techniques. Concurrently scheduled with course CM270. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "COM LIT CM170"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERCM170"
  },
  {
    "course_code": "GENDER M170C",
    "units": 4,
    "title": "History of Women in China, AD 1000 to Present",
    "description": "(Same as History M170C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Topics include women and family, women in Confucian ideology, women in literati culture, feminist movement, and women and communist revolution. P/NP or letter grading.",
    "cross_listed": [
      "HIST M170C",
      "History of Women in China, AD 1000"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM170C"
  },
  {
    "course_code": "GENDER 171A",
    "units": 4,
    "title": "Women, Gender, and Law: Jurisprudence of Sexual Equality",
    "description": "Lecture, four hours. Enforced requisite: course 10. Recommended: course 102 or 103 or 104. Exploration of models of equality described and/or advocated by legal theorists primarily in U.S.—equality of opportunity, equality of outcome, equality of respect, etc.—using specific problems of women (e.g., sexual harassment, pregnancy leave policy, access to safe and effective reproductive control technologies) for purposes of comparison and critique. Specific focus may vary by instructor (e.g., consideration of sexual equality theories to issues of gender equity, legal status of women in countries outside U.S. or from perspectives of international human rights). May be repeated for credit with topic or instructor change. P/NP or letter grading.",
    "prerequisites": [
      "GENDER 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER171A"
  },
  {
    "course_code": "GENDER M172",
    "units": 4,
    "title": "Afro-American Woman in U.S.",
    "description": "(Same as African American Studies M172 and Psychology M172.) Lecture, two and one half hours. Designed for juniors/seniors. Impact of social, psychological, political, and economic forces which impact on interpersonal relationships of Afro-American women as members of large society and as members of their biological and ethnic group. P/NP or letter grading.",
    "cross_listed": [
      "PSYCH M172",
      "AF AMER M172"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM172"
  },
  {
    "course_code": "GENDER M173B",
    "units": 4,
    "title": "Women in 20th-Century Japan",
    "description": "(Same as History M173B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Japanese women in Japanese and world history through state documents, autobiographical voices, contemporary television, and other varying historical sources, including topics such as women and new political order (1900 to 1930), women, war, and empire (1930 to 1945), and women in consumer society (1980s to 1990s). P/NP or letter grading.",
    "cross_listed": [
      "HIST M173B",
      "Women in 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM173B"
  },
  {
    "course_code": "GENDER M174",
    "units": 4,
    "title": "Sociology of Family",
    "description": "(Same as Sociology M174.) Lecture, three hours; discussion, one hour. Theory and research dealing with modern family, its structure, and functions, including historical changes, variant family patterns, family as institution, and influence of contemporary society on family. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "SOCIOL M174"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM174"
  },
  {
    "course_code": "GENDER M175",
    "units": 4,
    "title": "Women and Cities",
    "description": "(Same as Urban Planning M175.) Lecture, three hours. Limited to juniors/seniors. Examination of relationship between women and cities: (1) how cities have affected women’s opportunities for economic and social equality, (2) women’s contributions to development of U.S. cities, and (3) contemporary strategies and efforts to create urban environments that reflect women’s needs and interests. P/NP or letter grading.",
    "cross_listed": [
      "URBN PL M175"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM175"
  },
  {
    "course_code": "GENDER CM178",
    "units": 4,
    "title": "Critical Media Literacy and Politics of Gender: Theory and Production",
    "description": "(Same as Education CM178.) Seminar, three hours. Corequisite: course CM178L. Use of range of pedagogical approaches to theory and practice of critical media literacy that necessarily involves understanding of new technologies and media forms. Study of both theory and production techniques to inform student analysis of media and critical media literacy projects. Concurrently scheduled with course CM278. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GENDER CM178L"
    ],
    "corequisites": [
      "GENDER CM178L"
    ],
    "cross_listed": [
      "EDUC CM178"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERCM178"
  },
  {
    "course_code": "GENDER CM178L",
    "units": 2,
    "title": "Critical Media Literacy and Politics of Gender: Laboratory",
    "description": "(Same as Education CM178L.) Laboratory, two hours. Corequisite: course CM178. Hands-on production experience as integral component of course CM178. Concurrently scheduled with course CM278L. Letter grading.",
    "prerequisites": [
      "GENDER CM178"
    ],
    "corequisites": [
      "GENDER CM178"
    ],
    "cross_listed": [
      "EDUC CM178L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERCM178L"
  },
  {
    "course_code": "GENDER M180B",
    "units": 4,
    "title": "Historical Perspectives on Gender and Science",
    "description": "(Same as History M180B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Historical cases illustrating how gender enters practices and concepts of science. Topics include gendered conceptions of nature, persona of man of science, role of women in scientific revolution, scientific investigations of women and feminine. P/NP or letter grading.",
    "cross_listed": [
      "HIST M180B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM180B"
  },
  {
    "course_code": "GENDER 185",
    "units": 4,
    "title": "Special Topics in Gender Studies",
    "description": "Lecture, three hours. Preparation: one prior gender studies course. Designed for juniors/seniors. Specialized or advanced study in one area within gender studies. May be repeated for credit with topic and/or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER185"
  },
  {
    "course_code": "GENDER M185A",
    "units": 4,
    "title": "Special Topics in American Indian and Gender Studies",
    "description": "(Same as American Indian Studies M187A.) Lecture, three hours. Variable topics in American Indian and gender studies. May be repeated for credit with topic and/or instructor change. P/NP or letter grading.",
    "cross_listed": [
      "AM IND M187A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM185A"
  },
  {
    "course_code": "GENDER M186A",
    "units": 4,
    "title": "Women and Gender, Prehistory to 1792",
    "description": "(Same as History M186A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exploration of history of women, gender, and sexuality from prehistory to 1792. First half deals with period before written history and asks when did gender appear? How and why did patriarchy develop? Topics include evolution of women’s bodies, appearance of gender, women’s contribution to Neolithic revolution, significance of Goddess artifacts, creation myths, and women and sexuality in different religions. Consideration of effects of European conquest on Mesoamerican women, women’s power in monarchies, gender dimensions of Atlantic slavery, and first manifestations of feminist consciousness in second half. Objects or texts created by women examined or read throughout. P/NP or letter grading.",
    "cross_listed": [
      "HIST M186A",
      "Women and Gender, Prehistory to 1792"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM186A"
  },
  {
    "course_code": "GENDER M186B",
    "units": 4,
    "title": "Global Feminism, 1850 to Present",
    "description": "(Same as History M186B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Introduction to movements for women’s rights (educational, political, economic, sexual, and reproductive) around world and over one and one half centuries. P/NP or letter grading.",
    "cross_listed": [
      "HIST M186B",
      "Global Feminism, 1850"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM186B"
  },
  {
    "course_code": "GENDER 187",
    "units": 4,
    "title": "Senior Research Seminar: Gender Studies",
    "description": "Seminar, three hours. Requisites: courses 10, 102, 103, 104. Designed for advanced junior/senior Gender Studies majors or minors. In-depth study of major theme in feminist research. Themes vary by instructor and term. Students pursue independent research related to course theme, with guidance from instructor, then share and critique other student works in progress. Letter grading.",
    "prerequisites": [
      "GENDER 10",
      "GENDER 102",
      "GENDER 103",
      "GENDER 104"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER187"
  },
  {
    "course_code": "GENDER 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER188SA"
  },
  {
    "course_code": "GENDER 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "GENDER 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER188SB"
  },
  {
    "course_code": "GENDER 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "GENDER 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER188SC"
  },
  {
    "course_code": "GENDER 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER189"
  },
  {
    "course_code": "GENDER 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER189HC"
  },
  {
    "course_code": "GENDER M191D",
    "units": 5,
    "title": "Topics in Queer Literatures and Cultures",
    "description": "(Same as English M191D and Lesbian, Gay, Bisexual, Transgender, and Queer Studies M191D.) Seminar, three or four hours. Enforced requisite: English Composition 3. Consult Schedule of Classes for author, period, genre, or subject to be studied in specific term. May be repeated for credit with topic or instructor change. P/NP or letter grading.",
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "cross_listed": [
      "LGBTQS M191D",
      "ENGL M191D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM191D"
  },
  {
    "course_code": "GENDER M191E",
    "units": 5,
    "title": "Topics in Gender and Sexuality",
    "description": "(Same as English M191E and Lesbian, Gay, Bisexual, Transgender, and Queer Studies M191E.) Seminar, three or four hours. Enforced requisite: English Composition 3. Consult Schedule of Classes for author, period, genre, or subject to be studied in specific term. May be repeated for credit with topic or instructor change. P/NP or letter grading.",
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "cross_listed": [
      "ENGL M191E",
      "LGBTQS M191E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM191E"
  },
  {
    "course_code": "GENDER M191F",
    "units": 5,
    "title": "Topics in Gender and Disability",
    "description": "(Same as Disability Studies M191F.) Seminar, three hours. In-depth study of major themes in disability studies and gender studies. Themes vary by instructor and term. Students pursue independent research related to course theme, with guidance from instructor, then share and critique other student works in progress. May be repeated for credit with topic change. Letter grading.",
    "cross_listed": [
      "DIS STD M191F"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM191F"
  },
  {
    "course_code": "GENDER 195",
    "units": 2,
    "title": "Community or Corporate Internships in Gender Studies",
    "description": "Tutorial, eight hours. Requisites: course 102 or 103 or 104, or two upper-division gender studies courses not in 189 to 199 series. Limited to juniors/seniors. Internship in supervised setting in community agency, organization, or business approved by program. Content of student work must apply gender analysis or be focused on some aspect of gender studies. Students meet on regular basis with instructor, provide periodic reports on their experience on-site, and submit final report. Must be taken for 4 letter-graded units to be applied toward Gender Studies major or minor. May be repeated for maximum of 8 units. Individual contract with supervising faculty member required. P/NP or letter grading.",
    "prerequisites": [
      "GENDER 102",
      "GENDER 103",
      "GENDER 104",
      "GENDER 189",
      "GENDER 199"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER195"
  },
  {
    "course_code": "GENDER M195CE",
    "units": 4,
    "title": "Comparative Approaches to Community and Corporate Internships",
    "description": "(Same as African American Studies M195CE, American Indian Studies M195CE, Asian American Studies M195CE, and Chicana/o and Central American Studies M195CE.) Tutorial, one hour; fieldwork, eight to 10 hours. Limited to juniors/seniors. Internship in corporate, governmental, or nonprofit setting coordinated through Center for Community Learning. Comparative study of race, gender, and indigeneity in relation to contemporary workplace dynamics. Students complete weekly written assignments, attend biweekly meetings with graduate student coordinator, and write final research paper. Faculty sponsor and graduate student coordinator construct series of reading assignments that examine issues related to internship site. Individual contract with supervising faculty member required. P/NP or letter grading.",
    "cross_listed": [
      "ASIA AM M195CE",
      "AF AMER M195CE",
      "AM IND M195CE",
      "CCAS M195CE"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDERM195CE"
  },
  {
    "course_code": "GENDER 197",
    "units": 4,
    "title": "Individual Studies in Gender Studies",
    "description": "Tutorial, four hours. Preparation: at least two upper-division gender studies courses. Requisite: course 102 or 103 or 104. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Content may include themes in feminist discourse, application of feminist theoretical perspectives to disciplinary field, or emerging areas of inquiry. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. Letter grading.",
    "prerequisites": [
      "GENDER 102",
      "GENDER 103",
      "GENDER 104"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER197"
  },
  {
    "course_code": "GENDER 198A",
    "units": 4,
    "title": "Honors Research in Gender Studies",
    "description": "Tutorial, four hours. Requisite: course 187. Limited to junior/senior gender studies honors program students. First term of three-term sequence to research and write honors thesis under direct supervision of faculty sponsor and in consultation with faculty cosponsor. Individual contract required. Letter grading.",
    "prerequisites": [
      "GENDER 187"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER198A"
  },
  {
    "course_code": "GENDER 198B",
    "units": 4,
    "title": "Honors Research in Gender Studies",
    "description": "Tutorial, four hours. Enforced requisite: course 198A. Limited to junior/senior gender studies honors program students. Second term of three-term sequence to research and write honors thesis under direct supervision of faculty sponsor and in consultation with faculty cosponsor. Individual contract required. In Progress grading (credit to be given only on completion of course 198C).",
    "prerequisites": [
      "GENDER 198A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER198B"
  },
  {
    "course_code": "GENDER 198C",
    "units": 4,
    "title": "Honors Research in Gender Studies",
    "description": "Tutorial, four hours. Enforced requisites: courses 198A, 198B. Limited to junior/senior gender studies honors program students. Third term of three-term sequence to research and write honors thesis under direct supervision of faculty sponsor and in consultation with faculty cosponsor. Individual contract required. Letter grading.",
    "prerequisites": [
      "GENDER 198A",
      "GENDER 198B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER198C"
  },
  {
    "course_code": "GENDER 199",
    "units": 2,
    "title": "Directed Research in Gender Studies",
    "description": "Tutorial, to be arranged. Preparation: at least two upper-division gender studies courses, minimum 3.0 grade-point average. Requisite: course 102 or 103 or 104. Limited to junior/senior Gender Studies majors and minors. Supervised individual research or investigation under guidance of faculty mentor on specific topic within gender studies. Culminating paper or project required. May be repeated for credit. Individual contract required. Letter grading.",
    "prerequisites": [
      "GENDER 102",
      "GENDER 103",
      "GENDER 104"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GENDER199"
  }
]