[
  {
    "course_code": "GEOG 1",
    "units": 5,
    "title": "Earth's Physical Environment",
    "description": "Lecture, three hours; laboratory, two hours. Study of Earth’s physical environment, with particular reference to nature and distribution of landforms and climate and their significance to people. P/NP or letter grading.",
    "satisfies": [
      "General Education - Physical Sciences with Lab Credit (Scientific Inquiry)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG1"
  },
  {
    "course_code": "GEOG 2",
    "units": 5,
    "title": "Biodiversity in Changing World",
    "description": "Lecture, three hours; discussion, two hours. Biogeographic exploration of plant and animal diversity and conservation issues on continents and islands around world. Study of physical, biotic, and human factors responsible for evolution, persistence, and extinction of species and ecological communities. Analysis of effects of human activity. P/NP or letter grading.",
    "satisfies": [
      "General Education - Life Sciences with Lab Credit (Scientific Inquiry)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG2"
  },
  {
    "course_code": "GEOG 3",
    "units": 5,
    "title": "Cultural Geography",
    "description": "Lecture, three hours; discussion, two hours. Introduction to cultural geography of modern world, with examination of key concepts of space, place, and landscape as these have shaped and been shaped by connections between societies and their natural environments. Examples from variety of landscapes and places since 1800 and especially from Los Angeles region. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG3"
  },
  {
    "course_code": "GEOG 4",
    "units": 5,
    "title": "Globalization: Regional Development and World Economy",
    "description": "Lecture, three hours; discussion, two hours. Economic geography explores spatial distribution of all forms of human productive activity at number of geographical scales—local, regional, national, and global. Key theme is impact of increasingly powerful global economic forces on organization of production. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG4"
  },
  {
    "course_code": "GEOG 5",
    "units": 5,
    "title": "People and Earth's Ecosystems",
    "description": "Lecture, three hours; laboratory, two hours. Exploration of ways in which human activity impacts natural environment and how modification of environment can eventually have significant consequences for human activity. Examination, using case studies, of real environmental problems that confront us today. P/NP or letter grading.",
    "satisfies": [
      "General Education - Life Sciences with Lab Credit (Scientific Inquiry)",
      "General Education - Physical Sciences with Lab Credit (Scientific Inquiry)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG5"
  },
  {
    "course_code": "GEOG 6",
    "units": 5,
    "title": "World Regions: Concepts and Contemporary Issues",
    "description": "Lecture, three hours; discussion, two hours. Interdisciplinary and historical approach to modern peoples, their differences in wealth or poverty, and their local origins of food production. Brief introduction to physical geography and biogeography of each region. Discussion of each region’s peoples, languages, foods, prehistories, and histories. Letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG6"
  },
  {
    "course_code": "GEOG 7",
    "units": 5,
    "title": "Introduction to Geographic Information Systems",
    "description": "Lecture, three hours; laboratory, two hours. Designed for freshmen/sophomores. Introduction to fundamental principles and concepts necessary to carry out sound geographic analysis with geographic information systems (GIS). Reinforcement of key issues in GIS, such as geographic coordinate systems, map projections, spatial analysis, and visualization of spatial data. Laboratory exercises use database query, manipulation, and spatial analysis to address real-world problems. P/NP or letter grading.",
    "satisfies": [
      "General Education - Physical Sciences with Lab Credit (Scientific Inquiry)",
      "General Education - Social Analysis (Society & Culture)",
      "General Education - Life Sciences with Lab Credit (Scientific Inquiry)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG7"
  },
  {
    "course_code": "GEOG 8",
    "units": 5,
    "title": "Geographies of Sustainability and Unsustainability",
    "description": "Lecture, three hours; discussion, two hours. Exploration from a geographical perspective of how sustainability can be understood. Consideration of why the organization of different kinds of landscapes encourages, fosters, enables, and stymies building of sustainable relationships among people, land, waterways, flora, and fauna. While readings and discussions reference scientific studies, focus is on exploring social, historical, cultural, and political-economic dimensions of environmental problems and solutions. Examination of cultural ideas about human environment interaction and questions of power, politics, history, and inequality asking how they contribute to the problems that scientists measure and discuss. Selective focus on those issues of sustainability and unsustainability that are most central to everyday lives in Los Angeles, including questions of food, water, waste, and urban sustainability more generally. P/NP or letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG8"
  },
  {
    "course_code": "GEOG 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG19"
  },
  {
    "course_code": "GEOG 88A",
    "units": 4,
    "title": "Lower-Division Seminar: Geography",
    "description": "Discussion, three hours; reading period, one hour. Seminars designed to explore various themes and issues pertinent to environment and people. Seminar topics advertised in department during previous term. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG88A"
  },
  {
    "course_code": "GEOG 88GE",
    "units": 5,
    "title": "Seminar Sequence: Special Topics in Geography",
    "description": "Seminar, three hours. Enforced requisite: course 5. Designed for sophomores/juniors. Exploration of aspects of lecture topic through readings, images, and discussions. P/NP or letter grading.",
    "satisfies": [
      "General Education - Life Sciences without Lab Credit (Scientific Inquiry)",
      "General Education - Physical Sciences without Lab Credit (Scientific Inquiry)"
    ],
    "prerequisites": [
      "GEOG 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG88GE"
  },
  {
    "course_code": "GEOG 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG89"
  },
  {
    "course_code": "GEOG 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG89HC"
  },
  {
    "course_code": "GEOG 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG99"
  },
  {
    "course_code": "GEOG 101",
    "units": 4,
    "title": "Principles of Geomorphology",
    "description": "(Formerly numbered 100.) Lecture, three hours; reading period, one hour. Requisite: course 1. Study of processes that shape world’s landforms, with emphasis on weathering, mass movement and fluvial erosion, transport, deposition; energy and material transfers; space and time considerations. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG101"
  },
  {
    "course_code": "GEOG M102",
    "units": 4,
    "title": "Soils and Environment",
    "description": "(Formerly numbered M127.) (Same as Ecology and Evolutionary Biology M127 and Environment M102.) Lecture, three hours; discussion, one hour; field trips. General treatment of soils and environmental implications: soil development, morphology, and worldwide distribution of soil orders; physical, chemical, hydrologic, and biological properties; water use, erosion, and pollution; management of soils as related to plant growth and distribution. P/NP or letter grading.",
    "cross_listed": [
      "EE BIOL M127",
      "ENVIRON M102"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOGM102"
  },
  {
    "course_code": "GEOG M102L",
    "units": 1,
    "title": "Soils and Environment: Field",
    "description": "(Formerly numbered M127L.) (Same as Ecology and Evolutionary Biology M127L and Environment M102L.) Laboratory, one hour; field excursions. Corequisite: course M102. Investigations and demonstrations supporting material in course M102, including excavating, describing, and naming soils in field, soil forming processes, geomorphology, and soils. P/NP or letter grading.",
    "prerequisites": [
      "GEOG M102"
    ],
    "corequisites": [
      "GEOG M102"
    ],
    "cross_listed": [
      "ENVIRON M102L",
      "EE BIOL M127L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOGM102L"
  },
  {
    "course_code": "GEOG M103",
    "units": 4,
    "title": "Soil and Water Conservation",
    "description": "(Formerly numbered M107.) (Same as Environment M103.) Lecture, three hours; discussion, one hour. Enforced requisite: one course from course 1, 2, Environment 10, Life Sciences 7B. Designed for juniors/seniors. Systematic study of processes of and hazards posed by erosion, sedimentation, development, and pollution and techniques needed to conserve soil and maintain environmental quality. Scope includes agriculture, forestry, mining, and other rural uses of land. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 1",
      "GEOG 2",
      "ENVIRON 10",
      "LIFESCI 7B"
    ],
    "cross_listed": [
      "ENVIRON M103"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOGM103"
  },
  {
    "course_code": "GEOG 106",
    "units": 4,
    "title": "World Vegetation",
    "description": "(Formerly numbered 108.) Lecture, three hours; reading period, one hour. Limited to juniors/seniors. Characteristics, distribution, environmental and cultural relationships of world’s principal vegetation patterns. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG106"
  },
  {
    "course_code": "GEOG 107",
    "units": 4,
    "title": "Forest Ecosystems",
    "description": "(Formerly numbered 111.) Lecture, three hours; field trips. Requisite: course 2 or Life Sciences 7B. Designed for juniors/seniors. Evaluation of ecological principles as they apply to forests. Emphasis on constraints of physical environment, biotic interactions, succession, disturbances, and long-term environmental change. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 2",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG107"
  },
  {
    "course_code": "GEOG 108",
    "units": 4,
    "title": "Analytical Animal Geography",
    "description": "(Formerly numbered 112.) Lecture, three hours. Requisites: courses 1, 2 or Life Sciences 7B, Statistics 12. Designed for juniors/seniors. Analysis of processes of expanding and contracting distribution areas. Focus on island biogeography and its implications for biodiversity trends in natural and anthropogenic environments. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 1",
      "GEOG 2",
      "LIFESCI 7B",
      "STATS 12"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG108"
  },
  {
    "course_code": "GEOG 109",
    "units": 4,
    "title": "Biogeography of Plant and Animal Invasions",
    "description": "(Formerly numbered 116.) Lecture, three hours; reading period, one hour. Requisite: course 1 or 2 or 5. Examination of theories and examples of invasion of new environments by plants and animals introduced through natural processes or by human activity. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 1",
      "GEOG 2",
      "GEOG 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG109"
  },
  {
    "course_code": "GEOG M110",
    "units": 4,
    "title": "Ecosystem Ecology",
    "description": "(Formerly numbered M117.) (Same as Ecology and Evolutionary Biology M131.) Lecture, three hours; field trips. Requisite: course 1 or Life Sciences 7B. Designed for juniors/seniors. Development of principles of ecosystem ecology, with focus on understanding links between ecosystem structure and function. Emphasis on energy and water balances, nutrient cycling, plant-soil-microbe interactions, landscape heterogeneity, and human disturbance to ecosystems. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 1",
      "LIFESCI 7B"
    ],
    "cross_listed": [
      "EE BIOL M131"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOGM110"
  },
  {
    "course_code": "GEOG 116",
    "units": 4,
    "title": "Climatology",
    "description": "(Formerly numbered 104.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Examination of many relations between climate and world of man. Application of basic energy budget concepts to microclimates of relevance to ecosystems of agriculture, animals, man, and urban places. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG116"
  },
  {
    "course_code": "GEOG 117",
    "units": 4,
    "title": "Tropical Climatology",
    "description": "(Formerly numbered 102.) Lecture, three hours. In-depth exploration of development of tropical climate, with special reference to hurricanes, ENSO, and monsoons. Examination of human interaction with tropical climate processes and human-induced climate change in tropics. Use of climatological information to foster sound environmental management of climate-related resources in tropics. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG117"
  },
  {
    "course_code": "GEOG M118",
    "units": 4,
    "title": "Applied Climatology: Principles of Climate Impact on Natural Environment",
    "description": "(Formerly numbered M106.) (Same as Atmospheric and Oceanic Sciences M106.) Lecture, three hours; discussion, one hour. Designed for juniors/seniors. Exploration of knowledge and tools to solve complex problems in contemporary applied climatology, including current practices, influence of climate on environment, and human influence on changing climates. P/NP or letter grading.",
    "cross_listed": [
      "A&O SCI M106"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOGM118"
  },
  {
    "course_code": "GEOG 119",
    "units": 4,
    "title": "Global Climatology and Climate Change",
    "description": "Lecture, three hours. Requisite: course 1. Survey of Earth’s climate system and factors that cause globe’s climate to change. Study of most important properties of climate, and how they vary and connect geographically and over time. Explanation of physical laws governing climate variations and interconnections to build basic-level understanding of natural climate phenomena and impacts of human industrial and agricultural activities. Explanation of source of Earth’s heat energy, determinants of temperature near surface and throughout atmosphere, and how observed seasonal and spatial variations are created. Introduction to various motion systems in atmosphere and ocean and their governing physical laws. Exploration of nature and causes of past changes in global climate evident in paleo-records. Survey of current understanding of ongoing human-caused climate change event, and how climate models are used to develop projections of future climate change. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG119"
  },
  {
    "course_code": "GEOG 120",
    "units": 4,
    "title": "Hydrology",
    "description": "(Formerly numbered 105.) Lecture, three hours. Requisites: course 116, Statistics 12. Role of water in geographic systems: hydrologic phenomena in relation to climate, landforms, soils, vegetation, and cultural processes and impacts on landscape. Field projects required. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 116",
      "STATS 12"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG120"
  },
  {
    "course_code": "GEOG M125",
    "units": 4,
    "title": "Environmentalism: Past, Present, and Future",
    "description": "(Formerly numbered M115.) (Same as Environment M125 and Urban Planning M165.) Lecture, three hours; discussion, one hour. Exploration of history and origin of major environmental ideas, movements or countermovements they spawned, and new and changing nature of modern environmentalism. Introduction to early ideas of environment, how rise of modern sciences reshaped environmental thought, and how this was later transformed by 19th-century ideas and rise of American conservation movements. Review of politics of American environmental thought and contemporary environmental questions as they relate to broader set of questions about nature of development, sustainability, and equity in environmental debate. Exploration of issues in broad context, including global climate change, rise of pandemics, deforestation, and environmental justice impacts of war. Letter grading.",
    "cross_listed": [
      "ENVIRON M125",
      "URBN PL M165"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOGM125"
  },
  {
    "course_code": "GEOG M126",
    "units": 4,
    "title": "Environmental Change",
    "description": "(Formerly numbered M131.) (Same as Environment M126.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Examination of natural forces producing environmental changes over past two million years. How present landscape reflects past conditions. Effects of environmental change on people. Increasing importance of human activity in environmental modification. Focus on impact of natural and anthropogenic changes on forests. P/NP or letter grading.",
    "cross_listed": [
      "ENVIRON M126"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOGM126"
  },
  {
    "course_code": "GEOG M127",
    "units": 4,
    "title": "Global Environment and Development: Problems and Issues",
    "description": "(Formerly numbered M128.) (Same as Urban Planning CM166.) Lecture, three hours; discussion, one hour. Designed for juniors/seniors. Questions of population, resource use, Third World poverty, and environment. Analysis of global economic restructuring and its connections to changing organization of production and resulting environmental impacts. Case studies from Africa, Latin America, Asia, and U.S. P/NP or letter grading.",
    "cross_listed": [
      "URBN PL CM166"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOGM127"
  },
  {
    "course_code": "GEOG 130",
    "units": 4,
    "title": "Food and Environment",
    "description": "(Formerly numbered 132.) Lecture, three hours. Designed for juniors/seniors. Thematic orientation to food systems and their role in environmental and cultural transformations. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG130"
  },
  {
    "course_code": "GEOG M131",
    "units": 4,
    "title": "Human Impact on Biophysical Environment",
    "description": "(Formerly numbered M109.) (Same as Environment M131.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Examination of history, mechanisms, and consequences of interactions between humans and environment. Exploration in depth of three thematic topics (deforestation, desertification, and greenhouse gas increase and ozone depletion) and four major subjects (soil, biodiversity, water, and landforms). P/NP or letter grading.",
    "cross_listed": [
      "ENVIRON M131"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOGM131"
  },
  {
    "course_code": "GEOG 133",
    "units": 4,
    "title": "Humid Tropics",
    "description": "(Formerly numbered 113.) Lecture, three hours. Requisite: course 2 or 5 or Life Sciences 7B. Designed for juniors/seniors. Examination of humid tropics, with emphasis on rainforests, their ecological principles, and forms of land use. Letter grading.",
    "prerequisites": [
      "GEOG 2",
      "GEOG 5",
      "LIFESCI 7B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG133"
  },
  {
    "course_code": "GEOG 135",
    "units": 4,
    "title": "Africa and African Diaspora in Americas",
    "description": "(Formerly numbered 114.) Lecture, three hours. Designed for juniors/seniors. Historical-geographical examination of Africa’s role in Americas, with emphasis on environment, agriculture, food systems, and medicinal crops. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG135"
  },
  {
    "course_code": "GEOG 136",
    "units": 4,
    "title": "Health and Global Environment",
    "description": "(Formerly numbered 125.) Lecture, three hours; reading period, one hour. Impact of environment and lifestyle on individual health examined from geographical perspective, with examples from both developed and developing countries. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG136"
  },
  {
    "course_code": "GEOG 138",
    "units": 4,
    "title": "Wildlife Conservation in Eastern and Southern Africa",
    "description": "(Formerly numbered 122.) Lecture, three hours; reading period, one hour. Requisite: course 5. Designed for juniors/seniors. Analysis of tropical ecosystems of eastern Africa, including wildlife communities, vegetation, climate, and human impact. Discussion of national park systems and their natural and anthropogenic ecological dynamics. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG138"
  },
  {
    "course_code": "GEOG 139B",
    "units": 4,
    "title": "Problems in Geography: Biogeography",
    "description": "(Formerly numbered 159E.) Seminar, three hours; reading period, one hour. Preparation: completion of three courses in one concentration. Limited to seniors. Seminar course in which students carry out intensive research projects developed from courses within one concentration. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG139B"
  },
  {
    "course_code": "GEOG 139C",
    "units": 4,
    "title": "Problems in Geography: Culture and Environment in Modern World",
    "description": "(Formerly numbered 159C.) Seminar, three hours; reading period, one hour. Preparation: completion of three courses in one concentration. Limited to seniors. Seminar course in which students carry out intensive research projects developed from courses within one concentration. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG139C"
  },
  {
    "course_code": "GEOG 140",
    "units": 4,
    "title": "Social Geography",
    "description": "(Formerly numbered 147.) Lecture, three hours; discussion, one hour. Study of spatiality of social differences such as race, class, gender, age, sexuality, location. Critical explorations of identity, social categories, and spatial structures. Importance of space and place in social life. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG140"
  },
  {
    "course_code": "GEOG 141",
    "units": 4,
    "title": "Cultural Geography of Modern World",
    "description": "(Formerly numbered 133.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors and graduate students. Historical and structural approach to cultural geography of modern world system, with particular emphasis on structure and functioning of its core, semi-periphery, and periphery. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG141"
  },
  {
    "course_code": "GEOG M142",
    "units": 5,
    "title": "(When) Do Leaders Make Differences?",
    "description": "(Formerly numbered M153.) (Same as Anthropology M148 and Honors Collegium M152.) Lecture, two hours; discussion, two hours. Examination of leaders who did or did not succeed in effecting change, as background to understanding conditions under which leaders can make differences. Comparison of political leaders, business chief executive officers, sports coaches, and religious leaders. Letter grading.",
    "cross_listed": [
      "ANTHRO M148",
      "HNRS M152"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOGM142"
  },
  {
    "course_code": "GEOG M144",
    "units": 4,
    "title": "Feminist Geography",
    "description": "(Formerly numbered M146.) (Same as Gender Studies M146.) Lecture, three hours; discussion, one hour. Critical engagement of gender as concept of geographic inquiry. Gender as spatial process, analysis of feminist geographic theory and methods, landscapes of gender, challenges of representing gender. Spaces of femininity, masculinity, and sexuality. P/NP or letter grading.",
    "cross_listed": [
      "GENDER M146"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOGM144"
  },
  {
    "course_code": "GEOG 145",
    "units": 4,
    "title": "Slavery and Human Trafficking",
    "description": "Lecture, three hours; discussion, two hours (when scheduled); reading period, one hour. Offered either as 4-unit course without discussion sessions or 5-unit course with discussion sessions. Requisite: one course from 3, 4, Anthropology 3, Gender Studies 10, or Sociology 1. Limited to juniors/seniors. Exploration of how, why, and to what ends human trafficking has been conceptualized as global problem that warrants international response. Examination of recent activist, governmental, scholarly, and media responses, and reflection on what is and is not accomplished by them. Questions of human trafficking are implicitly geographical, requiring consideration of ways freedom is spatially defined and how movement across borders is encouraged and regulated. How questions of labor, migration, sexuality, rights, ethics, embodiment, representation, and governance pertain to human trafficking. What people mean when they speak of human trafficking as slavery. Meanings of slavery and freedom in world today using examples from U.S. and Europe, with focus on Philippines as case study for exploring both contemporary examples and historical forms of enslavement. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 3",
      "GEOG 4",
      "ANTHRO 3",
      "GENDER 10",
      "SOCIOL 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG145"
  },
  {
    "course_code": "GEOG 146",
    "units": 4,
    "title": "Environmental Justice and Climate Change",
    "description": "Lecture, three hours. Designed for juniors/seniors. Examination of environmental quality and social justice. Premise that all people have right to live in clean environment and access resources to sustain health and livelihood. Investigation of under what conditions some people are denied this basic right and how some have fought back. Consideration of how certain groups of people experience effects of pollution or environmental hazards more than others, or lack basic resources; what social relations of production and power that contribute to these outcomes are; and how people have organized to demand environmental justice. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG146"
  },
  {
    "course_code": "GEOG 147",
    "units": 4,
    "title": "Environmental Politics and Policy",
    "description": "Lecture, three hours. Requisite: course 5. Covers some of major recent debates within fields of environmental studies and environmental geography. Definition of key terms and exploration of history and evolution of environmental policymaking, with focus mainly on U.S. Focus on current hot topics in field including Anthropocene, clean energy transitions, and Green New Deal. Students delve deeper into topic of interest by working with group to put together final presentation. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG147"
  },
  {
    "course_code": "GEOG 148",
    "units": 4,
    "title": "Political Geography",
    "description": "(Formerly numbered 140.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Spatiality of political activity, spatial constitution of political power, control over space as central component to political struggles. Studies at local, national, state, and global scales. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG148"
  },
  {
    "course_code": "GEOG 149",
    "units": 4,
    "title": "Border Studies: Globalization, Nation, Identity",
    "description": "(Formerly numbered 134.) Lecture, three hours; discussion, one hour (when scheduled). Analysis of history, production, and functions of contemporary borders. Designed to broaden understanding of and challenge dominant narratives about many physical, political, and conceptual borders that shape our daily lives, from national boundaries to security fences to discoveries about race and gender. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG149"
  },
  {
    "course_code": "GEOG 150",
    "units": 4,
    "title": "Economic Geography",
    "description": "(Formerly numbered 148.) Lecture, three hours; reading period, one hour. Requisite: course 4. Designed for juniors/seniors. Geographical aspects of economic production and growth. General theory of space-economy. Land-use processes. Location of industry. Regional development. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 4"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG150"
  },
  {
    "course_code": "GEOG 151",
    "units": 4,
    "title": "Uneven Development Geographies: Prosperity and Impoverishment in Third World",
    "description": "(Formerly numbered 141.) Lecture, three hours; discussion, two hours (when scheduled). Geographical perspective on part of globe commonly called Third World (global South). How development has shaped livelihood possibilities and practices, by global processes stretching back centuries, and transformative possibilities of Third World agency. World societies seek to transform Third World into their own image through theories and practices of colonialism, development, and globalization. Study of those theories and Third World alternatives to examine how they have shaped livelihood possibilities. Social differences between stagnant livelihood possibilities for Third World majority and minorities that prosper massively, as well as geographical differences (culturally, environmentally, and socially) across Third World. Examination of possibilities of Third World agency, ranging from interstate collaboration to village activism, asking whether such agency and alternative imaginaries can enable Third World residents to break with First World developmentalism. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG151"
  },
  {
    "course_code": "GEOG M153",
    "units": 4,
    "title": "Transportation Geography",
    "description": "(Formerly numbered M149.) (Same as Urban Planning M150.) Lecture, three hours. Requisite: course 3 or 4. Designed for juniors/seniors. Study of geographical aspects of transportation, with focus on characteristics and functions of various modes and on complexities of intra-urban transport. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 3",
      "GEOG 4"
    ],
    "cross_listed": [
      "URBN PL M150"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOGM153"
  },
  {
    "course_code": "GEOG 158",
    "units": 4,
    "title": "Population Geography",
    "description": "(Formerly numbered 142.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Study of social and behavioral perspectives influencing people in their patterns of demographic change, migration, and mobility, with special emphasis on spatial relationships and selected case studies. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG158"
  },
  {
    "course_code": "GEOG 159",
    "units": 4,
    "title": "Population in Interacting World",
    "description": "(Formerly numbered 143.) Lecture, three hours. Provides multidisciplinary understanding of and appreciation for human population phenomena and problems in different parts of world and at different geographical scales—from local to global. Particular emphasis on understanding and critically reflecting on (1) contemporary population problems at global, national, and local scale, including both dramatic decline and persistence of high levels of fertility in parts of developing world, record low fertility and population aging in highly industrialized countries, increasing levels of international migration, refugee crises, massive rural to urban migrations, and creation of mega-cities in less developed world, (2) policies adopted to address these problems, such as family planning policies to reduce fertility, immigration policies, and so on, and (3) gender dimension of contemporary population problems and policies. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG159"
  },
  {
    "course_code": "GEOG 160",
    "units": 4,
    "title": "Urban Geography",
    "description": "(Formerly numbered 150.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Analysis of development, functions, spatial patterns, and geographic problems of cities. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG160"
  },
  {
    "course_code": "GEOG 161",
    "units": 4,
    "title": "Cities and Social Difference",
    "description": "(Formerly numbered 151.) Lecture, three hours; discussion, one hour. City landscapes embody best and worst of U.S. society: diversity and poverty, opportunity and violence. Study of urban spaces, social differences, inequality, and conflicts over uses and meanings of city space. Social urban geography. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG161"
  },
  {
    "course_code": "GEOG 162",
    "units": 4,
    "title": "Ethnicity in American Cities",
    "description": "(Formerly numbered 144.) Lecture, three hours; reading period, two hours. Limited to juniors/seniors. Designed to encourage and facilitate critical thinking about geographical aspects of ethnicity in contemporary America. Use of comparative perspective to explain changing distribution, social, economic, and political behavior, and adjustment problems ethnic groups face in contemporary American cities. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG162"
  },
  {
    "course_code": "GEOG 169A",
    "units": 4,
    "title": "Problems in Geography: Urban and Regional Development Studies",
    "description": "(Formerly numbered 159A.) Seminar, three hours; reading period, one hour. Preparation: completion of three courses in one concentration. Limited to seniors. Seminar course in which students carry out intensive research projects developed from courses within one concentration. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG169A"
  },
  {
    "course_code": "GEOG 171A",
    "units": 4,
    "title": "North America",
    "description": "(Formerly numbered 180.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Delimitation and analysis of principal geographic regions of U.S. and Canada. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG171A"
  },
  {
    "course_code": "GEOG 171B",
    "units": 4,
    "title": "California",
    "description": "(Formerly numbered 184.) Lecture, three hours; reading period, one hour. Limited to juniors/seniors. Systematic and regional treatment of geography of California, including physical, cultural, and economic aspects and detailed studies of various regions. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG171B"
  },
  {
    "course_code": "GEOG 171C",
    "units": 4,
    "title": "Metropolitan Los Angeles",
    "description": "(Formerly numbered 156.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Study of origins, growth processes, internal structure and pattern, interactions, environmental and spatial problems of Los Angeles metropolitan area. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG171C"
  },
  {
    "course_code": "GEOG 172A",
    "units": 4,
    "title": "Spanish South America",
    "description": "(Formerly numbered 182A.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Study of geographic factors, physical and cultural, that are basic to understanding historical development of Spanish South America and contemporary economic and cultural geography of individual Spanish-speaking countries. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG172A"
  },
  {
    "course_code": "GEOG 172B",
    "units": 4,
    "title": "Central America",
    "description": "(Formerly numbered 181.) Seminar, two and one half hours. Located at center of American continent, Central America is central player in production of many important crops for world, and epicenter of massive migration waves. Exploration of Central America to understand way region has been defined by both European colonization and more modern interventions led by neocolonial relations with U.S. Consideration of role of racialization in producing specific racial/spatial dynamics in region. Fundamental exploration of how transnational migration has created expansive Central American diaspora that produces effects in isthmus and abroad. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG172B"
  },
  {
    "course_code": "GEOG 172C",
    "units": 4,
    "title": "Brazil",
    "description": "(Formerly numbered 182B.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Study of geographic factors, physical and cultural, that are basic to understanding historical development of Portuguese South America and contemporary economic and cultural geography of Brazil. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG172C"
  },
  {
    "course_code": "GEOG 173A",
    "units": 4,
    "title": "Cities of Europe",
    "description": "(Formerly numbered 152.) Lecture, three hours; reading period, one hour. Limited to juniors/seniors. Urbanization of Europe, growth of city systems and internal spatial structure, functions, and geographic problems of contemporary European cities. Particular attention to historical development and landscapes of capital cities such as Rome, Paris, and Berlin. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG173A"
  },
  {
    "course_code": "GEOG 174A",
    "units": 4,
    "title": "The Mediterranean World",
    "description": "(Formerly numbered 183.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Study of geographic factors, physical and cultural, that are basic to understanding historical development of Mediterranean region, with emphasis on 1500s to present. Introduction to great disputes in history and ecology centered on this region and character of two shores of Mediterranean basin. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG174A"
  },
  {
    "course_code": "GEOG 175A",
    "units": 4,
    "title": "Japan in World: Culture, Place, and Global Connections",
    "description": "(Formerly numbered 139.) Lecture, three hours; reading period, one hour. Focus on questions of culture and place in Japan. Exploration of ways that these questions—and Japan itself—have been shaped by historical and contemporary interactions involving people in both Japan and other parts of world. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG175A"
  },
  {
    "course_code": "GEOG 175B",
    "units": 4,
    "title": "Contemporary China",
    "description": "(Formerly numbered 186.) Lecture, three hours; reading period, one hour. Designed for juniors/seniors. Systematic geographic analysis of elements of landscape, resources, population, and socioeconomic characteristics of People’s Republic of China. Dynamics that have led to China’s major role in East Asian and international scene, with special attention to China-Japan and Sino-American relations and their geographic bases. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG175B"
  },
  {
    "course_code": "GEOG 176A",
    "units": 4,
    "title": "Southeast Asia",
    "description": "(Formerly numbered 185.) Lecture, three hours; reading period, one hour. Limited to juniors/seniors. Regional synthesis with varying emphasis on people of South or Southeast Asia in their physical, biotic, and cultural environment and its dynamic transformation. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG176A"
  },
  {
    "course_code": "GEOG 178",
    "units": 3,
    "title": "Conservation Geography Field and Professional Practices",
    "description": "Fieldwork, eight hours; research group meeting, three hours; one-, three-, and four-day field trips. Limited to senior Geography and Geography/Environmental Studies majors. Enrollment by application. Field focus on California vegetation and its response to current and future climate change. Students learn to collect field data, and to conduct field vegetation research. Students learn to work as professional research consultants in teams, develop consulting research proposals, consultant assessment reports, and present those reports orally and in written format to clients. Field trips to Mojave Desert, Great Basin Desert, pinyon pine woodland, pine-fire forest, alpine treeline, White Mountains, Sierra Nevada, and coastal pine and redwood forests. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG178"
  },
  {
    "course_code": "GEOG 180",
    "units": 4,
    "title": "Cartography",
    "description": "(Formerly numbered 167.) Lecture, two hours; laboratory, four hours. Enforced requisite: course 7. Designed for juniors/seniors. Survey of field of cartography. Theory and construction of map projections, compilation procedures, principles of generalization, symbolization, terrain representation, lettering, drafting and scribing, and map reproduction methods. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 7"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG180"
  },
  {
    "course_code": "GEOG 181A",
    "units": 4,
    "title": "Intermediate Geographic Information Systems",
    "description": "(Formerly numbered 168.) Lecture, two hours; laboratory, two hours. Enforced requisite: course 7. Extension of basic concepts presented in course 7. How geographic and spatial analyses inform, integrate, and extend scientific inquiry in physical, life, and social sciences. Discussion of range of decisions and critical judgments necessary to carry out sound spatial analyses. Development of technical proficiency within geographic information systems (GIS) environment. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 7"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG181A"
  },
  {
    "course_code": "GEOG 181B",
    "units": 4,
    "title": "Advanced Geographic Information Systems",
    "description": "(Formerly numbered 170.) Lecture, three hours; discussion, one hour. Enforced requisite: course 181A. Introduction to full geographic information systems (GIS) functionality, using ARC/INFO on UNIX workstations. Spatial manipulation, query, and computation of datasets carried out in project-oriented approach. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 181A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG181B"
  },
  {
    "course_code": "GEOG 181C",
    "units": 4,
    "title": "Geographic Information Systems Programming and Development",
    "description": "(Formerly numbered 173.) Lecture, two hours; laboratory, two hours. Enforced requisite: course 181A. Introduction to fundamental concepts and architecture of programming objects in widely used geographic information systems (GIS), and programming in GIS environment. Topics include GIS customization and development using variety of programming languages. Lectures followed by laboratory exercises. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 181A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG181C"
  },
  {
    "course_code": "GEOG 182A",
    "units": 4,
    "title": "Introduction to Remote Sensing",
    "description": "(Formerly numbered 169.) Lecture, two hours; laboratory, one hour. Enforced requisite: course 7. Introduction to fast-growing field of environmental monitoring from space. Application of Landsat, radar, Global Positioning System (GPS), and Earth Observing System satellites to land-use change, oceanography, meteorology, and environmental monitoring. Introduction to digital image-processing and imaging geographic information systems (GIS) software. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 7"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG182A"
  },
  {
    "course_code": "GEOG 182B",
    "units": 4,
    "title": "Remote Sensing: Digital Image Processing and Analysis",
    "description": "(Formerly numbered 172.) Lecture, three hours; laboratory, one hour. Enforced requisite: course 182A. Digital processing methods for manipulating and analyzing image data. Topics include statistical description, geometric and radiometric correction, classification, image enhancement and filtering, and change detection schemes. Reinforcement of procedures presented in lecture with laboratory exercises and student project. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 182A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG182B"
  },
  {
    "course_code": "GEOG 182C",
    "units": 5,
    "title": "Advanced Remote Sensing",
    "description": "(Formerly numbered 174.) Lecture, three hours; laboratory, two hours. Requisite: course 182A. Remote sensing in visible and infrared wavelength regions to understand basic concepts of radiation propagation and interaction with matter, how digital remote sensing images are acquired, and constraints on available data and data analysis. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 182A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG182C"
  },
  {
    "course_code": "GEOG 184",
    "units": 4,
    "title": "Environmental Modeling",
    "description": "(Formerly numbered 166.) Lecture, one hour; laboratory, two hours. Presentation of basic concepts related to computer modeling of biogeochemical cycles, geomorphic processes, and other phenomena relevant to changing Earth and its inhabitants. Laboratory exercises include building basic computer models and working with existing models. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG184"
  },
  {
    "course_code": "GEOG 185",
    "units": 5,
    "title": "Field Methods in Physical Geography",
    "description": "(Formerly numbered 177.) Lecture, three hours; laboratory, three hours. Enforced requisite: course 182A. Examination of field procedures and concepts used in observation, measurement, analysis, and interpretation of physical phenomena pertinent to natural and built environment. Topics vary from year to year and may include soils, geomorphology, and field methods in geographic information science. May be repeated for credit with topic change. P/NP or letter grading.",
    "prerequisites": [
      "GEOG 182A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG185"
  },
  {
    "course_code": "GEOG M186",
    "units": 4,
    "title": "Introduction to Spatial Statistics",
    "description": "(Formerly numbered M171.) (Same as Statistics M171.) Lecture, three hours; laboratory, one hour. Requisite: one course from Statistics 10, 12, 13. Introduction to methods of measurement and interpretation of geographic distributions and associations. P/NP or letter grading.",
    "prerequisites": [
      "STATS 10",
      "STATS 12",
      "STATS 13"
    ],
    "cross_listed": [
      "STATS M171"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOGM186"
  },
  {
    "course_code": "GEOG 187",
    "units": 4,
    "title": "Research and Writing in Human Geography",
    "description": "(Formerly numbered 161.) Seminar, three hours. Limited to seniors. Writing and research are two key aspects of what human geographers do. Students improve writing through proposing and conducting self-directed research project. Students should come with idea of topic of interest. Students learn process of doing geography research, including how to ask good research questions, how to search for relevant sources, how to construct argument, how to build literature review, and how to properly cite and incorporate academic sources. Culminating final paper on topic of choice. Weekly class workshops offer opportunity to exchange work with peers, giving useful feedback and opportunity to learn how to offer feedback and how to incorporate feedback into editing their work. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG187"
  },
  {
    "course_code": "GEOG 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG188SA"
  },
  {
    "course_code": "GEOG 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "GEOG 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG188SB"
  },
  {
    "course_code": "GEOG 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "GEOG 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG188SC"
  },
  {
    "course_code": "GEOG 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG189"
  },
  {
    "course_code": "GEOG 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG189HC"
  },
  {
    "course_code": "GEOG 191",
    "units": 4,
    "title": "Variable Topics Research Seminars: Geography",
    "description": "Seminar, three hours. Research seminars on selected topics in geography. Some sections may require prior coursework. Consult Schedule of Classes for topics and instructors. May be repeated for credit and may be applied as elective units toward departmental majors and minors. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG191"
  },
  {
    "course_code": "GEOG 195",
    "units": 4,
    "title": "Community or Corporate Internships in Geography",
    "description": "Tutorial, four hours. Limited to juniors/seniors. Internship of eight to 10 hours per week in supervised setting in community agency or business. Students meet on regular basis with instructor and provide periodic reports of their experience. May be repeated for credit. Individual contract with supervising faculty member required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG195"
  },
  {
    "course_code": "GEOG 198A",
    "units": 4,
    "title": "Honors Research in Geography I",
    "description": "Tutorial, to be arranged. Preparation: 3.25 grade-point average overall, at least five upper-division geography courses with 3.5 grade-point average. Limited to juniors/seniors. Development and completion of honors thesis or comprehensive research project under direct supervision of one or two faculty members. May be repeated for maximum of 16 units. Individual contract required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG198A"
  },
  {
    "course_code": "GEOG 198B",
    "units": 4,
    "title": "Honors Research in Geography II",
    "description": "Tutorial, to be arranged. Preparation: 3.25 grade-point average overall, at least five upper-division geography courses with 3.5 grade-point average. Limited to juniors/seniors. Development and completion of honors thesis or comprehensive research project under direct supervision of one or two faculty members. May be repeated for maximum of 16 units. Individual contract required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG198B"
  },
  {
    "course_code": "GEOG 199",
    "units": 2,
    "title": "Special Study",
    "description": "Tutorial, to be arranged. Limited to juniors with B average in major or seniors. May be repeated for maximum of 16 units. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GEOG199"
  }
]