[
  {
    "course_code": "GLBL ST 1",
    "units": 5,
    "title": "Introduction to Globalization",
    "description": "Lecture, three hours; discussion, one hour. Introduction to concept and history of globalization, and to political, economic, social, and environmental dimensions of global integration today. Topics include finance and trade, colonialism, Industrial Revolution, urbanization, immigration, and climate change, among others. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST1"
  },
  {
    "course_code": "GLBL ST 10",
    "units": 2,
    "title": "International Diplomacy and Foreign Affairs",
    "description": "Lecture, 15 hours; discussion, 15 hours. Limited to high school students participating in Model United Nations (UN) Summer Institute. One-week intensive summer course, including lectures in international relations and outside study. Development of position papers in simulation of United Nations and final presentation in respective UN committees. Particular emphasis on public speaking and cooperative debate. May be repeated for credit without limitation. Offered only as part of Summer Institute. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST10"
  },
  {
    "course_code": "GLBL ST 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST19"
  },
  {
    "course_code": "GLBL ST 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST89"
  },
  {
    "course_code": "GLBL ST 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST89HC"
  },
  {
    "course_code": "GLBL ST 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST99"
  },
  {
    "course_code": "GLBL ST 102",
    "units": 5,
    "title": "Globalization: Markets and Resources",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 1. Examination of how domestic and international politics determine how global economy is governed. Topics include monetary and capital policy, trade, international investment, and migration. Letter grading.",
    "prerequisites": [
      "GLBL ST 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST102"
  },
  {
    "course_code": "GLBL ST 103",
    "units": 5,
    "title": "Globalization: Governance and Conflict",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 1. Exploration of globalization of governance and its effect on outbreak, management, and resolution of disputes, violence, and conflict. Review of international and regional institutions and their interaction with contemporary issues, which may include terrorism, human rights, climate change, and cybersecurity. Letter grading.",
    "prerequisites": [
      "GLBL ST 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST103"
  },
  {
    "course_code": "GLBL ST 104",
    "units": 5,
    "title": "Globalization: Culture and Society",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 1. Investigation of circulation of peoples, goods, and media to examine interactions of globalization with local culture and formation of global cultures through practices and processes of globalization. Letter grading.",
    "prerequisites": [
      "GLBL ST 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST104"
  },
  {
    "course_code": "GLBL ST 110A",
    "units": 5,
    "title": "Globalization in Context",
    "description": "Lecture, six hours. Requisite: course 100B. Corequisite: course 110B. Culture, economy, history, and politics of different locations around world and how they are affected by globalization. Field trips included to gain first-hand experience of these processes. Offered in summer only. P/NP or letter grading.",
    "prerequisites": [
      "GLBL ST 100B"
    ],
    "corequisites": [
      "GLBL ST 110B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST110A"
  },
  {
    "course_code": "GLBL ST 110B",
    "units": 5,
    "title": "Globalization in Context Research Seminar",
    "description": "Seminar, six hours. Requisite: course 100B. Corequisite: course 110A. Individual research projects on different aspects of globalization process in locations around world. Offered in summer only. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GLBL ST 100B"
    ],
    "corequisites": [
      "GLBL ST 110A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST110B"
  },
  {
    "course_code": "GLBL ST 112AD",
    "units": 5,
    "title": "Globalization in Context: Markets and Resources",
    "description": "Lecture, six hours. Requisite: course 102. Corequisite: course 112BD. Examination of development of markets and businesses in globalized world. Field trips included to gain first-hand experience of these processes. Offered in summer only. P/NP or letter grading.",
    "prerequisites": [
      "GLBL ST 102"
    ],
    "corequisites": [
      "GLBL ST 112BD"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST112AD"
  },
  {
    "course_code": "GLBL ST 112BD",
    "units": 5,
    "title": "Globalization in Context Seminar: World Markets and Resources",
    "description": "Seminar, six hours. Requisite: course 102. Corequisite: course 112AD. Examination of role of markets and businesses in globalized world. Offered in summer only. P/NP or letter grading.",
    "prerequisites": [
      "GLBL ST 102"
    ],
    "corequisites": [
      "GLBL ST 112AD"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST112BD"
  },
  {
    "course_code": "GLBL ST 113AD",
    "units": 5,
    "title": "Globalization in Context: Governance and Conflict",
    "description": "Lecture, six hours. Requisite: course 103. Corequisite: course 113BD. History, politics, philosophy, and governance of global governance and how they are affected by globalization. Field trips included to gain first-hand experience of these processes. Offered in summer only. P/NP or letter grading.",
    "prerequisites": [
      "GLBL ST 103"
    ],
    "corequisites": [
      "GLBL ST 113BD"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST113AD"
  },
  {
    "course_code": "GLBL ST 113BD",
    "units": 5,
    "title": "Globalization in Context Seminar: World Governance",
    "description": "Seminar, six hours. Requisite: course 103. Corequisite: course 113AD. History, politics, philosophy, and governance of global governance and how they are affected by globalization. Offered in summer only. P/NP or letter grading.",
    "prerequisites": [
      "GLBL ST 103"
    ],
    "corequisites": [
      "GLBL ST 113AD"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST113BD"
  },
  {
    "course_code": "GLBL ST 114AD",
    "units": 5,
    "title": "Globalization in Context: Culture and Society",
    "description": "Lecture, six hours. Requisite: course 104. Corequisite: course 114BD. Culture, economy, history, and politics of race, gender, and religion and how they are affected by globalization. Field trips included to gain first-hand experience of these processes. Offered in summer only. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GLBL ST 104"
    ],
    "corequisites": [
      "GLBL ST 114BD"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST114AD"
  },
  {
    "course_code": "GLBL ST 114BD",
    "units": 5,
    "title": "Globalization in Context Seminar: World Culture and Society",
    "description": "Seminar, six hours. Requisite: course 104. Corequisite: course 114AD. Individual research projects on different aspects of globalization process in locations around world, including racial and gender identities. Offered in summer only. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "prerequisites": [
      "GLBL ST 104"
    ],
    "corequisites": [
      "GLBL ST 114AD"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST114BD"
  },
  {
    "course_code": "GLBL ST 120",
    "units": 4,
    "title": "Introduction to International Business",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Over last five decades, world has increasingly become globalized, presenting many new opportunities for businesses and entrepreneurs. However, recent world events have demonstrated volatile nature of globalization and pitfalls that can also manifest for firms doing business in global setting. Students gain understanding of dynamic environment of international business, and how firm managers navigate complex world of international business to capitalize upon opportunities and mitigate against risks. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST120"
  },
  {
    "course_code": "GLBL ST 125",
    "units": 4,
    "title": "Los Angeles as Global City: Exporter and Importer of Global Culture",
    "description": "Lecture, three hours; discussion, one hour. Study of phenomenon of globalization through prominent case of Los Angeles. Focus on how city produces global culture, including filmed entertainment and culture of celebrity and food; and how it absorbs cultural inputs from world over. Emphasis on interactive relationship between export and import of global culture. City’s distinct cultural milieu influences nature of its cultural exports, but its viability as cultural capital depends on its ability to accommodate integrate diversity of cultures. Study creates immersive experience through films, guest speakers, and urban field trips. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST125"
  },
  {
    "course_code": "GLBL ST 140",
    "units": 4,
    "title": "Hollywood and the Immigrant Experience in America",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Hollywood movies and television shows often marginalize performers from Asian, Indian, and Middle Eastern backgrounds and contain negative cultural stereotypes of them. Over the last decade, artists from these immigrant communities have started a marked change in the entertainment industry and are challenging the dominant narrative. Examination of works and writings of unique artists who are redefining the American immigrant experience in the popular imagination. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST140"
  },
  {
    "course_code": "GLBL ST 141",
    "units": 4,
    "title": "Hollywood and Tales of Underrepresented Communities",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Hollywood movies and television shows often marginalize performers from Central American, South American, and Native American backgrounds and contain negative stereotypes of them. But in recent times, artists from these communities have risen in cultural prominence and they are challenging the dominant narrative. Examination of the works, performances, and writings of artists who are redefining the diversity of the American experience in the popular imagination. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST141"
  },
  {
    "course_code": "GLBL ST 145",
    "units": 4,
    "title": "Rethinking Global Capitalism: Race, Class, Gender, History",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Requisite: course 1. Reconsideration of histories and geographies of global capitalism. Displacing industrial revolution from Britain out into colonial world, transatlantic slave trade, and attempted genocide of indigenous peoples in Americas, study of new map of global capitalism and new histories of globalization. Study covers capitalism; embodiment and gender; capitalism and environmental crisis; and new issues in digital capitalism, gig economy, and social media. Letter grading.",
    "prerequisites": [
      "GLBL ST 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST145"
  },
  {
    "course_code": "GLBL ST 160",
    "units": 4,
    "title": "Selected Topics in Global Studies",
    "description": "Lecture, three hours; discussion, one hour (when scheduled). Examination of one or more topics related to global studies. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST160"
  },
  {
    "course_code": "GLBL ST M161",
    "units": 4,
    "title": "Special Topics in Global Studies and Public Policy",
    "description": "(Same as Public Policy CM191G.) Seminar, three hours. Examination of one or more topics related to public policy and global studies. May be repeated for credit with topic change. P/NP or letter grading.",
    "cross_listed": [
      "PUB PLC CM191G"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLSTM161"
  },
  {
    "course_code": "GLBL ST M177",
    "units": 4,
    "title": "Superfoods: Cultural and Global Perspectives",
    "description": "(Same as Food Studies M177 and International Development Studies M177.) Seminar, four hours. Exploration of superfoods, which are nutrient rich foods considered beneficial for well-being, health, and longevity, as they are high in minerals, vitamins, and antioxidants. While superfoods have been part of cultures’ diets for centuries, in recent decades they have been researched in scientific and medical communities. Citizens globally have begun to increasingly demand and consume foods that are nutritious, organic, and sustainable. It is important also to address issues such as marketing, misinformation, and hyper about superfoods. Surge of interest in superfoods is increasingly important in context of ongoing global inequities with regards to food access and production. Study addresses paradox that communities cope simultaneously with malnutrition/hunger and obesity, and how farming practices for superfoods and staple crops are related. P/NP or letter grading.",
    "cross_listed": [
      "INTL DV M177",
      "FOOD ST M177"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLSTM177"
  },
  {
    "course_code": "GLBL ST 188A",
    "units": 4,
    "title": "Special Topics in Global Studies",
    "description": "Seminar, three hours. Program-sponsored experimental or temporary courses, such as those taught by resident or visiting faculty members. May be repeated for credit with topic change. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST188A"
  },
  {
    "course_code": "GLBL ST 188B",
    "units": 4,
    "title": "Special Topics in Global Studies",
    "description": "Seminar, three hours. Program-sponsored experimental or temporary courses, such as those taught by resident or visiting faculty members. May be repeated for credit with topic change. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST188B"
  },
  {
    "course_code": "GLBL ST 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST188SA"
  },
  {
    "course_code": "GLBL ST 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "GLBL ST 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST188SB"
  },
  {
    "course_code": "GLBL ST 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "GLBL ST 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST188SC"
  },
  {
    "course_code": "GLBL ST 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST189"
  },
  {
    "course_code": "GLBL ST 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST189HC"
  },
  {
    "course_code": "GLBL ST 191",
    "units": 4,
    "title": "Variable Topics Research Seminars: Global Studies—Senior Seminar",
    "description": "Seminar, three hours. Enforced requisites: courses 110A, 110B. Limited to senior Global Studies majors. Organized on topics basis with readings, discussions, papers, and development of culminating project. May not be repeated for credit. Letter grading.",
    "prerequisites": [
      "GLBL ST 110A",
      "GLBL ST 110B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST191"
  },
  {
    "course_code": "GLBL ST 192",
    "units": 2,
    "title": "Undergraduate Practicum in Global Studies",
    "description": "Seminar, two hours; practicum, to be arranged. Limited to juniors/seniors. Training and supervised practicum for advanced undergraduate students to serve as undergraduate course assistants in global studies courses. Students assist in preparation and presentation of materials and development of innovative programs with guidance of faculty members. May not be applied toward major requirements. May be repeated for credit. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST192"
  },
  {
    "course_code": "GLBL ST 194",
    "units": 1,
    "title": "Research Group Seminars",
    "description": "Seminar, two hours. Designed to encourage participation and stimulate progress in specific research areas for undergraduate students who are part of departmental research group or internship. Discussion of research methods or current literature in field of global studies or of research of faulty members or students. May be repeated for credit. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST194"
  },
  {
    "course_code": "GLBL ST 199",
    "units": 4,
    "title": "Directed Research in Global Studies",
    "description": "Tutorial, to be arranged. Limited to juniors/seniors. Supervised individual research under guidance of faculty mentor. Culminating paper required. May be applied toward requirements via petition. May be repeated for credit. Individual contract required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST199"
  },
  {
    "course_code": "GLBL ST 199A",
    "units": 4,
    "title": "Directed Research in Global Studies",
    "description": "Tutorial, to be arranged. Limited to senior Global Studies majors. Supervised individual research under guidance of faculty mentor. Culminating paper required or comprehensive outline if pursuing departmental honors. Individual contract required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST199A"
  },
  {
    "course_code": "GLBL ST 199B",
    "units": 4,
    "title": "Directed Individual Research in Global Studies",
    "description": "Tutorial, one hour. Requisite: course 199A. Limited to senior Global Studies majors. Supervised individual research or investigation under guidance of faculty mentor. Final drafting and submission of senior thesis. Culminating paper of 35 to 50 pages required. Individual contract required. Letter grading.",
    "prerequisites": [
      "GLBL ST 199A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/GLBLST199B"
  }
]