[
  {
    "course_code": "IRANIAN 1A",
    "units": 5,
    "title": "Elementary Persian",
    "description": "Lecture, six hours. Course 1A is enforced requisite to 1B, which is enforced requisite to 1C. Not open to students with prior knowledge of Persian. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN1A"
  },
  {
    "course_code": "IRANIAN 1B",
    "units": 5,
    "title": "Elementary Persian",
    "description": "Lecture, six hours. Enforced requisite: course 1A. Not open to students with prior knowledge of Persian. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 2"
    ],
    "prerequisites": [
      "IRANIAN 1A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN1B"
  },
  {
    "course_code": "IRANIAN 1C",
    "units": 5,
    "title": "Elementary Persian",
    "description": "Lecture, six hours. Enforced requisite: course 1B. Not open to students with prior knowledge of Persian. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 3"
    ],
    "prerequisites": [
      "IRANIAN 1B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN1C"
  },
  {
    "course_code": "IRANIAN 8",
    "units": 15,
    "title": "Elementary Persian: Intensive",
    "description": "Lecture, 10 hours; discussion, 10 hours. Not open to students who have learned, from whatever source, enough Persian to qualify for more advanced courses. Intensive course equivalent to courses 1A, 1B, and 1C. Introduction to fundamentals of Persian, including pronunciation, grammar, and Persian script, with emphasis on all four basic language skills—speaking, listening comprehension, reading, and writing. Offered in summer only. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 3"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN8"
  },
  {
    "course_code": "IRANIAN 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN19"
  },
  {
    "course_code": "IRANIAN 20A",
    "units": 6,
    "title": "Accelerated Elementary Persian",
    "description": "Lecture, four hours; discussion two hours; laboratory, 30 minutes per day. Preparation: some knowledge of spoken Persian. Course 20A is enforced requisite to 20B, which is enforced requisite to 20C. Intensive and thorough study of fundamental structure of Persian grammar; reading from a wide range of classical and modern poetry and prose compositions. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN20A"
  },
  {
    "course_code": "IRANIAN 20B",
    "units": 6,
    "title": "Accelerated Elementary Persian",
    "description": "Lecture, four hours; discussion two hours; laboratory, 30 minutes per day. Preparation: some knowledge of spoken Persian. Enforced requisite: course 20A. Intensive and thorough study of fundamental structure of Persian grammar; reading from a wide range of classical and modern poetry and prose compositions. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 2"
    ],
    "prerequisites": [
      "IRANIAN 20A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN20B"
  },
  {
    "course_code": "IRANIAN 20C",
    "units": 6,
    "title": "Accelerated Elementary Persian",
    "description": "Lecture, four hours; discussion two hours; laboratory, 30 minutes per day. Preparation: some knowledge of spoken Persian. Enforced requisite: course 20B. Intensive and thorough study of fundamental structure of Persian grammar; reading from a wide range of classical and modern poetry and prose compositions. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 3"
    ],
    "prerequisites": [
      "IRANIAN 20B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN20C"
  },
  {
    "course_code": "IRANIAN 55",
    "units": 5,
    "title": "Gender and Sexuality in Arts and Literatures of Iran and Middle East",
    "description": "Lecture, three hours; discussion, one hour. Multifaceted introduction to Persian poetry, recognized as jewel of Persian culture, and to pictorial, architectural, performative, cinematographic, and photographic dimensions of artistic milieu spanning between Balkans, India, and Central Asia from 10th century CE to present. With consideration of centrality of discourses on identity, desire, and spirituality to core of Persian aesthetics, study of broad variety of socioanthropological, ethical, and historiographical issues stemming from both mainstream topics characterizing extensive field of Iranian studies and most controversial conversations on nature of sexuality, ethnicity, and religion. P/NP or letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)",
      "General Education - Visual & Performance Arts Analysis & Practice (Arts & Humanities)",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN55"
  },
  {
    "course_code": "IRANIAN M60",
    "units": 5,
    "title": "Achaemenid Civilization and Empire of Alexander",
    "description": "(Same as Ancient Near East M60 and History M60.) Lecture, three hours; discussion, one hour. Survey of period from circa 600 to 300 BCE, rise and fall of Achaemenid Persia, first world empire of antiquity, which was ended by Alexander the Great, whose campaigns were as transformative as they were violent. Alexander connected ancient Mediterranean and Near East as never before, ushering in new era and forever changing cultural landscape of ancient world. Focus on themes of ancient kingship and political ideology; comparative study of empires; administration and institutions; and religious and ethnic diversity in large, heterogeneous states. Emphasis on diversity critical to understanding political nuances of ancient world. Students gain broad knowledge of Achaemenid and Macedonian empires, facility with ancient primary sources, and development of analytical skills central to discipline of history that allow conceptualizing issues of diversity and othering in ancient world. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "equivalent_courses": [
      "HIST M60W",
      "IRANIAN M60W",
      "AN N EA M60W"
    ],
    "cross_listed": [
      "AN N EA M60",
      "HIST M60"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIANM60"
  },
  {
    "course_code": "IRANIAN M60W",
    "units": 5,
    "title": "Achaemenid Civilization and Empire of Alexander",
    "description": "(Same as Ancient Near East M60W and History M60W.) Lecture, three hours; discussion, one hour. Requisite: English Composition 3. Not open for credit to students with credit for course M60. Survey of period from circa 600 to 300 BCE, rise and fall of Achaemenid Persia, first world empire of antiquity, which was ended by Alexander the Great, whose campaigns were as transformative as they were violent. Alexander connected ancient Mediterranean and Near East as never before, ushering in new era and forever changing cultural landscape of ancient world. Focus on themes of ancient kingship and political ideology; comparative study of empires; administration and institutions; and religious and ethnic diversity in large, heterogeneous states. Emphasis on diversity critical to understanding political nuances of ancient world. Students gain broad knowledge of Achaemenid and Macedonian empires, facility with ancient primary sources, and development of analytical skills central to discipline of history that allow conceptualizing issues of diversity and othering in ancient world. Satisfies Writing II requirement. P/NP or letter grading.",
    "satisfies": [
      "Writing II",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "prerequisites": [
      "ENGCOMP 3"
    ],
    "equivalent_courses": [
      "AN N EA M60",
      "IRANIAN M60",
      "HIST M60"
    ],
    "cross_listed": [
      "HIST M60W",
      "AN N EA M60W"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIANM60W"
  },
  {
    "course_code": "IRANIAN 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN89"
  },
  {
    "course_code": "IRANIAN 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN89HC"
  },
  {
    "course_code": "IRANIAN 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN99"
  },
  {
    "course_code": "IRANIAN 102A",
    "units": 5,
    "title": "Intermediate Persian",
    "description": "Lecture, six hours. Requisite: course 1C or 20C. Course 102A is requisite to 102B, which is requisite to 102C. P/NP or letter grading.",
    "prerequisites": [
      "IRANIAN 1C",
      "IRANIAN 20C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN102A"
  },
  {
    "course_code": "IRANIAN 102B",
    "units": 5,
    "title": "Intermediate Persian",
    "description": "Lecture, six hours. Requisite: course 102A. P/NP or letter grading.",
    "prerequisites": [
      "IRANIAN 102A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN102B"
  },
  {
    "course_code": "IRANIAN 102C",
    "units": 5,
    "title": "Intermediate Persian",
    "description": "Lecture, six hours. Requisite: course 102B. P/NP or letter grading.",
    "prerequisites": [
      "IRANIAN 102B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN102C"
  },
  {
    "course_code": "IRANIAN 103A",
    "units": 4,
    "title": "Advanced Persian: Introduction to Classical Persian Poetry",
    "description": "Lecture, three hours. Requisite: course 102C. Students who do exceptionally well in course 20C may be permitted to enroll with consent of instructor. May be taken independently for credit. P/NP or letter grading.",
    "prerequisites": [
      "IRANIAN 102C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN103A"
  },
  {
    "course_code": "IRANIAN 103B",
    "units": 4,
    "title": "Advanced Persian: Introduction to Classical Persian Prose",
    "description": "Lecture, three hours. Requisite: course 102C. Students who do exceptionally well in course 20C may be permitted to enroll with consent of instructor. May be taken independently for credit. P/NP or letter grading.",
    "prerequisites": [
      "IRANIAN 102C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN103B"
  },
  {
    "course_code": "IRANIAN 103C",
    "units": 4,
    "title": "Advanced Persian: Introduction to Contemporary Persian Poetry and Prose",
    "description": "Lecture, three hours. Requisite: course 102C. Students who do exceptionally well in course 20C may be permitted to enroll with consent of instructor. May be taken independently for credit. P/NP or letter grading.",
    "prerequisites": [
      "IRANIAN 102C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN103C"
  },
  {
    "course_code": "IRANIAN 104",
    "units": 4,
    "title": "Philosophical Texts",
    "description": "Lecture, three hours. Readings in English. Introduction to wide selection of philosophical texts in translation. Identification of major philosophical themes in ontology, epistemology, psychology, and cosmology through texts, with study in detail. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN104"
  },
  {
    "course_code": "IRANIAN M105A",
    "units": 4,
    "title": "Bahá'í Faith in Iran: Historical and Sociological Survey",
    "description": "(Same as Religion M105A.) Lecture, three hours. Readings in English. Rise and development of Bábí and Bahá’í religions in context of 19th century Iran. Focus on personalities of Báb, Bahá’u’lláh, and ‘Abdu’l-Bahá. May be taken independently for credit. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M105A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIANM105A"
  },
  {
    "course_code": "IRANIAN M105B",
    "units": 4,
    "title": "Bahá'í Faith in Iran: Survey of Bahá'í Scriptures and Thought",
    "description": "(Same as Religion M105B.) Lecture, three hours. Readings in English. Analysis of major writings by Báb, Bahá’u’lláh, and ‘Abdu’l-Bahá. Emphasis on mystical and social principles. May be taken independently for credit. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M105B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIANM105B"
  },
  {
    "course_code": "IRANIAN M105C",
    "units": 4,
    "title": "Bahá'í Faith in Iran: 20th Century-Iran and the Bahá'ís",
    "description": "(Same as Religion M105C.) Lecture, three hours. Readings in English. Focus on history of 20th-century Iran beginning with constitutional revolution, development and persecution of Bahá’í community, and latter’s relation to reform movements in Iran. May be taken independently for credit. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M105C",
      "RELIGN 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIANM105C"
  },
  {
    "course_code": "IRANIAN M110A",
    "units": 4,
    "title": "Iranian Civilization: History of Achaemenid Empire",
    "description": "(Same as Ancient Near East M110A and History M110A.) Lecture, three hours; discussion, one hour (when scheduled). From end of Elam and rise of Medes to Macedonian conquest of Achaemenid Persia. Emphasis on political history, state structure, empire’s religions, and Greco-Persian interactions. Further accents on Cyrus’ empire and Darius’ world order, age of Persian Wars, Cyrus the Younger, Achaemenid Egypt, Alexander’s conquest. P/NP or letter grading.",
    "cross_listed": [
      "HIST M110A",
      "AN N EA M110A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIANM110A"
  },
  {
    "course_code": "IRANIAN M110B",
    "units": 4,
    "title": "Iranian Civilization: History of Arsacid (Parthian) Empire",
    "description": "(Same as Ancient Near East M110B and History M110B.) Lecture, three hours; discussion, one hour (when scheduled). From Hellenistic rule in Persia to Sasanian conquest. Emphasis on political history, state structure, empire’s religions, interactions with Hellenistic and Roman worlds. Further accent on Parthian conquest of Iran and Mesopotamia, Seleucid demise and Arsacid hegemony in East, Arsacid-Roman wars, rise of Sasanians. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M110B",
      "HIST M110B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIANM110B"
  },
  {
    "course_code": "IRANIAN M110C",
    "units": 4,
    "title": "Iranian Civilization: History of Early Sasanian Empire—From Ardashir I to Rise of Peroz (circa 224-459 CE)",
    "description": "(Same as Ancient Near East M110C and History M110C.) Lecture, three hours; discussion, one hour (when scheduled). From fall of Arsacids to Muslim conquest of Iran. Emphasis on political and economic history, evolution of state structure, empire’s religious landscape (Mazdism, Manicheism, Exilarchate, Church of Persia, Mazdakism), Persian and Roman/Byzantine interactions, Persia and East. Further accent on Persian-Roman conflicts and cooperation, Persia and Huns. P/NP or letter grading.",
    "cross_listed": [
      "HIST M110C",
      "HIST 224",
      "AN N EA M110C",
      "AN N EA 224"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIANM110C"
  },
  {
    "course_code": "IRANIAN M115A",
    "units": 4,
    "title": "Elementary Azeri",
    "description": "(Same as Turkic Languages M115A.) Lecture, five hours. Knowledge of Russian, Turkish, and Iranian helpful. Grammatical competence at elementary level; knowledge of basic facts of Azeri grammar; reading competence with help of dictionary; ability to write simple compositions; basic conversational skill. P/NP or letter grading.",
    "cross_listed": [
      "TURKIC M115A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIANM115A"
  },
  {
    "course_code": "IRANIAN M115B",
    "units": 4,
    "title": "Elementary Azeri",
    "description": "(Same as Turkic Languages M115B.) Lecture, five hours. Knowledge of Russian, Turkish, and Iranian helpful. Grammatical competence at elementary level; knowledge of basic facts of Azeri grammar; reading competence with help of dictionary; ability to write simple compositions; basic conversational skill. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 2"
    ],
    "cross_listed": [
      "TURKIC M115B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIANM115B"
  },
  {
    "course_code": "IRANIAN M115C",
    "units": 4,
    "title": "Elementary Azeri",
    "description": "(Same as Turkic Languages M115C.) Lecture, five hours. Knowledge of Russian, Turkish, and Iranian helpful. Grammatical competence at elementary level; knowledge of basic facts of Azeri grammar; reading competence with help of dictionary; ability to write simple compositions; basic conversational skill. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 3"
    ],
    "cross_listed": [
      "TURKIC M115C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIANM115C"
  },
  {
    "course_code": "IRANIAN 120",
    "units": 4,
    "title": "Comparative Study of Six Major Persian Poets",
    "description": "Lecture, two hours; discussion, one hour. Preparation: knowledge of Persian. Lectures in Persian, readings in English and Persian. Comparative study of six major Persian poets from 10th to 14th century who shaped sense of Persian identity and delineated chief distinguishing characteristics of Persian thought and culture. May be repeated for credit with consent of instructor. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN120"
  },
  {
    "course_code": "IRANIAN 130",
    "units": 4,
    "title": "Intellectual History of Jews of Persia",
    "description": "Lecture, three hours. Readings in English. Introduction to intellectual history of Jews in Persia by highlighting select areas of Judeo-Persian studies and focusing on various authors and their work. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN130"
  },
  {
    "course_code": "IRANIAN 131",
    "units": 4,
    "title": "Introduction to Judeo-Persian: Literature and Culture",
    "description": "Lecture, three hours. Preparation: knowledge of Persian equivalent to course 102C. Introduction to history of Judeo-Persian literature and culture to prepare students to read Judeo-Persian texts. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN131"
  },
  {
    "course_code": "IRANIAN 132",
    "units": 4,
    "title": "Intermediate Judeo-Persian Literature and Culture",
    "description": "Lecture, three hours. Enforced requisites: courses 102C, 131. Literary study of Judeo-Persian literature, as segment of Iranian classical literature. Judeo-Persian literary genres, in forms of prose and verse, compared with their parallel genres in context of Iranian literature. Textual study of Judeo-Persian manuscripts, both print and cursive, and their variations depending on time period or locality. P/NP or letter grading.",
    "prerequisites": [
      "IRANIAN 102C",
      "IRANIAN 131"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN132"
  },
  {
    "course_code": "IRANIAN 140",
    "units": 4,
    "title": "Persian Belles Lettres (Adabiyyat)",
    "description": "Lecture, three hours. Requisite: course 102C. Study of major Persian poets and prose writers: prose—Sohravardi, Hamadâni, Nasafi, Irâqi, and others; poetry—Hâfez, Sa’di, Rûmi, Bahâr, Dehkhoda, and others. May be repeated for credit with consent of instructor. P/NP or letter grading.",
    "prerequisites": [
      "IRANIAN 102C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN140"
  },
  {
    "course_code": "IRANIAN 141",
    "units": 4,
    "title": "Persian Analytical Prose",
    "description": "Lecture, three hours. Requisite: course 102C. Study of selected analytical and expository prose texts, with emphasis on philosophy, sciences, literary criticism, and history. May be repeated for credit with consent of instructor. P/NP or letter grading.",
    "prerequisites": [
      "IRANIAN 102C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN141"
  },
  {
    "course_code": "IRANIAN 142",
    "units": 4,
    "title": "Persian Popular Ethics",
    "description": "Lecture, three hours. Requisite: course 102C. Study of major Persian works on popular ethics that have helped shape normative social, cultural, and political values in Iranian civilization. May be repeated for credit with consent of instructor. P/NP or letter grading.",
    "prerequisites": [
      "IRANIAN 102C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN142"
  },
  {
    "course_code": "IRANIAN 150A",
    "units": 4,
    "title": "Survey of Persian Literature in English",
    "description": "Lecture, three hours. Knowledge of Persian not required. May be taken independently for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN150A"
  },
  {
    "course_code": "IRANIAN 150B",
    "units": 4,
    "title": "Survey of Persian Literature in English",
    "description": "Lecture, three hours. Knowledge of Persian not required. May be taken independently for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN150B"
  },
  {
    "course_code": "IRANIAN 161A",
    "units": 4,
    "title": "Elementary Middle Iranian",
    "description": "Lecture, three hours. Preparation: knowledge of Persian desirable. Course 161A is requisite to 161B, which is requisite to 161C. Studies in grammars and texts of Middle Iranian languages (e.g., Middle Persian, Parthian, Sogdian, Khotanese, Bactrian). May be repeated for credit with consent of instructor. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN161A"
  },
  {
    "course_code": "IRANIAN 161B",
    "units": 4,
    "title": "Elementary Middle Iranian",
    "description": "Lecture, three hours. Requisite: course 161A. Studies in grammars and texts of Middle Iranian languages (e.g., Middle Persian, Parthian, Sogdian, Khotanese, Bactrian). May be repeated for credit with consent of instructor. P/NP or letter grading.",
    "prerequisites": [
      "IRANIAN 161A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN161B"
  },
  {
    "course_code": "IRANIAN 161C",
    "units": 4,
    "title": "Elementary Middle Iranian",
    "description": "Lecture, three hours. Requisite: course 161B. Studies in grammars and texts of Middle Iranian languages (e.g., Middle Persian, Parthian, Sogdian, Khotanese, Bactrian). May be repeated for credit with consent of instructor. P/NP or letter grading.",
    "prerequisites": [
      "IRANIAN 161B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN161C"
  },
  {
    "course_code": "IRANIAN CM163",
    "units": 4,
    "title": "Archaeology of Iran",
    "description": "(Same as Ancient Near East CM163.) Lecture, three hours. Designed to introduce students to Iranian archaeology from prehistoric through Achaemenid times. Concurrently scheduled with course CM259. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA CM163"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIANCM163"
  },
  {
    "course_code": "IRANIAN 164",
    "units": 4,
    "title": "Ancient Cities of Iran: Archaeological Survey of Historic Cities and Sites of Iran from 4000 BC to 1900 AD",
    "description": "Lecture, four hours. Introduction to archaeological and historical monuments and sites of Iran from earliest periods to early 20th century. Examination of emergence of early Iranian villages, formation of cities and their development and expansion throughout late Sasanian and early Islamic periods to preindustrial era in early years of past century. Study of selection of ancient Iranian sites and cities, from fifth millennium BC to Qajar period, based on relevant archaeological, historical, and geographical sources. Study of archaeology and historical geography of each site or city with aerial views, which reveal rich array of architecture and town planning—from ordinary settlements and vernacular constructions to worldly-known royal and religious monuments. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN164"
  },
  {
    "course_code": "IRANIAN 169",
    "units": 4,
    "title": "Civilization of Pre-Islamic Iran",
    "description": "Survey of Iranian culture from the beginning through Sasanian period.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN169"
  },
  {
    "course_code": "IRANIAN 170",
    "units": 4,
    "title": "Religion in Ancient Iran",
    "description": "History of religion in Iran from the beginning to the Mohammedan conquest; Indo-Iranian background, Zoroastrianism, Manichaeism, Mazdakism.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN170"
  },
  {
    "course_code": "IRANIAN M178",
    "units": 4,
    "title": "Introduction to History and Culture of Iranian Jews",
    "description": "(Same as History M178 and Jewish Studies M178.) Lecture, three hours. Introduction to political, intellectual, cultural, and socioeconomic status of Iranian Jews. Exploration of history of Iranian Jews from ancient period throughout history, with focus on post-Middle Ages to present time. Topics, studied from perspective of Iranian cultural and intellectual history, include identity and status, religious tolerance versus forced conversion, Iranian Jewish emancipation, and dynamic symbiosis between Iranian Jews and other Iranians. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M178",
      "HIST M178"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIANM178"
  },
  {
    "course_code": "IRANIAN 187",
    "units": 4,
    "title": "Variable Topics in Iranian Studies",
    "description": "Lecture, three hours. Variable topics; consult Schedule of Classes for topics to be offered in specific term. May be repeated for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN187"
  },
  {
    "course_code": "IRANIAN 188FL",
    "units": 2,
    "title": "Special Studies: Readings in Iranian",
    "description": "Seminar, two hours. Requisite: course 102C. Students must be concurrently enrolled in affiliated main course. Primary readings and advanced training in Iranian. Additional work in Iranian to enrich and augment work assigned in main course, including reading, writing, and other exercises in Iranian. P/NP or letter grading.",
    "prerequisites": [
      "IRANIAN 102C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN188FL"
  },
  {
    "course_code": "IRANIAN 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN189"
  },
  {
    "course_code": "IRANIAN 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN189HC"
  },
  {
    "course_code": "IRANIAN 197",
    "units": 2,
    "title": "Individual Studies in Iranian",
    "description": "Tutorial, one hour. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN197"
  },
  {
    "course_code": "IRANIAN 199",
    "units": 2,
    "title": "Directed Research or Senior Project in Iranian",
    "description": "Tutorial, one hour. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/IRANIAN199"
  }
]