[
  {
    "course_code": "ISLM ST 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMST19"
  },
  {
    "course_code": "ISLM ST M20",
    "units": 5,
    "title": "Introduction to Islam",
    "description": "(Same as Religion M20.) Lecture, three hours; discussion, one hour. Genesis of Islam, its doctrines, and practices, with readings from Qur’an and Hadith; schools of law and theology; piety and Sufism; reform and modernism. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Philosophical & Linguistic Analysis (Arts & Humanities)"
    ],
    "cross_listed": [
      "RELIGN M20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMSTM20"
  },
  {
    "course_code": "ISLM ST M27A",
    "units": 6,
    "title": "Global Islam",
    "description": "(Same as Clusters M27A.) Lecture, three hours; discussion, two hours. Course M27A is enforced requisite to M27B, which is enforced requisite to M27CW. Introduction to Islam, immensely diverse global tradition which is second largest religion. Study of Islam and Muslims within framework of study of global religious traditions and emphasis on profound diversity of localized belief and practice found across world. Examination of Islam’s evolution across 15 centuries, from late antiquity—when it emerged as localized religion in Central Arabia—to modern era where it is practice from U.S. to Indonesia. Concentration on broad analytical categories in study of religion such as text, culture, history, and prophecy. Students transition to more complex analyses through chronological overview of Islamic history. Study also of case studies of Muslim global networks in arenas such as art, music, literature, and political thought. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "cross_listed": [
      "CLUSTER M27A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMSTM27A"
  },
  {
    "course_code": "ISLM ST M27B",
    "units": 6,
    "title": "Global Islam",
    "description": "(Same as Clusters M27B.) Lecture, three hours; discussion, two hours. Enforced requisite: course M27A. Introduction to Islam, immensely diverse global tradition which is second largest religion. Study of Islam and Muslims within framework of study of global religious traditions and emphasis on profound diversity of localized belief and practice found across world. Examination of Islam’s evolution across 15 centuries, from late antiquity—when it emerged as localized religion in Central Arabia—to modern era where it is practice from U.S. to Indonesia. Concentration on broad analytical categories in study of religion such as text, culture, history, and prophecy. Students transition to more complex analyses through chronological overview of Islamic history. Study also of case studies of Muslim global networks in arenas such as art, music, literature, and political thought. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "prerequisites": [
      "ISLM ST M27A"
    ],
    "cross_listed": [
      "CLUSTER M27B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMSTM27B"
  },
  {
    "course_code": "ISLM ST M27CW",
    "units": 6,
    "title": "Global Islam: Special Topics",
    "description": "(Same as Clusters M27CW.) Seminar, three hours. Enforced requisite: course M27B. Introduction to Islam, immensely diverse global tradition which is second largest religion. Study of Islam and Muslims within framework of study of global religious traditions and emphasis on profound diversity of localized belief and practice found across world. Examination of Islam’s evolution across 15 centuries, from late antiquity—when it emerged as localized religion in Central Arabia—to modern era where it is practice from U.S. to Indonesia. Concentration on broad analytical categories in study of religion such as text, culture, history, and prophecy. Students transition to more complex analyses through chronological overview of Islamic history. Study also of case studies of Muslim global networks in arenas such as art, music, literature, and political thought. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Social Analysis (Society & Culture)",
      "Writing II"
    ],
    "prerequisites": [
      "ISLM ST M27B"
    ],
    "cross_listed": [
      "CLUSTER M27CW"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMSTM27CW"
  },
  {
    "course_code": "ISLM ST 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMST89"
  },
  {
    "course_code": "ISLM ST 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMST89HC"
  },
  {
    "course_code": "ISLM ST 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMST99"
  },
  {
    "course_code": "ISLM ST CM107",
    "units": 5,
    "title": "Islam in West",
    "description": "(Formerly numbered M107.) (Same as Arabic M107 and Religion M107.) Lecture, three hours; discussion, one hour. Acquisition of understanding of basic doctrines and practices of Islam. Survey of history of Islam in West, with focus on U.S. and France. Analysis of issues relevant to growth and development of selected Muslim communities in West. Exposure to diverse expressions of Islam through independent research on Muslim communities and institutions in U.S. Development of strong analytical writing and speaking skills. Concurrently scheduled with course C207. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "cross_listed": [
      "ARABIC M107",
      "RELIGN M107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMSTCM107"
  },
  {
    "course_code": "ISLM ST M111",
    "units": 4,
    "title": "Introduction to Islamic Archaeology",
    "description": "(Same as Art History M119C and Middle Eastern Studies M111.) Lecture, three hours. From earliest monuments of Islam in Arabia and Jerusalem to humble remains of small Egyptian port, broad focus on archaeological and standing remains in central Islamic lands (primarily Syria, Egypt, and Iraq), Turkey, Iran, North Africa, and Spain. Profound cultural transformations occurred from birth of Islam in 7th century to early Ottoman period in 16th and 17th centuries, which are traceable in material records. Assessment of effectiveness of tools afforded by historical archaeology to aid understanding of past societies. P/NP or letter grading.",
    "cross_listed": [
      "M E STD M111",
      "ART HIS M119C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMSTM111"
  },
  {
    "course_code": "ISLM ST M112",
    "units": 4,
    "title": "Archaeology and Art of Christian and Islamic Egypt",
    "description": "(Same as Archaeology M112, Art History M119D, and Middle Eastern Studies M112.) Lecture, three hours. Culture of Egypt transformed gradually after Muslim conquest in mid-7th century CE. According to material evidence such as ceramics, textiles, architectural forms, and building techniques, it is functionally impossible to separate pre-Islamic Christian Egypt from early Islamic Egypt. Although population may have become largely Muslim by 10th century, Egypt remained Coptic in many senses even to 14th century and retains sizeable Christian minority to present. Survey of archaeological remains and standing architecture of Egypt from 6th to 19th century, charting changes and continuities in material culture and shifts in human geography and land use. P/NP or letter grading.",
    "cross_listed": [
      "ART HIS M119D",
      "M E STD M112",
      "ARCHEOL M112"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMSTM112"
  },
  {
    "course_code": "ISLM ST CM115",
    "units": 5,
    "title": "Islam and Other Religions",
    "description": "(Formerly numbered M115.) (Same as Religion M115.) Lecture, three hours; discussion, one hour. Students gain familiarity with historical cases and modes of interaction between Muslims and non-Muslims in plural societies. Consideration of axis questions such as how does Qur’an reflect religious plurality; how does it situate Islam vis-à-vis its alternatives; what encounters did rapid expansion of Islam bring about in diverse societies; how did Islam and other religions change through debate, war, and exchange of ideas; what roles has political power played in conditioning interreligious interaction; how have conversion and hybridity affected what it means to be Muslim; what is different about interreligious interactions in secular states and societies; and how is past invoked to justify opinions and policies today. Investigation of these questions by conducting microstudies: close readings of sources through theoretical lens. Concurrently scheduled with course C215. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "cross_listed": [
      "RELIGN M115"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMSTCM115"
  },
  {
    "course_code": "ISLM ST 130",
    "units": 4,
    "title": "Shi'a in Islamic History",
    "description": "Seminar, three hours; discussion, one hour. Rise and development of Shi’a Islam, its doctrines, and practices; major branches: Twelvers, Ismailis, Zaydis; their contribution to Islamic thought and civilization; modern trends of reinterpretation and reform. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMST130"
  },
  {
    "course_code": "ISLM ST C151",
    "units": 4,
    "title": "Islamic Thought",
    "description": "(Formerly numbered 151.) Lecture, three hours. Recommended requisite: introductory course on Islam or instructor consent. Introduction to major fields of inquiry and debate in Islamic studies (e.g., exegesis, Hadith, law, theology, Sufism). Focus on selected topics of debate such as nature of God, jihad, hijab, or pilgrimage. Concurrently scheduled with course C251. Letter grading.",
    "prerequisites": [],
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMSTC151"
  },
  {
    "course_code": "ISLM ST 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMST189"
  },
  {
    "course_code": "ISLM ST 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMST189HC"
  },
  {
    "course_code": "ISLM ST 197",
    "units": 2,
    "title": "Individual Studies in Islamic Studies",
    "description": "Tutorial, one hour. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMST197"
  },
  {
    "course_code": "ISLM ST 199",
    "units": 2,
    "title": "Directed Research or Senior Project in Islamic Studies",
    "description": "Tutorial, one hour. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/ISLMST199"
  }
]