[
  {
    "course_code": "JAPAN 1",
    "units": 5,
    "title": "Elementary Modern Japanese",
    "description": "Lecture, three hours; discussion, two hours. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Introduction to modern Japanese with attention to conversation, grammar, and written forms. Conversation drill based on material covered in class. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN1"
  },
  {
    "course_code": "JAPAN 1A",
    "units": 5,
    "title": "Elementary Japanese for Kanji Native Students",
    "description": "Lecture, two hours; discussion, three hours. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Introduction to modern Japanese with attention to conversation, grammar, and written forms for those with some Kanji knowledge. Conversation drill based on material covered in class. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN1A"
  },
  {
    "course_code": "JAPAN 2",
    "units": 5,
    "title": "Elementary Modern Japanese",
    "description": "Lecture, three hours; discussion, two hours. Enforced requisite: course 1 with grade of C or better or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Continuation of course 1. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 2"
    ],
    "prerequisites": [
      "JAPAN 1"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN2"
  },
  {
    "course_code": "JAPAN 2A",
    "units": 5,
    "title": "Elementary Japanese for Kanji Native Students",
    "description": "Lecture, two hours; discussion, three hours. Requisite: course 1A or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Introduction to modern Japanese with attention to conversation, grammar, and written forms for those with some Kanji knowledge. Conversation drill based on material covered in class. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 1A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN2A"
  },
  {
    "course_code": "JAPAN 3",
    "units": 5,
    "title": "Elementary Modern Japanese",
    "description": "Lecture, three hours; discussion, two hours. Enforced requisite: course 2 with grade of C or better or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Continuation of course 2. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 3"
    ],
    "prerequisites": [
      "JAPAN 2"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN3"
  },
  {
    "course_code": "JAPAN 3A",
    "units": 5,
    "title": "Elementary Japanese for Kanji Native Students",
    "description": "Lecture, two hours; discussion, three hours. Requisite: course 2A or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Introduction to modern Japanese with attention to conversation, grammar, and written forms for those with some Kanji knowledge. Conversation drill based on material covered in class. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 2A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN3A"
  },
  {
    "course_code": "JAPAN 4",
    "units": 5,
    "title": "Intermediate Modern Japanese",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 3 or 8 with grade of C or better or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Designed to strengthen communicative skills of listening, speaking, reading, and writing. Grammar reviews, vocabulary building skills, language learning skills, and sociocultural knowledge. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 3",
      "JAPAN 8"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN4"
  },
  {
    "course_code": "JAPAN 5",
    "units": 5,
    "title": "Intermediate Modern Japanese",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 4 with grade of C or better or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Continuation of course 4. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 4"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN5"
  },
  {
    "course_code": "JAPAN 6",
    "units": 5,
    "title": "Intermediate Modern Japanese",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 5 with grade of C or better or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Continuation of course 5. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 5"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN6"
  },
  {
    "course_code": "JAPAN 8",
    "units": 15,
    "title": "Elementary Japanese: Intensive",
    "description": "Lecture, 10 hours; discussion, 10 hours. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Intensive course equivalent to courses 1, 2, and 3. Introduction to fundamentals of standard Japanese, including pronunciation, grammar, and Japanese characters, with emphasis on all four basic language skills—speaking, listening comprehension, reading, and writing. Offered in summer only. P/NP or letter grading.",
    "satisfies": [
      "Foreign Language - Level 3"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN8"
  },
  {
    "course_code": "JAPAN 10",
    "units": 15,
    "title": "Intermediate Modern Japanese: Intensive",
    "description": "Lecture, 10 hours; discussion, 10 hours. Enforced requisite: course 3 with grade of C or better or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Intensive course equivalent to courses 4, 5, and 6. Readings in modern Japanese, with emphasis on comprehension and structural analysis. Offered in summer only. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 3"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN10"
  },
  {
    "course_code": "JAPAN 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN19"
  },
  {
    "course_code": "JAPAN 50",
    "units": 5,
    "title": "Japanese Civilization",
    "description": "Lecture, three hours; discussion, one hour. Knowledge of Japanese not required. Survey of development of Japanese culture and its relationship to Asiatic mainland. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "Diversity - Arts and Architecture"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN50"
  },
  {
    "course_code": "JAPAN 70",
    "units": 5,
    "title": "Images of Japan: Literature and Film",
    "description": "Lecture, three hours; discussion, one hour. Knowledge of Japanese culture, literature, or language not required. Introduction to visual and textual images of Japan’s literary heritage, including documentary and feature films based on Japan’s literary classics. Letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN70"
  },
  {
    "course_code": "JAPAN 75",
    "units": 5,
    "title": "Anime",
    "description": "Lecture, three hours; discussion, one hour. Discussion and analysis of seminal works of Japanese animation, or anime, created from 1980s to present. Engagement with works in variety of styles, and that deal with broad range of themes. Reading and discussion of recent scholarship on anime produced by scholars working in diverse modes, from philosophical to anthropological. Letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)",
      "General Education - Visual & Performance Arts Analysis & Practice (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN75"
  },
  {
    "course_code": "JAPAN 80",
    "units": 5,
    "title": "How Does It Move? Action and Moving Image in Modern Japan",
    "description": "Lecture, four hours; discussion, one hour. How is action constituted on the screen? How has modern technological media informed and transformed our experience and understanding of action? Exploration of how our experience and conception of action is mediated by technological aesthetic media by tracing history of portrayal and experience of action both in media theory and practice. Emphasis on moving image practices surrounding production and reception of popular action film genres from Japan such as chambara or samurai film and yakuza film. Consideration also of their relationship to international film cultures and genres (e.g. Hollywood Western, gangster film, Chinese martial arts cinema, and contemporary Hollywood blockbusters) in context of broader historical transformations in media practices and in modes of distribution and reception. Study of theoretical debates, institutional practices, and ethical and political questions that inform our inquiries into moving image as action, and into action as/through moving image. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Visual & Performance Arts Analysis & Practice (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN80"
  },
  {
    "course_code": "JAPAN 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN89"
  },
  {
    "course_code": "JAPAN 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN89HC"
  },
  {
    "course_code": "JAPAN 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN99"
  },
  {
    "course_code": "JAPAN 100A",
    "units": 4,
    "title": "Advanced Modern Japanese",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 6 or 10 with grade of C or better or Japanese placement test. Course 100A with grade of C or better or Japanese placement test is enforced requisite to 100B; course 100B with grade of C or better or Japanese placement test is enforced requisite to 100C. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Learning Japanese language with emphasis on sociocultural issues of contemporary Japanese society. Materials selected from contemporary publications, videos, and audiotapes. Reading with focus on linguistics features, writing summaries and opinions, oral activities, and project work. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 6",
      "JAPAN 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN100A"
  },
  {
    "course_code": "JAPAN 100B",
    "units": 4,
    "title": "Advanced Modern Japanese",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 100A with grade of C or better or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Learning Japanese language with emphasis on sociocultural issues of contemporary Japanese society. Materials selected from contemporary publications, videos, and audiotapes. Reading with focus on linguistics features, writing summaries and opinions, oral activities, and project work. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN100B"
  },
  {
    "course_code": "JAPAN 100C",
    "units": 4,
    "title": "Advanced Modern Japanese",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 100B with grade of C or better or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Learning Japanese language with emphasis on sociocultural issues of contemporary Japanese society. Materials selected from contemporary publications, videos, and audiotapes. Reading with focus on linguistics features, writing summaries and opinions, oral activities, and project work. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN100C"
  },
  {
    "course_code": "JAPAN 100R",
    "units": 4,
    "title": "Third-Year Advanced Reading in Modern Japanese",
    "description": "Lecture, three hours. Enforced requisite: course 6 or 10 with grade of C or better or Japanese placement test. Not open to students with credit for course 100A or who have learned, from whatever source, enough Japanese to qualify for more advanced courses. May be taken concurrently with course 100A. Development of overall competency in reading advanced-level Japanese materials. Instruction in understanding grammar and practical expressions, as well as expansion of kanji and vocabulary to achieve higher ability in comprehension of written materials in Japanese. Translations from Japanese to English, as well as from English to Japanese. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 6",
      "JAPAN 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN100R"
  },
  {
    "course_code": "JAPAN 100S",
    "units": 12,
    "title": "Advanced Modern Japanese: Intensive",
    "description": "Lecture, 10 hours; discussion, 10 hours. Enforced requisite: course 6 or 10 with grade of C or better or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Intensive course equivalent to courses 100A, 100B, and 100C. Learning Japanese language with emphasis on sociocultural issues of contemporary Japanese society. Materials selected from contemporary publications, videos, and audiotapes. Reading with focus on linguistics features, writing summaries and opinions, oral activities, and project work. Offered in summer only. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 6",
      "JAPAN 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN100S"
  },
  {
    "course_code": "JAPAN 101A",
    "units": 4,
    "title": "Fourth-Year Japanese: Advanced Reading",
    "description": "Lecture, three hours. Enforced requisite: course 100C or 100S with grade of C or better or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Advanced readings and discussion for students planning to do advanced coursework or research on Japan. Topics selected from magazines, journals, and books related to humanities and social sciences. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN101A"
  },
  {
    "course_code": "JAPAN 101B",
    "units": 4,
    "title": "Fourth-Year Japanese: Advanced Reading",
    "description": "Lecture, three hours. Enforced requisite: course 100C or 100S with grade of C or better or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Advanced readings and discussion for students planning to do advanced coursework or research on Japan. Topics selected from magazines, journals, and books related to humanities and social sciences. May be repeated for credit. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN101B"
  },
  {
    "course_code": "JAPAN 101C",
    "units": 4,
    "title": "Fourth-Year Japanese: Advanced Reading",
    "description": "Lecture, three hours. Enforced requisite: course 100C or 100S with grade of C or better or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Advanced readings and discussion for students planning to do advanced coursework or research on Japan. Topics selected from magazines, journals, and books related to humanities and social sciences. May be repeated for credit. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN101C"
  },
  {
    "course_code": "JAPAN 101S",
    "units": 12,
    "title": "Fourth-Year Japanese: Advanced Reading—Intensive",
    "description": "Lecture, 10 hours; discussion, 10 hours. Enforced requisite: course 100C or 100S with grade of C or better or Japanese placement test. Not open to students who have learned, from whatever source, enough Japanese to qualify for more advanced courses. Advanced readings and discussion for students planning to do advanced coursework or research on Japan. Topics selected from magazines, journals, and books related to humanities and social sciences. Offered in summer only. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN101S"
  },
  {
    "course_code": "JAPAN 103A",
    "units": 4,
    "title": "Fourth-Year Japanese: Advanced Speaking I",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 100C or 100S with grade of C or better. Development of listening and speaking abilities for students who need focused attention to these skills. Also suitable for graduate students who need to advance their public speaking ability. Not intended for those who are at higher level in these skill areas. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN103A"
  },
  {
    "course_code": "JAPAN 103B",
    "units": 4,
    "title": "Fourth-Year Japanese: Advanced Speaking II",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 100C or 100S with grade of C or better. Development of listening and speaking abilities for students who need focused attention to these skills. Also suitable for graduate students who need to advance their public speaking ability. Not intended for those who are at higher level in these skill areas. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN103B"
  },
  {
    "course_code": "JAPAN 103C",
    "units": 4,
    "title": "Fourth-Year Japanese: Advanced Speaking III",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 100C or 100S with grade of C or better. Development of listening and speaking abilities for students who need focused attention to these skills. Also suitable for graduate students who need to advance their public speaking ability. Not intended for those who are at higher level in these skill areas. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN103C"
  },
  {
    "course_code": "JAPAN 104",
    "units": 4,
    "title": "Business Japanese",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 100C or 100S with grade of C or better or Japanese placement test. Designed to improve skills in Japanese in context of business transactions. To be successful business person, one must be equipped with advanced specialized oral and written communication skills as well as high degree of cultural understanding. Oral and written business communication, social etiquette in business conduct, Japanese economic and business climate, business law and regulations, resources and environment, and business case studies. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN104"
  },
  {
    "course_code": "JAPAN 105A",
    "units": 4,
    "title": "Advanced Reading and Writing for Japanese-Heritage Speakers",
    "description": "Lecture, three hours; discussion, one hour. Enforced preparation: Japanese placement test. Not open to students who have taken 100 series, 101 series, and/or 103 series courses or 104. Designed for advanced-level Japanese-heritage learners or nonheritage learners who are fluent in daily spoken Japanese. Emphasis on building vocabulary knowledge of Kanji, reading and writing, and honorific/humble style of Japanese. May be taken independently for credit. P/NP or letter grading.",
    "credit_exclusions": [
      "JAPAN 100A",
      "JAPAN 100C",
      "JAPAN 100B",
      "JAPAN 104",
      "JAPAN 101B",
      "JAPAN 101C",
      "JAPAN 101A",
      "JAPAN 103A",
      "JAPAN 103B",
      "JAPAN 103C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN105A"
  },
  {
    "course_code": "JAPAN 105B",
    "units": 4,
    "title": "Advanced Reading and Writing for Japanese-Heritage Speakers",
    "description": "Lecture, three hours; discussion, one hour. Enforced preparation: Japanese placement test. Not open to students who have taken 100 series, 101 series, and/or 103 series courses or 104. Designed for advanced-level Japanese-heritage learners or nonheritage learners who are fluent in daily spoken Japanese. Emphasis on building vocabulary knowledge of Kanji, reading and writing, and honorific/humble style of Japanese. May be taken independently for credit. P/NP or letter grading.",
    "credit_exclusions": [
      "JAPAN 100B",
      "JAPAN 100A",
      "JAPAN 100C",
      "JAPAN 104",
      "JAPAN 101B",
      "JAPAN 101A",
      "JAPAN 101C",
      "JAPAN 103A",
      "JAPAN 103B",
      "JAPAN 103C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN105B"
  },
  {
    "course_code": "JAPAN 108FL",
    "units": 2,
    "title": "Special Studies: Readings in Japanese",
    "description": "Seminar, two hours. Requisite: course 100C or 100S with grade of C or better or Japanese placement test. Students must be concurrently enrolled in affiliated main course. Additional work in Japanese to augment work assigned in main course, including reading, writing, and other exercises. May be repeated for credit. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN108FL"
  },
  {
    "course_code": "JAPAN 109",
    "units": 2,
    "title": "Advanced Tutorial Instruction in Japanese",
    "description": "Tutorial, two hours. Requisite: course 100C or 100S with grade of C or better or Japanese placement test. Tutorial and guided independent study to help students develop advanced to superior proficiency in oral and written Japanese. May be repeated for credit. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN109"
  },
  {
    "course_code": "JAPAN 110A",
    "units": 4,
    "title": "Introduction to Classical Japanese: Basic Grammar",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 100C or 100S or Japanese placement test. Introduction to fundamentals of classical Japanese. Grammar and reading of selected premodern texts. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN110A"
  },
  {
    "course_code": "JAPAN 110B",
    "units": 4,
    "title": "Introduction to Classical Japanese: Reading Proficiency",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 110A. Grammar and readings of selected premodern texts. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 110A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN110B"
  },
  {
    "course_code": "JAPAN C112",
    "units": 4,
    "title": "Japanese Urban History and Culture",
    "description": "Lecture, three hours. Knowledge of Japanese not required. Japanese urban history and culture, with special emphasis on cities of Nara, Kyoto, Edo/Tokyo, and Nagasaki. Concurrently scheduled with course C212. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPANC112"
  },
  {
    "course_code": "JAPAN M120",
    "units": 4,
    "title": "Introduction to Japanese Linguistics",
    "description": "(Same as Linguistics M116.) Lecture, three hours; discussion, one hour. Enforced requisite: course 3 or 8 or Japanese placement test. Introduction to Japanese grammar and sociolinguistics through reading, discussion, and problem solving in phonology, syntax, semantics, and discourse pragmatics. Letter grading.",
    "prerequisites": [
      "JAPAN 3",
      "JAPAN 8"
    ],
    "cross_listed": [
      "LING M116"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPANM120"
  },
  {
    "course_code": "JAPAN CM122",
    "units": 4,
    "title": "Japanese Phonology and Morphology",
    "description": "(Same as Linguistics M176A.) Lecture, three hours; discussion, one hour. Recommended preparation: Linguistics 20. Enforced requisite: course 3 or 8 or Japanese placement test. Survey of Japanese phonetics, phonology, and morphology. Concurrently scheduled with course C222. Letter grading.",
    "prerequisites": [
      "JAPAN 3",
      "JAPAN 8"
    ],
    "cross_listed": [
      "LING M176A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPANCM122"
  },
  {
    "course_code": "JAPAN CM123",
    "units": 4,
    "title": "Structure of Japanese",
    "description": "(Same as Linguistics M176B.) Lecture, three hours; discussion, one hour. Enforced requisite: course 4 or 10 or Japanese placement test. Functional linguistic analysis of grammatical structures of Japanese, often in form of contrastive analysis of Japanese, English, and other languages. Concurrently scheduled with course C223. Letter grading.",
    "prerequisites": [
      "JAPAN 4",
      "JAPAN 10"
    ],
    "cross_listed": [
      "LING M176B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPANCM123"
  },
  {
    "course_code": "JAPAN 124",
    "units": 4,
    "title": "Language and Culture of Ryukyu/Okinawa",
    "description": "Seminar, three hours. Requisite: course 6 or 10 or Japanese placement test. Research seminar with reading, discussion, linguistic analysis, and development of culminating project. Letter grading.",
    "prerequisites": [
      "JAPAN 6",
      "JAPAN 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN124"
  },
  {
    "course_code": "JAPAN CM127",
    "units": 4,
    "title": "Contrastive Analysis of Japanese and Korean",
    "description": "(Same as Korean CM127 and Linguistics M178.) Lecture, three hours; discussion, one hour. Recommended preparation: two years of Japanese and knowledge of Hangul, or two years of Korean and knowledge of Hiragana. Prior linguistic background also recommended. Critical reading and discussion of selected current research papers in syntax, pragmatics, discourse, and sociolinguistics from perspective of contrastive study of Japanese and Korean. Concurrently scheduled with course CM227. Letter grading.",
    "cross_listed": [
      "LING M178",
      "KOREA CM127"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPANCM127"
  },
  {
    "course_code": "JAPAN 130A",
    "units": 4,
    "title": "Readings in Modern Japanese Literature",
    "description": "Seminar, three hours. Enforced requisite: course 100C or 100S or Japanese placement test. Readings and discussion of works by modern Japanese writers. May be taken independently for credit. Letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN130A"
  },
  {
    "course_code": "JAPAN 130B",
    "units": 4,
    "title": "Readings in Modern Japanese Literature",
    "description": "Seminar, three hours. Enforced requisite: course 100C or 100S or Japanese placement test. Readings and discussion of works by modern Japanese writers. May be taken independently for credit. Letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN130B"
  },
  {
    "course_code": "JAPAN 130C",
    "units": 4,
    "title": "Readings in Modern Japanese Literature",
    "description": "Seminar, three hours. Enforced requisite: course 100C or 100S or Japanese placement test. Readings and discussion of works by modern Japanese writers. May be taken independently for credit. Letter grading.",
    "prerequisites": [
      "JAPAN 100C",
      "JAPAN 100S"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN130C"
  },
  {
    "course_code": "JAPAN 140A",
    "units": 4,
    "title": "Readings in Classical Japanese Literature: Heian",
    "description": "Seminar, three hours. Enforced requisite: course 110A. Readings and discussion of works of classical Japanese literature. May be taken independently for credit. Letter grading.",
    "prerequisites": [
      "JAPAN 110A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN140A"
  },
  {
    "course_code": "JAPAN 140B",
    "units": 4,
    "title": "Readings in Classical Japanese Literature: Medieval",
    "description": "Seminar, three hours. Enforced requisite: course 110A. Readings and discussion of works of medieval Japanese literature. May be taken independently for credit. Letter grading.",
    "prerequisites": [
      "JAPAN 110A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN140B"
  },
  {
    "course_code": "JAPAN 140C",
    "units": 4,
    "title": "Readings in Classical Japanese Literature: Edo",
    "description": "Seminar, three hours. Enforced requisite: course 110A. Readings and discussion of works of early modern Japanese literature. May be taken independently for credit. Letter grading.",
    "prerequisites": [
      "JAPAN 110A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN140C"
  },
  {
    "course_code": "JAPAN C149",
    "units": 4,
    "title": "Introduction to Kambun and Other Literary Styles",
    "description": "Lecture, three hours. Enforced requisite: course 110A. Introduction to Kambun, Japanese literary rendering of premodern Sino-Japanese, and Sorobun, epistolary style. Concurrently scheduled with course C249. Letter grading.",
    "prerequisites": [
      "JAPAN 110A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPANC149"
  },
  {
    "course_code": "JAPAN C150",
    "units": 4,
    "title": "Topics in Japanese Literature and Philosophy",
    "description": "Lecture, three hours; discussion, one hour. Knowledge of Japanese not required. Discussion of philosophical topics such as experience, identity, value, technology, in light of Japanese literary texts. Concurrently scheduled with course C250. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPANC150"
  },
  {
    "course_code": "JAPAN 151",
    "units": 4,
    "title": "Japanese Literature in Translation: Modern",
    "description": "Lecture, three hours; discussion, one hour. Requisite: English Composition 3 or 3H or one course from Comparative Literature 1A, 1B, 1C, 1D. Knowledge of Japanese not required. Survey of Japanese literature from 16th century to post-World War II. P/NP or letter grading.",
    "prerequisites": [
      "ENGCOMP 3",
      "ENGCOMP 3H",
      "COM LIT 1A",
      "COM LIT 1B",
      "COM LIT 1C",
      "COM LIT 1D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN151"
  },
  {
    "course_code": "JAPAN 154",
    "units": 4,
    "title": "Postwar Japanese Culture through Literature",
    "description": "Lecture, three hours; discussion, one hour. Requisite: English Composition 3 or 3H or one course from Comparative Literature 1A, 1B, 1C, 1D. Knowledge of Japanese not required. Use of fiction and film to explore Japanese culture in postwar era in broad cross-disciplinary and cross-cultural context. P/NP or letter grading.",
    "prerequisites": [
      "ENGCOMP 3",
      "ENGCOMP 3H",
      "COM LIT 1A",
      "COM LIT 1B",
      "COM LIT 1C",
      "COM LIT 1D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN154"
  },
  {
    "course_code": "JAPAN 155",
    "units": 4,
    "title": "Topics in Japanese Cinema",
    "description": "Lecture, three hours; discussion, one hour; film viewing, two hours. Knowledge of Japanese not required. Critical and historical examination of Japanese cinema. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN155"
  },
  {
    "course_code": "JAPAN M156",
    "units": 4,
    "title": "Literature and Technology",
    "description": "(Same as Comparative Literature M176.) Lecture, three hours. Knowledge of Japanese not required. Examination of representation of technology in 20th-century fiction. Discussion of impact of technology on shifting images of gender, subjectivity, and national identity. P/NP or letter grading.",
    "cross_listed": [
      "COM LIT M176"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPANM156"
  },
  {
    "course_code": "JAPAN 157",
    "units": 4,
    "title": "Classical Japanese Drama: Great Tradition",
    "description": "Lecture, three hours. Knowledge of Japanese not required. Readings in major genres of Japanese theater and exploration of its influence on 20th-century drama and theater around world. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN157"
  },
  {
    "course_code": "JAPAN C159",
    "units": 4,
    "title": "Variable Topics in Culture and Society in Japan",
    "description": "Lecture, three hours; discussion, one hour. Knowledge of Japanese not required. Examination of relationship between culture (art, literature, film) and society in Japan. Reading, audio and visual material, discussion, and development of culminating project. May be repeated for credit with topic change. Concurrently scheduled with course C259. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPANC159"
  },
  {
    "course_code": "JAPAN CM160",
    "units": 4,
    "title": "Japanese Buddhism",
    "description": "(Same as Religion M161B.) Lecture, three hours; discussion, one hour. Knowledge of Japanese not required. Development of Buddhism in Japan in its cultural context, with emphasis on key ideas and teachings. Concurrently scheduled with course C260. Letter grading.",
    "cross_listed": [
      "RELIGN M161B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPANCM160"
  },
  {
    "course_code": "JAPAN 161",
    "units": 4,
    "title": "Religious Life in Modern Japan",
    "description": "Lecture, three hours; discussion, one hour. Knowledge of Japanese not required. Religious transformations accompanying rapid industrialization, urbanization, militarism, and defeat in Pacific War, including analyses of Shinto mythology, secular positivism, Buddhist reform movements, new religions, and continuing role of traditional village/family religious rites. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN161"
  },
  {
    "course_code": "JAPAN 165",
    "units": 4,
    "title": "Introduction to Japanese Buddhist Texts",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 110A or Chinese 165 or Japanese placement test. Readings in premodern Buddhist texts written by Japanese in Sino-Japanese or Kambun and mixed Japanese/Chinese literary styles concerning textual commentaries, doctrinal treatises, hagiographies, temple histories, etc. Coverage varies. May be repeated for credit with consent of instructor. Letter grading.",
    "prerequisites": [
      "JAPAN 110A",
      "CHIN 165"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN165"
  },
  {
    "course_code": "JAPAN 170",
    "units": 4,
    "title": "Japanese Tales of Supernatural",
    "description": "Lecture, three hours; discussion, one hour. Knowledge of Japanese not required. Readings of fictional works that feature supernatural beings, including Shinto gods, Buddhas, boddhisatvas, Yin-yang diviners, ghosts, various types of demons, shape-shifting foxes and raccoon dogs, snakes, and dragons. Exploration of different treatments of supernatural themes from ancient to modern times, and of relationship between supernatural literature and expressions of fear, cruelty, violence, misogyny, desire, hope, compassion, and humor. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN170"
  },
  {
    "course_code": "JAPAN C171",
    "units": 4,
    "title": "Topics in Japanese Studies",
    "description": "Lecture, three hours. Enforced requisite: course 100C or Japanese placement test. Advanced course that explores Japanese culture through in-depth reading of Japanese-language texts and/or visual documents. Topics include literature, religion, folklore, cultural history, language, and society. Concurrently scheduled with course C271. P/NP or letter grading.",
    "prerequisites": [
      "JAPAN 100C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPANC171"
  },
  {
    "course_code": "JAPAN 172",
    "units": 4,
    "title": "Fiction and Plays of Floating World",
    "description": "Lecture, three hours; discussion, one hour. Enforced requisite: course 50. Examination of broad selection of popular fiction and theater from late 17th to early 19th century, with focus on theme of floating world (ukiyo) of entertainment, including pleasure quarters, theater district, and realm of fiction. Letter grading.",
    "prerequisites": [
      "JAPAN 50"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN172"
  },
  {
    "course_code": "JAPAN 174",
    "units": 4,
    "title": "Classical Japanese Poetry",
    "description": "Lecture, three hours; discussion, one hour. Knowledge of Japanese not required. Examination of classical poetry of Nara and Heian periods, with focus on poetry anthology called Man’yoshu (Collection of Myriad Ages, 8th century) and on Kokinwakashu (Collection of Ancient and Modern Japanese Poems, early 10th century). Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN174"
  },
  {
    "course_code": "JAPAN C182",
    "units": 4,
    "title": "Japanese Folklore",
    "description": "Lecture, three hours; discussion, one hour. Knowledge of Japanese not required. Lectures/discussions on native religious rituals (festivals) and observances of Japanese, with special emphasis on artistic behavior. Discussion of Shinto, Shinto/Buddhist syncretism, and other non-Buddhist belief systems. Concurrently scheduled with course C282. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPANC182"
  },
  {
    "course_code": "JAPAN 187SL",
    "units": 4,
    "title": "Service Learning in Japanese Community",
    "description": "Lecture, three hours; fieldwork, three hours minimum. Enforced requisite: course 6. Service learning in Japanese community. Examination of scholarly works on cultural and language factors between Japanese and American communities. Survey of intercultural communication and learning of strategies for resolving miscommunication difficulties arising from language barrier and cultural differences while using language in real interaction with native speakers of Japanese. Letter grading.",
    "prerequisites": [
      "JAPAN 6"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN187SL"
  },
  {
    "course_code": "JAPAN 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN188SA"
  },
  {
    "course_code": "JAPAN 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "JAPAN 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN188SB"
  },
  {
    "course_code": "JAPAN 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "JAPAN 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN188SC"
  },
  {
    "course_code": "JAPAN 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN189"
  },
  {
    "course_code": "JAPAN 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN189HC"
  },
  {
    "course_code": "JAPAN 191A",
    "units": 4,
    "title": "Variable Topics Research Seminars: Classical Japan",
    "description": "Seminar, three hours. Research seminar on selected topics in premodern Japanese literature and thought. Reading, discussion, and development of culminating project. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN191A"
  },
  {
    "course_code": "JAPAN 191B",
    "units": 4,
    "title": "Variable Topics Research Seminars: Modern Japan",
    "description": "Seminar, three hours. Research seminar on selected topics on modern Japan. Reading, discussion, and development of culminating project. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN191B"
  },
  {
    "course_code": "JAPAN 191C",
    "units": 4,
    "title": "Variable Topics Research Seminars: Personalities in Japanese Civilization",
    "description": "Seminar, three hours. Research seminar on selected topics. Reading, discussion, and development of culminating project. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN191C"
  },
  {
    "course_code": "JAPAN 197",
    "units": 4,
    "title": "Individual Studies in Japanese",
    "description": "Tutorial, to be arranged. Limited to juniors/seniors and graduate students who desire more advanced or specialized instruction in Japanese. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required; see undergraduate adviser. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JAPAN197"
  }
]