[
  {
    "course_code": "JEWISH M10",
    "units": 5,
    "title": "Introduction to Judaism",
    "description": "(Same as Religion M10.) Lecture, three hours; discussion, one hour. Judaism’s basic beliefs, institutions, and practices. Topics include development of biblical and rabbinic Judaism; concepts of god, sin, repentance, prayer, and the messiah; history of Talmud and synagogue; evolution of folk beliefs and year-cycle and life-cycle practices. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "cross_listed": [
      "RELIGN M10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM10"
  },
  {
    "course_code": "JEWISH 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH19"
  },
  {
    "course_code": "JEWISH M67",
    "units": 5,
    "title": "Popular Jewish and Israeli Music",
    "description": "(Same as Musicology M67.) Lecture, four hours; discussion, one hour. Music of Jews is diverse. With history of several thousand years and series of developments in modernity, music in Jewish life covers variety of styles found in many contexts. Exploration of music of Jews within last 100 years, with focus on popular music of Jews in America and Israel. Examination of music in Israel, with focus on songs of land of Israel, Israeli rock, and Muzika Mizrachit (Middle Eastern popular music). P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "cross_listed": [
      "MUSCLG M67"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM67"
  },
  {
    "course_code": "JEWISH M80",
    "units": 5,
    "title": "Jewish American Experience through Music",
    "description": "(Same as Ethnomusicology M80 and Musicology M80.) Lecture, four hours; discussion, one hour. In synagogue and on stage, and from LP recordings to YouTube, Jews in America have varied musical experiences. Music of synagogue, celebrations at home, in community, and theater are all interesting developments of Jewish music. New Opportunities in entertainment industry brought new possibilities for Jews in popular music, rock, and film scores. Exploration of various examples of Jews responding and adapting to their American context and becoming American through music. Exploration of different music genres and contexts. Presentations by guest composers and performers. Letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "cross_listed": [
      "ETHNMUS M80",
      "MUSCLG M80"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM80"
  },
  {
    "course_code": "JEWISH M82",
    "units": 5,
    "title": "Music and Holocaust: Individual Experience",
    "description": "(Same as Musicology M82.) Lecture, three hours; discussion, one hour. Roles of music during Holocaust are as varied as people who experienced it. Music was composed and performed by prisoners in almost every concentration camp; music was means for some individuals to gain favorable treatment, while others weaponized it. Traces development of European musical culture under Nazi regime (1933-45), focusing on how individuals interacted with music throughout Holocaust. Study of some of newest developments in Holocaust music research, including role American and European non-governmental organizations played in creation of artistic hubs in campus of southern France. Exploration also of cultural representations of Holocaust, and role of music in society’s collective memory. Letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Visual & Performance Arts Analysis & Practice (Arts & Humanities)"
    ],
    "cross_listed": [
      "MUSCLG M82"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM82"
  },
  {
    "course_code": "JEWISH 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH89"
  },
  {
    "course_code": "JEWISH 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH89HC"
  },
  {
    "course_code": "JEWISH 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH99"
  },
  {
    "course_code": "JEWISH M113",
    "units": 5,
    "title": "Contemporary Israeli Short Stories/Novellas and Films in English",
    "description": "(Same as Hebrew M113.) Lecture, three hours; laboratory, two hours. Exploration of Israeli short stories/novellas and films (translated into English) written since mid-1980s that use, each to varying degree, postmodernist techniques to undermine predominance of modernist-Zionist narrative. Recycling and reexamination of Israeli condition and Zionist condition and skepticism about legitimacy of meta-narratives to redefine blurred outline of Israeli identity and subvert its underpinning formative myths. They simultaneously display loss of faith in representative dimension of language, including ability of texts to penetrate to its hidden meaning. Using periphery discourses, these texts strive to change modernist aesthetic and power paradigm. P/NP or letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "cross_listed": [
      "HEBREW M113"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM113"
  },
  {
    "course_code": "JEWISH 135",
    "units": 5,
    "title": "Jewish Law",
    "description": "Lecture, three hours. Introduction to Jewish law from biblical literature to modern legal systems. Comparison of Jewish legal systems to modern secular systems and discussion of ethical dimensions of legal systems. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH135"
  },
  {
    "course_code": "JEWISH 140A",
    "units": 4,
    "title": "American Jewish History, 1654 to 1914",
    "description": "Lecture, three hours. Examination of social and cultural history of American Jewish community from its inception to the present, with emphasis on integration of successive immigrants and development of institutions. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH140A"
  },
  {
    "course_code": "JEWISH 140B",
    "units": 4,
    "title": "American Jewish History, 1914 to the Present",
    "description": "Lecture, three hours. Examination of social and cultural history of American Jewish community from its inception to the present, with emphasis on integration of successive immigrants and development of institutions. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH140B"
  },
  {
    "course_code": "JEWISH M142",
    "units": 4,
    "title": "Modern Israel: Politics, Society, Culture",
    "description": "(Same as Middle Eastern Studies M142.) Lecture, three hours. Examination of evolution of Israel—its changing society, volatile domestic and foreign politics, and dynamic culture—from its foundation in 1948 to present, in context of global political and cultural change and changing Jewish world. Tension between Israel’s conception of itself as Jewish state and fact that it is home to wide variety of ethnic and religious groups and to great diversity of cultures; that it was envisaged as safe haven for Jewish people but has been characterized by insecurity and ongoing war; that, founded as democracy, it contends with multiple strains on its democratic system, such as tensions between Jews and Arabs, secular and religious Jews, and disparate ethnic groups. P/NP or letter grading.",
    "cross_listed": [
      "M E STD M142"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM142"
  },
  {
    "course_code": "JEWISH 143",
    "units": 4,
    "title": "Introduction to Jewish Folklore",
    "description": "Lecture, three hours. Nature of Jewish folklore; narrative, folk song, folk art, folk religion, and methods and perspectives used in their analysis. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH143"
  },
  {
    "course_code": "JEWISH M144",
    "units": 4,
    "title": "Zionism: Ideology and Practice in Making of Jewish State",
    "description": "(Same as Middle Eastern Studies M144.) Lecture, three hours; discussion, one hour. History of Zionism on backdrop of European, world, and Jewish histories from ideological origins to political, cultural, and social foundations of State of Israel. P/NP or letter grading.",
    "cross_listed": [
      "M E STD M144"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM144"
  },
  {
    "course_code": "JEWISH M150A",
    "units": 4,
    "title": "Hebrew Literature in English: Literary Traditions of Ancient Israel—Bible and Apocrypha",
    "description": "(Same as Comparative Literature M101.) Lecture, three hours. Study of literary culture of ancient Israel through examination of principal compositional strategies of Hebrew Bible and Apocrypha (read in translation). May be taken independently for credit. P/NP or letter grading.",
    "cross_listed": [
      "COM LIT M101"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM150A"
  },
  {
    "course_code": "JEWISH 150B",
    "units": 4,
    "title": "Hebrew Literature in English: Rabbinic Judaism",
    "description": "Lecture, three hours. Topics include emergence of rabbinic Judaism; its original literary forms; rabbinic worldview; forms of medieval rabbinic literature; modern Jewish religious movements and their attitude to rabbinic Judaism. May be taken independently for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH150B"
  },
  {
    "course_code": "JEWISH M151A",
    "units": 4,
    "title": "Modern Jewish Literature in English: Diaspora Literature",
    "description": "(Same as Comparative Literature M166.) Lecture, three hours. Study of literary responses of Jews to modernity, its challenges, and threats. Readings in texts originally written in English or translated from Hebrew, Yiddish, German, Russian, French, and Italian. Analysis of formal aspects of each work. May be taken independently for credit. P/NP or letter grading.",
    "cross_listed": [
      "COM LIT M166"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM151A"
  },
  {
    "course_code": "JEWISH 151B",
    "units": 4,
    "title": "Modern Jewish Literature in English: Israeli Literature",
    "description": "Lecture, three hours. Study of translations from Hebrew literature written in Israel and reflecting cardinal facets of Israeli life: social issues, security problems, identity of the state, role of individual. Analysis of formal aspects of each work. May be taken independently for credit.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH151B"
  },
  {
    "course_code": "JEWISH M155",
    "units": 4,
    "title": "Angels, Demons, and End of World: Magic, Mysticism, and Apocalypse in Jewish Traditions",
    "description": "(Same as Religion M155.) Lecture, three hours. Focus on popular Jewish traditions of magic, mysticism, apocalypse, and various contours of Judaism’s textual and material traditions in antiquity. Examination of texts and objects from Hebrew Bible to modern discussions of Kabbalah and end of world, concentrating on Jewish antiquity. Discussion of texts, including Hebrew Bible, Dead Sea Scrolls, extra-biblical Jewish texts, New Testament, and rabbinic and later Jewish literature. Discussion of sociohistorical context in order to decipher features and functions of magic, mysticism, and apocalypse in antiquity and modernity. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M155"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM155"
  },
  {
    "course_code": "JEWISH M162",
    "units": 4,
    "title": "Israel Seen through Its Literature",
    "description": "(Same as Comparative Literature M162.) Lecture, three hours. Attempt to impart profound understanding of Israel as seen through its literature. Examination of variety of literary texts—stories, novels, and poems—and reading of them in context of their historical backgrounds. P/NP or letter grading.",
    "cross_listed": [
      "COM LIT M162"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM162"
  },
  {
    "course_code": "JEWISH 170",
    "units": 4,
    "title": "Dead Sea Scrolls and Early Judaism",
    "description": "Lecture, three hours. Introduction to Dead Sea Scrolls in English translation. Survey of literature, community of Khirbet Qumran, and their place in early Judaism. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH170"
  },
  {
    "course_code": "JEWISH 175",
    "units": 5,
    "title": "Modern Israeli Literature Made into Films",
    "description": "Lecture, four hours; discussion, one hour. Reading, analysis, and discussion of modern Israeli literature that was made into films, including literary works of prominent Israeli authors (S. Yizhar, A.B. Yehoshua, Amos Oz, and Yitzhak Ben Ner) that were translated to English and had filmic adaptations. Letter grading.",
    "satisfies": [
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH175"
  },
  {
    "course_code": "JEWISH 177",
    "units": 4,
    "title": "Variable Topics in Jewish Studies",
    "description": "Lecture, three hours. Variable topics; consult Schedule of Classes for topics to be offered in specific term. May be repeated for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH177"
  },
  {
    "course_code": "JEWISH M178",
    "units": 4,
    "title": "Introduction to History and Culture of Iranian Jews",
    "description": "(Same as History M178 and Iranian M178.) Lecture, three hours. Introduction to political, intellectual, cultural, and socioeconomic status of Iranian Jews. Exploration of history of Iranian Jews from ancient period throughout history, with focus on post-Middle Ages to present time. Topics, studied from perspective of Iranian cultural and intellectual history, include identity and status, religious tolerance versus forced conversion, Iranian Jewish emancipation, and dynamic symbiosis between Iranian Jews and other Iranians. P/NP or letter grading.",
    "cross_listed": [
      "IRANIAN M178",
      "HIST M178"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM178"
  },
  {
    "course_code": "JEWISH M181",
    "units": 4,
    "title": "Topics in Jewish History",
    "description": "(Same as History M181.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of major issues in Jewish history. May be repeated for maximum of 16 units with topic and/or instructor change. P/NP or letter grading.",
    "cross_listed": [
      "HIST M181"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM181"
  },
  {
    "course_code": "JEWISH M181SL",
    "units": 4,
    "title": "Jewish Thought, Politics, and Ethics: From Theory to Practice",
    "description": "(Same as History M181SL.) Lecture, three hours; fieldwork, two hours. Designed for juniors/seniors. History of Los Angeles, with special emphasis on pivotal roles Jews have played in shaping Los Angeles and role that Los Angeles has played in reshaping of Jewish identities, communities, and cultures. Exploration of themes related to regionalism in American Jewish history, comparative immigration and migration patterns, and frontiers and borderlands, while providing overview of historical methodologies and interpretation. Examination of ethical and methodological implications of writing history in digital age and learning how to read and analyze these new media works as primary and secondary historical texts. Opportunity to contribute to body of historical work related to Los Angeles Jewish history through required service work with community partners and development of digital public history projects. P/NP or letter grading.",
    "cross_listed": [
      "HIST M181SL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM181SL"
  },
  {
    "course_code": "JEWISH M182A",
    "units": 4,
    "title": "Ancient Jewish History",
    "description": "(Same as History M182A and Religion M182A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of social, political, and religious developments. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M182A",
      "HIST M182A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM182A"
  },
  {
    "course_code": "JEWISH M182B",
    "units": 4,
    "title": "Medieval Jewish History",
    "description": "(Same as History M182B and Religion M182B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exploration of unfolding of Jewish history from rise of Christianity to expulsion of Jews from Spain in 1492. P/NP or letter grading.",
    "cross_listed": [
      "RELIGN M182B",
      "HIST M182B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM182B"
  },
  {
    "course_code": "JEWISH M182C",
    "units": 4,
    "title": "Modern Jewish History",
    "description": "(Same as History M182C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of early modern Jewish history beginning with enormously repercussive expulsion of Jews from Spain in 1492, followed by transformations in Jewish society and identity over five centuries in Europe and Middle East, and concluding with nationalism. P/NP or letter grading.",
    "cross_listed": [
      "HIST M182C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM182C"
  },
  {
    "course_code": "JEWISH M184A",
    "units": 4,
    "title": "Jewish Civilization: Encounter with Great World Cultures",
    "description": "(Same as History M184A and Religion M184A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exploration of dynamic and millennia-old interaction of Jews with great world cultures. Creative adaptations that have lent Jewish culture its distinct and various forms. P/NP or letter grading.",
    "cross_listed": [
      "HIST M184A",
      "RELIGN M184A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM184A"
  },
  {
    "course_code": "JEWISH M184B",
    "units": 4,
    "title": "History of Anti-Semitism",
    "description": "(Same as History M184B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of origins and historical development of anti-Semitism. P/NP or letter grading.",
    "cross_listed": [
      "HIST M184B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM184B"
  },
  {
    "course_code": "JEWISH M184C",
    "units": 4,
    "title": "American Jewish Experience",
    "description": "(Same as History M184C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Experience of Jews in America, both historical and contemporary. P/NP or letter grading.",
    "cross_listed": [
      "HIST M184C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM184C"
  },
  {
    "course_code": "JEWISH M184D",
    "units": 4,
    "title": "History of Zionism and State of Israel",
    "description": "(Same as History M184D.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of history of State of Israel from 1948 to present. P/NP or letter grading.",
    "cross_listed": [
      "HIST M184D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM184D"
  },
  {
    "course_code": "JEWISH M187",
    "units": 4,
    "title": "Holocaust in Literature",
    "description": "(Same as Comparative Literature M165.) Lecture, three hours. Investigation of how Holocaust informs variety of literary and cinema works and raises wide range of aesthetic and moral questions. P/NP or letter grading.",
    "cross_listed": [
      "COM LIT M165"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISHM187"
  },
  {
    "course_code": "JEWISH 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH189"
  },
  {
    "course_code": "JEWISH 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH189HC"
  },
  {
    "course_code": "JEWISH 191",
    "units": 4,
    "title": "Variable Topics Research Seminars: Jewish Studies",
    "description": "Seminar, three hours. Research seminar on selected topics. Reading, discussion, and development of culminating project. May be repeated for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH191"
  },
  {
    "course_code": "JEWISH 197",
    "units": 2,
    "title": "Individual Studies in Jewish Studies",
    "description": "Tutorial, one hour. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH197"
  },
  {
    "course_code": "JEWISH 199",
    "units": 2,
    "title": "Directed Research or Senior Project in Jewish Studies",
    "description": "Tutorial, one hour. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/JEWISH199"
  }
]