[
  {
    "course_code": "MCD BIO 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO19"
  },
  {
    "course_code": "MCD BIO 30H",
    "units": 5,
    "title": "Collaborative Undergraduate Research Laboratory in Yeast, Genetics, and Molecular Biology",
    "description": "Lecture, two hours; laboratory, six hours. Limited to 24 students in Collaborative Undergraduate Research Laboratory (CURL), sponsored by Howard Hughes Medical Institute Professors Program. Basic training in biological research, covering topics in molecular genetics, molecular biology, model organism biology, and data analysis. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO30H"
  },
  {
    "course_code": "MCD BIO 50",
    "units": 5,
    "title": "Stem Cell Biology, Politics, and Ethics: Teasing Apart Issues",
    "description": "Lecture, three and one half hours; discussion, 90 minutes. Developmental biology of various types of human stem cells. Important functional differences between embryonic, hematopoietic, and adult stem cells, as well as differences in their biomedical potentials. Discussion of history of debate surrounding embryos, as well as various social, ethical, political, and economic aspects of stem cell research. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Life Sciences without Lab Credit (Scientific Inquiry)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO50"
  },
  {
    "course_code": "MCD BIO 60",
    "units": 5,
    "title": "Biomedical Ethics",
    "description": "Lecture, three hours; discussion, one hour. Examination of importance of ethics in research and exploration of how and why bioethics is relevant to reproductive screening, policy formation, public regulation, and law. Provides foundation in traditional ethics, consideration of subcategories of bioethics, neuroethics, and eugenics, and how to apply ethics to contemporary issues in research and technology. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Philosophical & Linguistic Analysis (Arts & Humanities)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO60"
  },
  {
    "course_code": "MCD BIO 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO89"
  },
  {
    "course_code": "MCD BIO 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO89HC"
  },
  {
    "course_code": "MCD BIO 90",
    "units": 5,
    "title": "Human Stem Cells and Medicine",
    "description": "Lecture, three and one half hours; discussion 90 minutes. Stem cells have potential to revolutionize way medicine is practiced today. Some stem cell therapies are already used successfully to treat thousands of people worldwide. Other stem cell therapies are considered experimental; therefore treatments must be monitored by Food and Drug Administration to ensure safety and efficacy. Some stem cell therapies are offered with minimal scientific justification, relying on hope and hype rather than scientific fact. Exploration of use of stem cells in modern medicine to take close look at science behind some of today’s most famous and infamous stem cell medical applications. P/NP or letter grading.",
    "satisfies": [
      "General Education - Life Sciences without Lab Credit (Scientific Inquiry)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO90"
  },
  {
    "course_code": "MCD BIO 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO99"
  },
  {
    "course_code": "MCD BIO 100",
    "units": 5,
    "title": "Introduction to Cell Biology",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Life Sciences 3, 4, and 23L, or 7A, 7B, 7C, and 23L. Not open for credit to Molecular, Cell, and Developmental Biology majors or to students with credit for course 165A. Analysis of cell organization, structure, and function at molecular level. Cell membranes and organelles, membrane transport, cellular signaling, cytoskeleton and cell movement, intracellular trafficking, cell energetics. Letter grading.",
    "prerequisites": [
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L"
    ],
    "credit_exclusions": [
      "MCD BIO 165A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO100"
  },
  {
    "course_code": "MCD BIO 104AL",
    "units": 5,
    "title": "Research Immersion Laboratory in Developmental Biology",
    "description": "Lecture, two hours; laboratory, eight hours. Requisites: Life Sciences 3, 4, and 23L, or 7A, 7B, 7C, 23L, and 107. Course 104AL is requisite to 104BL. Limited to Molecular, Cell, and Developmental Biology and Microbiology, Immunology, and Molecular Genetics majors. Discovery-based research using sea urchins as model system. Students determine expression of unstudied sea urchin genes using combination of molecular biology and computation techniques. May not be repeated for credit. Letter grading.",
    "prerequisites": [
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO104AL"
  },
  {
    "course_code": "MCD BIO 104BL",
    "units": 5,
    "title": "Advanced Research Analysis in Developmental Biology",
    "description": "Laboratory, six hours. Enforced requisite: course 104AL. Limited to Molecular, Cell, and Developmental Biology majors. Investigation to be primarily computational in nature whereby students use bioinformatics or mathematical modeling software to interpret, expand, or refine datasets. Use of graphics software to prepare figures and illustrations for presentations, posters, reports, and websites (database entries). Research accomplishments discussed in weekly seminar-style meetings in which student groups create PowerPoint slides and formally present results to class. Production of team poster and final report describing entire research project required. Letter grading.",
    "prerequisites": [
      "MCD BIO 104AL"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO104BL"
  },
  {
    "course_code": "MCD BIO 120",
    "units": 5,
    "title": "Reproductive Science and Health",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Life Sciences 7A, 7B, 7C, 107. Study of the cell, molecular and developmental biology of the reproductive system, and how this impacts reproductive health and pregnancy. Letter grading.",
    "prerequisites": [
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO120"
  },
  {
    "course_code": "MCD BIO M130",
    "units": 5,
    "title": "Fundamentals of Digital Imaging and Image Processing",
    "description": "(Same as Computational and Systems Biology M130.) Lecture, three hours; laboratory, two hours. Requisites: Life Sciences 7A, 7B, 7C, and Life Sciences 30A, 30B, and 40 or Statistics 13, or Mathematics 3A, 3B, and 3C, or Mathematics 31A, 31B, and 32A or 33A. Digital imaging has become integral tool to our everyday lives and to nearly every field of life sciences. Quantitative approach to learning about basic properties of digital signals and surveying fundamental methods for processing and analyzing images. Letter grading.",
    "prerequisites": [
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 30A",
      "LIFESCI 30B",
      "LIFESCI 40",
      "STATS 13",
      "MATH 3A",
      "MATH 3B",
      "MATH 3C",
      "MATH 31A",
      "MATH 31B",
      "MATH 32A",
      "MATH 33A"
    ],
    "cross_listed": [
      "C&S BIO M130"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIOM130"
  },
  {
    "course_code": "MCD BIO 138",
    "units": 5,
    "title": "Developmental Biology",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Life Sciences 3, 4, and 23L, or 7A, 7B, 7C, 23L, and 107. Development of understanding of fundamental molecular mechanisms and cellular activities guiding formation of complex organism from single fertilized egg. Development of model organisms to understand conserved nature of developmental decisions across animal kingdom, distinct features that lead to diversification of animal shape and form during evolution. Origin and roles of stem and progenitor cells in development and maintenance of specific organ systems. Roles of cell shape change, cell death, proliferation, and migration in generating shape of embryo, organs, and tissues. Mechanisms by which cells become different from and communicate with one another to coordinate their activities in time and space in embryo. Special emphasis on experimental approaches used to address these fundamental questions that determine how organized tissues and organs are formed and maintained throughout life of organism. Letter grading.",
    "prerequisites": [
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO138"
  },
  {
    "course_code": "MCD BIO M140",
    "units": 5,
    "title": "Cancer Cell Biology",
    "description": "(Same as Biological Chemistry M140.) Lecture, three hours; discussion, one hour. Requisite: course 165A. Cancer causes and genetics. Effects of cell transformation on cell growth and metabolism. Altered cell cycle, metabolism, and differentiation pathways in cancer cells. Tumor microenvironment contributions to cancer malignancy, including angiogenesis, metastasis, and immune system evasion. Letter grading.",
    "prerequisites": [
      "MCD BIO 165A"
    ],
    "cross_listed": [
      "BIOL CH M140"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIOM140"
  },
  {
    "course_code": "MCD BIO C141",
    "units": 5,
    "title": "Molecular Basis of Plant Differentiation and Development",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Life Sciences 1, 3, 4, and 23L, or 7A, 7B, 7C, 23L, and 107. In-depth study of basic processes of growth differentiation and development in plants and molecular mechanisms underlying these processes. Discussion of variety of plant systems, with focus on developing critical understanding of current experimental basis of research in this field. Concurrently scheduled with course C239. Letter grading.",
    "prerequisites": [
      "LIFESCI 1",
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIOC141"
  },
  {
    "course_code": "MCD BIO 142",
    "units": 5,
    "title": "Design Principles of Biological Circuits",
    "description": "Lecture, three hours; laboratory, four hours. Requisites: Life Sciences 7A, 7B, 7C, and 107, and Life Sciences 30A and 30B or Mathematics 3A, 3B, and 3C or Mathematics 31A and 31B, and Life Sciences 40 or Statistics 10 or 13. Quantitative analysis of genetic circuits that control behavior of biological systems, including prokaryotic model organisms and multicellular developmental systems. Introduction of basic principles of systems biology through specific examples. Application of these principles in designing synthetic genetic circuits. Letter grading.",
    "prerequisites": [
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 107",
      "LIFESCI 30A",
      "LIFESCI 30B",
      "MATH 3A",
      "MATH 3B",
      "MATH 3C",
      "MATH 31A",
      "MATH 31B",
      "LIFESCI 40",
      "STATS 10",
      "STATS 13"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO142"
  },
  {
    "course_code": "MCD BIO 143",
    "units": 5,
    "title": "Developmental Biology: Genetic Control of Organogenesis",
    "description": "Lecture, three hours; discussion, one hour. Requisites: course 138, Life Sciences 3, 4, and 23L, or 7A, 7B, 7C, 23L, and 107. Cellular and molecular basis of animal embryology, with primary emphasis on vertebrate organ development, but including pertinent material from Drosophila and other invertebrate model organisms. Letter grading.",
    "prerequisites": [
      "MCD BIO 138",
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO143"
  },
  {
    "course_code": "MCD BIO 144",
    "units": 5,
    "title": "Molecular Biology of Cellular Processes",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Life Sciences 3, 4, and 23L, or 7A, 7B, 7C, 23L, and 107. Not open for credit to students with credit for Chemistry 153B. Development of thorough understanding of fundamentals of modern molecular biology both from perspective of known molecular mechanisms for regulating fundamental processes in cells and from theoretical applied perspective for using molecular biology as laboratory tool. Special emphasis on molecular mechanisms that relate to chromatin and histone modifications, DNA replication and repair, transposition, microRNAs, meiosis, and splicing. Application of molecular biology as tool to understand embryonic development, reprogramming, cancer, and stem cells. Development of sophisticated understanding of DNA, RNA, and protein as well as capability of designing experiments to address fundamental questions in biology and interpreting experimental data. Letter grading.",
    "prerequisites": [
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "credit_exclusions": [
      "CHEM 153B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO144"
  },
  {
    "course_code": "MCD BIO 145",
    "units": 4,
    "title": "Appreciation and Critical Review of Biomedical Research",
    "description": "Seminar, four hours. Corequisite: one course from 198B, 198C, 199B, 199C. Designed to offer students perspectives on how to appreciate independent research they are conducting in faculty mentor’s laboratory, and allow them to gain wider understanding of molecular, cell, and developmental biology. Through free-form Socratic learning method, class participation and interaction with classmates is encouraged, while students gain understanding of process and value of peer evaluation, and improved verbal and written presentation skills. Letter grading.",
    "prerequisites": [
      "MCD BIO 198B",
      "MCD BIO 198C",
      "MCD BIO 199B",
      "MCD BIO 199C"
    ],
    "corequisites": [
      "MCD BIO 198B",
      "MCD BIO 198C",
      "MCD BIO 199B",
      "MCD BIO 199C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO145"
  },
  {
    "course_code": "MCD BIO 146",
    "units": 5,
    "title": "Metabolism and Disease",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Life Sciences 7A, 7B, 7C, 23L, 107. Contribution of cellular metabolism to biology of human diseases including cancer and diabetes. Exploration of major alterations of cellular metabolism in disease; tools and technologies that enable detailed characterization of metabolic alterations; therapeutic targeting of metabolic vulnerabilities; and utility of altered cellular metabolism as diagnostic and predictive biomarkers. Letter grading.",
    "prerequisites": [
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO146"
  },
  {
    "course_code": "MCD BIO C150",
    "units": 4,
    "title": "Plant Communication",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Life Sciences 3, 4, and 23L, or 7A, 7B, 7C, 23L, and 107. Most people think of plants as static organisms, yet they live in world of symbiosis and community. Plants change atmosphere, enrich soil, and communicate with insects, bacteria, and each other—Earth’s ultimate symbiote. Just as science has revealed over time misconceptions about how things work at deeper level, scientists and economists now recognize that beyond obvious need to grow above-ground biomass for fuel production, we must better understand how to make that biomass in sustainable manner. Introductory course in chemical ecology and how natural compounds affect gene expression. Emphasis on role of natural compounds in plant/microbe, plant/plant, and plant/herbivore interactions; synopsis of principles of plant defense mechanisms and responses to microbial infections. Concurrently scheduled with course C250. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIOC150"
  },
  {
    "course_code": "MCD BIO 150AL",
    "units": 5,
    "title": "Research Immersion Laboratory in Plant-Microbe Ecology",
    "description": "Lecture, two hours; laboratory, eight hours. Enforced requisites: Life Sciences 7A, 7B, 7C, 23L, 107. Course 150AL is enforced requisite to 150BL. Limited to Molecular, Cell, and Developmental Biology majors. Introductory plant-microbe biology laboratory to give students hands-on experience doing experiments and making their own observations about plants and microbiome. Letter grading.",
    "prerequisites": [
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO150AL"
  },
  {
    "course_code": "MCD BIO CM156",
    "units": 5,
    "title": "Human Genetics and Genomics",
    "description": "(Same as Microbiology CM156.) Lecture, three hours; discussion, one hour. Requisites: Life Sciences 3, 4, and 23L, or 7A, 7B, and 7C. Application of genetic principles in human populations, with emphasis on genomics, family studies, positional cloning, Mendelian and common diseases, cancer genetics, animal models, cytogenetics, pharmacogenetics, population genetics, and genetic counseling. Lectures and readings in literature, with focus on current questions in fields of medical and human genetics and methodologies appropriate to answer such questions. Concurrently scheduled with course CM256. Letter grading.",
    "prerequisites": [
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 23L",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C"
    ],
    "cross_listed": [
      "MIMG CM156"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIOCM156"
  },
  {
    "course_code": "MCD BIO 160",
    "units": 4,
    "title": "Principles of Light Microscopy",
    "description": "Lecture, three hours; laboratory, two hours. Requisites: Life Sciences 7A, 7B, 7C, 23L. Over last two decades, there has been explosion of new techniques in light microscopy which has provided us with invaluable tools for biological research. Study of light microscopy techniques currently used in research laboratories. Basics of light microscopy (image formation, magnification, resolution, contrast), widefield and fluorescence microscopy, optical sections (confocal, multi-photon, light-sheet and total internal reflection fluorescence microscope), and super-resolution microscopy. Laboratory sessions include setting up and using simple, rail-based microscope; hands-on time and demonstrations on brightfield/epiflurorescence, confocal, light-sheet and super-resolution microscopes. Letter grading.",
    "prerequisites": [
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO160"
  },
  {
    "course_code": "MCD BIO 165A",
    "units": 5,
    "title": "Biology of Cells",
    "description": "Lecture, three hours; discussion, one hour. Requisites: Chemistry 14D or 30B, Life Sciences 3, or 7A, 7B, and 7C. Not open for credit to students with credit for course 100. Molecular basis of cellular structure and function, with focus on each individual cellular organelle, as well as interaction of cells with extracellular environment and with other cells. Material presented in context of experimental questions and answers to incorporate concept of scientific method and recent advances in cell biology research. Exposure in discussions to recent scientific articles that directly relate to information examined in lectures. Letter grading.",
    "prerequisites": [
      "CHEM 14D",
      "CHEM 30B",
      "LIFESCI 3",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C"
    ],
    "credit_exclusions": [
      "MCD BIO 100"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO165A"
  },
  {
    "course_code": "MCD BIO 165B",
    "units": 5,
    "title": "Molecular Biology of Cell Nucleus",
    "description": "Lecture, three hours; discussion, two hours. Requisite: course 165A. Continuation of course 165A. Molecular biology of eukaryotic cell nucleus, with focus on structure, organization, replication, and repair of eukaryotic genome; eukaryotic gene expression, including transcription, translation, and transport; cell cycle and cancer. Study of advanced specialized topics to allow integrated approach to molecular cell biology. Material presented in context of experimental questions and answers to incorporate concept of scientific method and recent advances in cell biology research. Exposure in discussions to current literature that directly relates to information examined in lectures. Letter grading.",
    "prerequisites": [
      "MCD BIO 165A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO165B"
  },
  {
    "course_code": "MCD BIO 167",
    "units": 6,
    "title": "Genetic Engineering: History, Science, and Applications in Medicine, Agriculture, and Law",
    "description": "Lecture four hours; discussion two hours. Requisites: Life Sciences 7A, 7B. Not open for credit to students with credit for course 70 or Honors Collegium 70A. Provides historical and scientific perspective on field of genetic engineering with emphasis on social, legal, and ethical issues that arise from emerging new genetic technologies. Provides solid scientific foundation for field of genetic engineering, and puts genetic engineering into historic and social perspective so that students can make objective decisions about how this technology should be used in future. Course is highly interactive, team-oriented, problem-based, and teaches students how to think critically about experimental science, societal issues raised by advances in genetic engineering, genomics, and human reproduction. Includes interactive, media-oriented lectures with hands-on experiments and demonstrations, and seminar style discussions focusing on seminal articles in history of genetic engineering. P/NP or letter grading.",
    "prerequisites": [
      "LIFESCI 7A",
      "LIFESCI 7B"
    ],
    "credit_exclusions": [
      "MCD BIO 70",
      "HNRS 70A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO167"
  },
  {
    "course_code": "MCD BIO 168",
    "units": 5,
    "title": "Stem Cell Biology",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 138, 165A. State-of-art education of embryonic and adult stem cells and how these pluripotent/multipotent cells can be used to treat congenital defects, diseases, or injury in humans. Review of current knowledge of human and mouse embryonic stem cells and how they develop into various tissue types. Discussion of adult stem cells in hematopoietic, nervous, and other organ systems to provide examples of tissue-specific stem cells and their impact in human disease. Examination of various model organisms as examples of how model organisms have helped to discover fundamental principles in stem cell biology. How advances in cell and molecular biology and tissue engineering can be applied to use of stem cells in regenerative medicine. Ethical and legal issues related to stem cell research. Letter grading.",
    "prerequisites": [
      "MCD BIO 138",
      "MCD BIO 165A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO168"
  },
  {
    "course_code": "MCD BIO M170",
    "units": 2,
    "title": "Biochemistry and Molecular Biology of Photosynthetic Apparatus",
    "description": "(Same as Chemistry CM170.) Lecture, two to three hours; discussion, zero to two hours. Requisites: Chemistry 153A and 153B, or Life Sciences 3 and 23L, and Chemistry 153L. Recommended: Chemistry 153C, 154, Life Sciences 4. Light harvesting, photochemistry, electron transfer, carbon fixation, carbohydrate metabolism, pigment synthesis in chloroplasts and bacteria. Assembly of photosynthetic membranes and regulation of genes encoding those components. Emphasis on understanding of experimental approaches. P/NP or letter grading.",
    "prerequisites": [
      "CHEM 153A",
      "CHEM 153B",
      "LIFESCI 3",
      "LIFESCI 23L",
      "CHEM 153L"
    ],
    "cross_listed": [
      "CHEM CM170"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIOM170"
  },
  {
    "course_code": "MCD BIO 172",
    "units": 5,
    "title": "Genomics and Bioinformatics",
    "description": "Lecture, three hours; discussion, one hour. Requisite: course 144 or 165B or Chemistry 153B or Microbiology 132. Genomics is study of complete repertoire of molecules in cells. Topics include human and yeast genomes and genetic approaches to study of function of individual genes, fundamental bioinformatics algorithms used to study relationship between nucleotide and protein sequences and reconstruction of their evolution, use of microarray technologies to measure changes in gene expression, analysis of microarray data including clustering and promoter analysis, proteomics topics including protein expression and interactions, epigenomic study of DNA methylation and chromatin modification, and systems biology, or computational approaches to integrating varied genomic data to gain more complete understanding of cellular biology. Letter grading.",
    "prerequisites": [
      "MCD BIO 144",
      "MCD BIO 165B",
      "CHEM 153B",
      "MIMG 132"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO172"
  },
  {
    "course_code": "MCD BIO C174A",
    "units": 2,
    "title": "Advanced Topics in Cell and Molecular Biology: Molecular Evolution",
    "description": "Lecture, two hours. Requisites: courses 100 or 165A, 144, Life Sciences 4 or 107. Recent developments in fields of molecular, cell, and developmental biology. Current developments in field of molecular evolution. Constructing evolutionary trees at molecular level; formal testing of evolutionary hypotheses using sequencing data. Concurrently scheduled with course C222A. Letter grading.",
    "prerequisites": [
      "MCD BIO 100",
      "MCD BIO 165A",
      "MCD BIO 144",
      "LIFESCI 4",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIOC174A"
  },
  {
    "course_code": "MCD BIO C174B",
    "units": 2,
    "title": "Advanced Topics in Cell and Molecular Biology: Molecular Biology of Cell Nucleus",
    "description": "Lecture, two hours. Requisites: courses 100 or 165A, 144, Life Sciences 4 or 107. Recent developments in fields of molecular, cell, and developmental biology. Animal cell nucleus regulation of cell metabolism. Structure/function relationships, nuclear-cytoplasmic exchange, DNA replication and gene expression. Concurrently scheduled with course C222B. Letter grading.",
    "prerequisites": [
      "MCD BIO 100",
      "MCD BIO 165A",
      "MCD BIO 144",
      "LIFESCI 4",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIOC174B"
  },
  {
    "course_code": "MCD BIO C174D",
    "units": 2,
    "title": "Advanced Topics in Cell and Molecular Biology: Molecular Biology of Extracellular Matrix",
    "description": "Lecture, two hours. Requisites: courses 100 or 165A, 144. Recommended: course 138. Recent developments in fields of molecular, cell, and developmental biology. Synthesis of key extracellular matrix proteins and their assembly into supramolecular structures. Interactions of matrix proteins with cells and their influence on tissue formation. Concurrently scheduled with course C222D. Letter grading.",
    "prerequisites": [
      "MCD BIO 100",
      "MCD BIO 165A",
      "MCD BIO 144"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIOC174D"
  },
  {
    "course_code": "MCD BIO M175A",
    "units": 5,
    "title": "Neuroscience: From Molecules to Mind—Cellular and Systems Neuroscience",
    "description": "(Same as Neuroscience M101A, Physiological Science M180A, and Psychology M117A.) Lecture, four hours; discussion, 90 minutes. Requisites: Chemistry 14C or 30A (14C may be taken concurrently), Life Sciences 7C, Physics 1B or 1BH or 5C or 6B. Students must receive grade of C– or better to proceed to next course in series. Cellular neurophysiology, membrane potential, action potentials, and synaptic transmission. Sensory systems and motor system; how assemblies of neurons process complex information and control movement. P/NP or letter grading.",
    "prerequisites": [
      "CHEM 14C",
      "CHEM 30A",
      "LIFESCI 7C",
      "PHYSICS 1B",
      "PHYSICS 1BH",
      "PHYSICS 5C",
      "PHYSICS 6B"
    ],
    "cross_listed": [
      "PSYCH M117A",
      "PHYSCI M180A",
      "NEUROSC M101A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIOM175A"
  },
  {
    "course_code": "MCD BIO M175B",
    "units": 5,
    "title": "Neuroscience: From Molecules to Mind—Molecular and Developmental Neuroscience",
    "description": "(Same as Neuroscience M101B, Physiological Science M180B, and Psychology M117B.) Lecture, four hours; discussion, 90 minutes. Requisites: course M175A (with grade of C– or better), Life Sciences 7C. Molecular biology of channels and receptors: focus on voltage dependent channels and neurotransmitter receptors. Molecular biology of supramolecular mechanisms: synaptic transmission, axonal transport, cytoskeleton, and muscle. Classical experiments and modern molecular approaches in developmental neurobiology. P/NP or letter grading.",
    "prerequisites": [
      "MCD BIO M175A",
      "LIFESCI 7C"
    ],
    "cross_listed": [
      "NEUROSC M101B",
      "PHYSCI M180B",
      "PSYCH M117B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIOM175B"
  },
  {
    "course_code": "MCD BIO M175C",
    "units": 5,
    "title": "Neuroscience: From Molecules to Mind—Behavioral and Cognitive Neuroscience",
    "description": "(Same as Neuroscience M101C, Physiological Science M180C, and Psychology M117C.) Lecture, four hours; discussion, 90 minutes. Requisite: course M175A with grade of C– or better. Neural mechanisms underlying motivation, learning, and cognition. P/NP or letter grading.",
    "prerequisites": [
      "MCD BIO M175A"
    ],
    "cross_listed": [
      "PHYSCI M180C",
      "PSYCH M117C",
      "NEUROSC M101C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIOM175C"
  },
  {
    "course_code": "MCD BIO 180A",
    "units": 2,
    "title": "Scientific Analysis and Communication I",
    "description": "Seminar, two hours. Enforced corequisite: course 196A. Students read and discuss scientific articles and give presentations, introducing research topics using relevant primary literature. Critical aspects of research process, including record keeping, ethics, laboratory safety and citizenry, mechanics of scientific writing, diverse approaches to research, and project responsibilities and ownership. Acquisition of in-depth and broad knowledge about student research projects, improvement of oral and written communication skills, and full appreciation of process of doing good science and becoming skilled researchers. Letter grading.",
    "prerequisites": [
      "MCD BIO 196A"
    ],
    "corequisites": [
      "MCD BIO 196A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO180A"
  },
  {
    "course_code": "MCD BIO 180B",
    "units": 2,
    "title": "Scientific Analysis and Communication II",
    "description": "Seminar, two hours. Enforced requisites: courses 180A, 196A. Enforced corequisite: course 196B. Students give presentations similar to laboratory meeting or research symposium talk in which speakers discuss project goals, methodological approaches, results, and conclusions. How to write research papers as well as prepare and present scientific posters. Production of deliverables that demonstrate research achievements and creation of sense of pride for work accomplished as skilled researchers. Letter grading.",
    "prerequisites": [
      "MCD BIO 180A",
      "MCD BIO 196A"
    ],
    "corequisites": [
      "MCD BIO 196B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO180B"
  },
  {
    "course_code": "MCD BIO 187AL",
    "units": 5,
    "title": "Research Immersion Laboratory in Genomic Biology",
    "description": "Lecture, three hours; laboratory, six hours. Requisites: Life Sciences 4 or 107, 23L. Course 187AL is requisite to 187BL. Limited to Molecular, Cell, and Developmental Biology majors. Introduction to cutting-edge genomic technologies and bioinformatics methods and resources for genome annotation. Students propose original research projects related to gene annotation and drive their projects using bioinformatics tools. Students are provided fragments of genome from relatively poorly studied organism that has been sequenced at UCLA. May not be repeated for credit. Letter grading.",
    "prerequisites": [
      "LIFESCI 4",
      "LIFESCI 107",
      "LIFESCI 23L"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO187AL"
  },
  {
    "course_code": "MCD BIO 188",
    "units": 2,
    "title": "Special Courses in Molecular, Cell, and Developmental Biology",
    "description": "Seminar, two hours. Departmentally sponsored experimental or temporary courses, such as those taught by visiting faculty members. May be repeated for credit with topic change. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO188"
  },
  {
    "course_code": "MCD BIO 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO188SA"
  },
  {
    "course_code": "MCD BIO 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "MCD BIO 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO188SB"
  },
  {
    "course_code": "MCD BIO 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "MCD BIO 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO188SC"
  },
  {
    "course_code": "MCD BIO 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO189"
  },
  {
    "course_code": "MCD BIO 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO189HC"
  },
  {
    "course_code": "MCD BIO 191",
    "units": 2,
    "title": "Variable Topics Research Seminars: Molecular, Cell, and Developmental Biology",
    "description": "Seminar, two hours. Designed for junior/senior departmental majors. Intended for students with strong commitment to pursue graduate studies in molecular, biochemical, physiological, and biomedical fields. Weekly variable topics course with reading, discussion, and presentation of paper selected from current literature. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO191"
  },
  {
    "course_code": "MCD BIO 192A",
    "units": 4,
    "title": "Undergraduate Practicum in Molecular, Cell, and Developmental Biology",
    "description": "Seminar, three hours. Limited to junior/senior Molecular, Cell, and Developmental Biology majors. Training and supervised practicum for advanced undergraduate students. Students assist in preparation of materials and development of innovative programs under guidance of faculty members in small course settings. Consult Undergraduate Office for further information. May not be applied toward course requirements for Molecular, Cell, and Developmental Biology major. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO192A"
  },
  {
    "course_code": "MCD BIO 192B",
    "units": 2,
    "title": "Undergraduate Practicum: CityLab",
    "description": "Seminar, two hours. Limited to juniors/seniors in any life sciences major. CityLab training and supervised practicum for advanced undergraduate students. Students assist in preparation of materials and development of innovative programs under guidance of faculty members in small course settings. May not be applied toward course requirements for Molecular, Cell, and Developmental Biology major. May be repeated once for credit. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO192B"
  },
  {
    "course_code": "MCD BIO 193",
    "units": 1,
    "title": "Journal Club Seminars: Molecular, Cell, and Developmental Biology",
    "description": "Seminar, two hours. Corequisite: course 198A or 198B or 198C or 199 or 199A or 199B or 199C. Limited to juniors/seniors. Development of in-depth understanding of and ability to discuss current literature in field of students’ own research. May be repeated for credit. P/NP grading.",
    "prerequisites": [
      "MCD BIO 198A",
      "MCD BIO 198B",
      "MCD BIO 198C",
      "MCD BIO 199",
      "MCD BIO 199A",
      "MCD BIO 199B",
      "MCD BIO 199C"
    ],
    "corequisites": [
      "MCD BIO 198A",
      "MCD BIO 198B",
      "MCD BIO 198C",
      "MCD BIO 199",
      "MCD BIO 199A",
      "MCD BIO 199B",
      "MCD BIO 199C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO193"
  },
  {
    "course_code": "MCD BIO 194A",
    "units": 1,
    "title": "Research Group Seminars: Molecular, Cell, and Developmental Biology",
    "description": "Seminar, two hours. Corequisite: course 198A or 198B or 198C or 199 or 199A or 199B or 199C. Limited to juniors/seniors. Involvement in laboratory’s weekly research group meeting to encourage student participation in research and to stimulate progress in specific research areas. Discussion of use of specific research methods and current literature in field or of research of faculty members or students. May be repeated for credit. P/NP or letter grading.",
    "prerequisites": [
      "MCD BIO 198A",
      "MCD BIO 198B",
      "MCD BIO 198C",
      "MCD BIO 199",
      "MCD BIO 199A",
      "MCD BIO 199B",
      "MCD BIO 199C"
    ],
    "corequisites": [
      "MCD BIO 198A",
      "MCD BIO 198B",
      "MCD BIO 198C",
      "MCD BIO 199",
      "MCD BIO 199A",
      "MCD BIO 199B",
      "MCD BIO 199C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO194A"
  },
  {
    "course_code": "MCD BIO 194B",
    "units": 2,
    "title": "Research Group Seminars: Current Topics in Biomedical Sciences",
    "description": "Seminar, two hours. Limited to juniors/seniors in research traineeships or those who have strong commitment to pursue graduate studies in molecular, biochemical, physiological, or biomedical fields. Weekly presentation and discussion of paper selected from current literature. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO194B"
  },
  {
    "course_code": "MCD BIO 196A",
    "units": 4,
    "title": "Research Apprenticeship I in Molecular, Cell, and Developmental Biology",
    "description": "Tutorial, 12 hours. Requisites: Life Sciences 3 and 4, or 7A, 7B, 7C, 23L, and 107, 3.0 premajor and/or major grade-point average, and at least one term of prior experience in same laboratory in which 196A research is to be conducted. Corequisite: course 180A. Course 196A is requisite to 196B. Designed for undergraduate students who are interested in pursuing inquiry-based and hypothesis-driven research experience in laboratory of departmental or preapproved faculty mentor. Guided research course to be taken in conjunction with course 180A, followed by continuation research course 196B. Technical aspects vary depending on specific laboratory; however, all students learn how to apply scientific method: propose hypothesis, identify experiments to address hypothesis, perform experiments, and analyze results. How to record information from experimental activities into laboratory notebooks and to write research proposals. Letter grading.",
    "prerequisites": [
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107",
      "LIFESCI 3"
    ],
    "corequisites": [
      "MCD BIO 180A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO196A"
  },
  {
    "course_code": "MCD BIO 196B",
    "units": 4,
    "title": "Research Apprenticeship II in Molecular, Cell, and Developmental Biology",
    "description": "Tutorial, 12 hours. Enforced requisites: courses 180A, 196A. Enforced corequisite: course 180B. Technical aspects vary depending on specific laboratory; however, all students use scientific method learned in course 196A and continue same experimental scope proposed, but with additional degree of independence in technical and intellectual aspects of research. Letter grading.",
    "prerequisites": [
      "MCD BIO 180A",
      "MCD BIO 196A"
    ],
    "corequisites": [
      "MCD BIO 180B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO196B"
  },
  {
    "course_code": "MCD BIO 198A",
    "units": 4,
    "title": "Honors Research in Molecular, Cell, and Developmental Biology",
    "description": "Tutorial, 12 hours. Requisites: Life Sciences 3 and 4, or 7A, 7B, 7C, 23L, and 107. Course 198A is requisite to 198B, which is requisite to 198C. Limited to junior/senior Molecular, Cell, and Developmental Biology majors. Development and completion of comprehensive research project and honors thesis under direct supervision of approved faculty member to broaden and deepen students’ knowledge of some phase of molecular, cell, and developmental biology. Must be taken for at least three terms and for total of 12 units. Report on progress must be presented to undergraduate adviser each term 198 course is taken. Individual contract required. In Progress grading (credit to be given only on completion of course 198B).",
    "prerequisites": [
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO198A"
  },
  {
    "course_code": "MCD BIO 198B",
    "units": 4,
    "title": "Honors Research in Molecular, Cell, and Developmental Biology",
    "description": "Tutorial, 12 hours. Requisites: course 198A, Life Sciences 3 and 4, or 7A, 7B, 7C, 23L, and 107. Limited to junior/senior Molecular, Cell, and Developmental Biology majors. Development and completion of comprehensive research project and honors thesis under direct supervision of approved faculty member to broaden and deepen students’ knowledge of some phase of molecular, cell, and developmental biology. Must be taken for at least three terms and for total of 12 units. Report on progress must be presented to undergraduate adviser each term 198 course is taken. Individual contract required. Letter grading.",
    "prerequisites": [
      "MCD BIO 198A",
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO198B"
  },
  {
    "course_code": "MCD BIO 198C",
    "units": 4,
    "title": "Honors Research in Molecular, Cell, and Developmental Biology",
    "description": "Tutorial, 12 hours. Requisites: course 198B, Life Sciences 3 and 4, or 7A, 7B, 7C, 23L, and 107. Limited to junior/senior Molecular, Cell, and Developmental Biology majors. Development and completion of comprehensive research project and honors thesis under direct supervision of approved faculty member to broaden and deepen students’ knowledge of some phase of molecular, cell, and developmental biology. Must be taken for at least three terms and for total of 12 units. Report on progress must be presented to undergraduate adviser each term 198 course is taken. Individual contract required. Letter grading.",
    "prerequisites": [
      "MCD BIO 198B",
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO198C"
  },
  {
    "course_code": "MCD BIO 198D",
    "units": 4,
    "title": "Honors Research in Molecular, Cell, and Developmental Biology",
    "description": "Tutorial, 12 hours. Requisites: Life Sciences 3 and 4, or 7A, 7B, 7C, 23L, and 107. Limited to junior/senior Molecular, Cell, and Developmental Biology majors. Development and completion of comprehensive research project and honors thesis under direct supervision of approved faculty member to broaden and deepen students’ knowledge of some phase of molecular, cell, and developmental biology. Must be taken for at least three terms and for total of 12 units. Report on progress must be presented to undergraduate adviser each term 198 course is taken. Individual contract required. Letter grading.",
    "prerequisites": [
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO198D"
  },
  {
    "course_code": "MCD BIO 199",
    "units": 4,
    "title": "Special Studies Directed Research in Molecular, Cell, and Developmental Biology",
    "description": "Tutorial, 12 hours. Preparation: submission of written proposal to department for approval by appropriate term deadline. Proposal to be developed in consultation with instructor, outlining research study to be undertaken. Requisites: Life Sciences 3 and 4, or 7A, 7B, 7C, 23L, and 107. Limited to juniors/seniors. Department majors may enroll with sponsorship from department faculty members or preapproved outside faculty members. Other junior/senior life sciences majors may enroll only with department faculty sponsors. Supervised individual research under guidance of faculty mentor. Studies to involve laboratory research, not literature surveys or library research. At end of term culminating paper describing progress of project and signed by student and instructor must be presented to department. May be repeated for credit. Individual contract required. Letter grading.",
    "prerequisites": [
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO199"
  },
  {
    "course_code": "MCD BIO 199A",
    "units": 4,
    "title": "Directed Research in Molecular, Cell, and Developmental Biology",
    "description": "Tutorial, 12 hours. Preparation: minimum 3.0 grade-point average in major. Requisites: Life Sciences 3 and 4, or 7A, 7B, 7C, 23L, and 107. Course 199A is requisite to 199B, which is requisite to 199C, which is requisite to 199D. Limited to juniors/seniors. Department majors may enroll with sponsorship from department faculty members or preapproved outside faculty members. Other junior/senior life sciences majors may enroll only for research projects in laboratories with department faculty sponsors. Supervised individual research under guidance of faculty mentor. Culminating research project designed to broaden and deepen students’ knowledge of some phase of molecular, cell, and developmental biology. Must be taken for at least two terms and for total of at least 8 units. Individual contract required. In Progress grading (credit to be given only on completion of course 199B). Students may elect to enroll in additional research through courses 199C and 199D (letter grading). Report on progress must be presented to department each term 199A through 199D course is taken.",
    "prerequisites": [
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO199A"
  },
  {
    "course_code": "MCD BIO 199B",
    "units": 4,
    "title": "Directed Research in Molecular, Cell, and Developmental Biology",
    "description": "Tutorial, 12 hours. Preparation: minimum 3.0 grade-point average in major. Requisites: course 199A, Life Sciences 3 and 4, or 7A, 7B, 7C, 23L, and 107. Limited to juniors/seniors. Department majors may enroll with sponsorship from department faculty members or preapproved outside faculty members. Other junior/senior life sciences majors may enroll only for research projects in laboratories with department faculty sponsors. Supervised individual research under guidance of faculty mentor. Culminating research project designed to broaden and deepen students? knowledge of some phase of molecular, cell, and developmental biology. Must be taken for at least two terms and for total of at least 8 units. Individual contract required. Letter grading. Students may elect to enroll in additional research through courses 199C and 199D (letter grading). Report on progress must be presented to department each term 199A through 199D course is taken.",
    "prerequisites": [
      "MCD BIO 199A",
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO199B"
  },
  {
    "course_code": "MCD BIO 199C",
    "units": 4,
    "title": "Directed Research in Molecular, Cell, and Developmental Biology",
    "description": "Tutorial, 12 hours. Preparation: minimum 3.0 grade-point average in major. Requisites: course 199B, Life Sciences 3 and 4, or 7A, 7B, 7C, 23L, and 107. Limited to juniors/seniors. Department majors may enroll with sponsorship from department faculty members or preapproved outside faculty members. Other junior/senior life sciences majors may enroll only for research projects in laboratories with department faculty sponsors. Supervised individual research under guidance of faculty mentor. Culminating research project designed to broaden and deepen students’ knowledge of some phase of molecular, cell, and developmental biology. Must be taken for at least two terms and for total of at least 8 units. Students may elect to enroll in additional research through courses 199C and 199D. Report on progress must be presented to department each term 199A through 199D course is taken. Individual contract required. Letter grading.",
    "prerequisites": [
      "MCD BIO 199B",
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO199C"
  },
  {
    "course_code": "MCD BIO 199D",
    "units": 4,
    "title": "Directed Research in Molecular, Cell, and Developmental Biology",
    "description": "Tutorial, 12 hours. Preparation: minimum 3.0 grade-point average in major. Requisites: course 199C, Life Sciences 3 and 4, or 7A, 7B, 7C, 23L, and 107. Limited to juniors/seniors. Department majors may enroll with sponsorship from department faculty members or preapproved outside faculty members. Other junior/senior life sciences majors may enroll only for research projects in laboratories with department faculty sponsors. Supervised individual research under guidance of faculty mentor. Culminating research project designed to broaden and deepen students’ knowledge of some phase of molecular, cell, and developmental biology. Must be taken for at least two terms and for total of at least 8 units. Students may elect to enroll in additional research through courses 199C and 199D. Report on progress must be presented to department each term 199A through 199D course is taken. Individual contract required. Letter grading.",
    "prerequisites": [
      "MCD BIO 199C",
      "LIFESCI 3",
      "LIFESCI 4",
      "LIFESCI 7A",
      "LIFESCI 7B",
      "LIFESCI 7C",
      "LIFESCI 23L",
      "LIFESCI 107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/MCDBIO199D"
  }
]