[
  {
    "course_code": "PSYCTRY 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY19"
  },
  {
    "course_code": "PSYCTRY 79",
    "units": 5,
    "title": "Applied Positive Neuroscience: Skills for Improving Productivity and Well-Being",
    "description": "Lecture, three hours; discussion, one hour. Not open to students with credit for Community Health Sciences 179. Intrapersonal, interpersonal, and extrapersonal contributions to well-being, and how activity and chemistry of key brain regions contribute to each, e.g. influences of mindfulness on prefrontal cortex activity, or how oxytocin system is altered by social interaction. Students learn to recognize relationship between cognitive, social, and emotional competence for healthy development, and how to apply it to their own lives. Through neuroscientific context, introduction to multidisciplinary perspectives on variety of topics that are widely considered significant maturational tasks for young adults, including emotion regulation, managing social relationships, enhancing productivity, and identity development. P/NP or letter grading.",
    "satisfies": [
      "General Education - Life Sciences without Lab Credit (Scientific Inquiry)"
    ],
    "credit_exclusions": [
      "COM HLT 179"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY79"
  },
  {
    "course_code": "PSYCTRY 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY89"
  },
  {
    "course_code": "PSYCTRY 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY89HC"
  },
  {
    "course_code": "PSYCTRY 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY99"
  },
  {
    "course_code": "PSYCTRY 173",
    "units": 4,
    "title": "Mental Health: Bias, Inequities, and Racism",
    "description": "(Formerly numbered 188.) Lecture, three hours. Our brains bias our behaviors to optimize functioning in our environment but often based on premises that are contrary to society goals of equality. Biases, both implicit and explicit are prevalent, and their existence leads to both overt and covert decision-making based on race, financial status, gender, and disabilities. Focus on biases, inequities, and disparities that surround mental health. Exploration of relevant biases in society and how they may arise. Students learn about implicit and explicit bias, and discuss instruments attempting to measure biases including implicit-association test. Exploration of multiple areas related to structural racism and how it contributes to mental health inequities. Review of biases against those with mental health disorders, exacerbation of mental health disorders, health inequities because of racism and discrimination, and treatment biases for mental health disorders. Consideration of current and historical research and relevance of public policies and criminal justice system in creating and perpetuating health inequities. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY173"
  },
  {
    "course_code": "PSYCTRY 174",
    "units": 5,
    "title": "Brain and Behavioral Health: Childhood and Adolescence",
    "description": "Seminar, three hours. Limited to junior/senior Neuroscience or Psychology majors. Integration of problem-based learning approach to teach foundational information about application of brain and behavioral science to understanding and promotion of child and adolescent mental health. Exploration of integration of developmental psychopathology, applied treatment research, and public policy to identify and dismantle barriers to problems. Focus on set of key topics (e.g., autism, mood disorders, anxiety disorders, and substance use disorders) during childhood and adolescence. Research of childhood and adolescent mental health and public policy literature. Guest facilitators with expertise complement study of emerging treatment advances, applications, and barriers. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY174"
  },
  {
    "course_code": "PSYCTRY 175",
    "units": 4,
    "title": "Mindfulness Practice and Theory",
    "description": "Seminar, five hours. Designed for beginners; prior experience with meditation not required. Introduction to mindfulness, including basic mindfulness meditation practices, both sitting and moving, ways to deepen positive emotions like gratitude, kindness, and joy, and methods for integrating more awareness and creativity into ordinary activities. Examination of varying meditative traditions as well as emerging science on beneficial effects of mindfulness practice for mental and physical health. Beneficial effects include reduced stress, improved attention, reduced emotional reactivity, and greater mind-body awareness. Learning and development of practical skills of relational mindfulness in interactions with others. Offered in summer only. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY175"
  },
  {
    "course_code": "PSYCTRY 176",
    "units": 5,
    "title": "Brain and Behavioral Health: Adulthood and Aging",
    "description": "Seminar, five hours. Limited to junior/senior Neuroscience or Psychology majors. Integration of problem-based learning approach to teach foundational information about application of brain and behavioral science to understanding and promotion of mental health during adulthood and aging. Exploration of integration of developmental psychopathology, applied treatment research, and public policy to identify and dismantle barriers to problems. Focus on set of key topics (e.g., depression, dementia, post-traumatic stress disorder) during adulthood and aging. Research of mental health and public policy literature. Guest facilitators with expertise complement study of emerging treatment advances, applications, and barriers. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY176"
  },
  {
    "course_code": "PSYCTRY 177A",
    "units": 4,
    "title": "Brain and Behavioral Health Clinical Practicum",
    "description": "Fieldwork, six hours; discussion, one hour. Designed to provide students with integrated set of learning experiences related to mental health and wellness across lifespan. Through applied approach to brain and behavioral science, exploration of integration of developmental psychopathology, assessment and treatment research, and public policy to address issues related to psychological health and wellness. Focus on key topics (e.g., different classes of psychiatric illness) during childhood, adolescence, and adulthood offering direct exposure to health-care settings, clinical populations, and interdisciplinary teams that treat them. Students participate in assigned health setting under supervision of faculty mentor. Through observation of activities in clinical health setting, students see firsthand how brain and behavior science translates into real-world care. In Progress grading (credit to be given only on completion of course 177B.)",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY177A"
  },
  {
    "course_code": "PSYCTRY 177B",
    "units": 4,
    "title": "Brain and Behavioral Health Clinical Practicum",
    "description": "Fieldwork, six hours; discussion, one hour. Designed to provide students with integrated set of learning experiences related to mental health and wellness across lifespan. Through applied approach to brain and behavioral science, exploration of integration of developmental psychopathology, assessment and treatment research, and public policy to address issues related to psychological health and wellness. Focus on key topics (e.g., different classes of psychiatric illness) during childhood, adolescence, and adulthood offering direct exposure to health-care settings, clinical populations, and interdisciplinary teams that treat them. Students participate in assigned health setting under supervision of faculty mentor. Through observation of activities in clinical health setting, students see firsthand how brain and behavior science translates into real-world care. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY177B"
  },
  {
    "course_code": "PSYCTRY 178",
    "units": 4,
    "title": "Cannabis and Cannabinoids: From Pharmacology to Public Policy",
    "description": "Lecture, three hours. Designed for undergraduate students with biology, human biology and society, neuroscience, physiology, or psychology background and graduate students in neuroscience-related programs. Relevant for those considering career in medical, social science, or policy fields. Offers comprehensive didactic information concerning Cannabis plant and relates basic information with clinical and societal use of plant and its extracts. Analysis of pharmacology of exogenous and endogenous cannabinoids at the molecular, cellular, and behavioral levels. Study of physiological and psychological actions of phytocannabinoids (focusing on THC and CBD) and synthetic cannabinoids and evidence-based research of potential benefits and harms of different cannabinoids. Review of issues related to cannabinoid policy including legislation, FDA regulation, and health care services. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY178"
  },
  {
    "course_code": "PSYCTRY M182",
    "units": 4,
    "title": "Personal Brain Management",
    "description": "(Same as Neuroscience M161.) Seminar, four hours. Basic overview of brain function and consideration of some management methods that exist already, and what future may hold. New methods for predicting our own futures and modeling what if scenarios that might alter risks and benefits of different courses of action, based on individual genetic background and other elements of personal history and environmental exposures. Introduction to key principles from science of behavior change, illustrating how important health-related behavioral habits are and how difficult these can be to change and why. Coverage of series of topics that center on personal enhancement of well-being through consideration of stress management, long-term goal and value identification, mapping of long-term goals onto immediate actions, reinforcement learning, meditation, neurofeedback, and time management. Critical appraisal of tools to help students distinguish scientifically validated procedures. Offered in summer only. Letter grading.",
    "cross_listed": [
      "NEUROSC M161"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRYM182"
  },
  {
    "course_code": "PSYCTRY 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY188SA"
  },
  {
    "course_code": "PSYCTRY 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "PSYCTRY 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY188SB"
  },
  {
    "course_code": "PSYCTRY 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "PSYCTRY 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY188SC"
  },
  {
    "course_code": "PSYCTRY 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY189"
  },
  {
    "course_code": "PSYCTRY 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY189HC"
  },
  {
    "course_code": "PSYCTRY 197",
    "units": 2,
    "title": "Individual Studies in Psychiatry",
    "description": "Tutorial, four hours. Limited to juniors/seniors. Individual intensive study, with scheduled meetings to be arranged between faculty member and student. Assigned reading and tangible evidence of mastery of subject matter required. May be taken for letter grade once only. May be repeated for credit. Individual contract required. Additional information and contract forms are available in Office of Education, 38-216 Semel Institute. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY197"
  },
  {
    "course_code": "PSYCTRY 199",
    "units": 2,
    "title": "Directed Research in Psychiatry and Biobehavioral Sciences",
    "description": "Tutorial, two hours. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PSYCTRY199"
  }
]