[
  {
    "course_code": "PUB AFF 10",
    "units": 5,
    "title": "Social Problems and Social Change",
    "description": "Lecture, three hours; discussion, one hour. Introduction to social scientific approaches to study of social problems and their solutions. Using selected contemporary social problems as cases, and drawing on variety of sources (such as scholarly readings, video clips, and guest speakers), exploration of how social problems and their solutions come to be defined, roles that economic, political, educational, and cultural institutions play in perpetuating or solving social problems, and how individuals, social advocates, and communities can lead or impede social change. Letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF10"
  },
  {
    "course_code": "PUB AFF 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF19"
  },
  {
    "course_code": "PUB AFF 20",
    "units": 5,
    "title": "Power, Politics, and Policy Change",
    "description": "Lecture, three hours; discussion, one hour. Introduction to key institutions of government, politics, and policy in U.S., covering their history, contemporary forms, and internal dynamics. Includes various scales and branches of government as well as institutions that exercise power and influence in public decision making and social action, such as corporations, unions, media, social movements, and civil society. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF20"
  },
  {
    "course_code": "PUB AFF 30",
    "units": 5,
    "title": "Comparative Analysis of Wealth, Policy, and Power",
    "description": "Lecture, three hours; discussion, one hour. Exploration of strategic interactions that give rise to social problems around world, what can be done to address them, and how different polities have tried (and sometimes failed) to mount effective response. Applications include climate change, antivaccination movement, protest and repression, war and formation of states, corruption, and human and drug trafficking. Letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF30"
  },
  {
    "course_code": "PUB AFF 40",
    "units": 5,
    "title": "Microeconomics for Public Affairs",
    "description": "Lecture, three hours; discussion, one hour. Introduction to principles of microeconomics with focus on social and policy problems. Study of decisions by firms and individuals, and implications for allocation of resources. Application of economic models to public issues such as social safety net, minimum wage, education, inequality, and poverty. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF40"
  },
  {
    "course_code": "PUB AFF 50",
    "units": 5,
    "title": "Foundations and Debates in Public Thought",
    "description": "Lecture, three hours; discussion, one hour. Introduction of core concepts of democracy and equality and challenges to implementation posed by race, class, and gender inequality. Review of standards by which political systems can be judged to be democratic and identification of obstacles to their mutual implementation. Focus on inequality, its historical causes and modern consequences. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF50"
  },
  {
    "course_code": "PUB AFF 60",
    "units": 5,
    "title": "Using Data to Learn about Society: Introduction to Empirical Research and Statistics",
    "description": "Lecture, three hours; discussion, two hours. Not open for credit to students with credit for Economics 41, Political Science 6, Statistics 10, 12, 13, or 15. Introduction to statistics through examination of topics of public interest. Familiarization with research design principles and hands-on data analysis using statistical software. Students learn how to find and organize quantitative data; summarize, display, and interpret data; draw inferences from samples (including understanding margins of error, standard errors, and confidence intervals); test hypotheses about associations between two variables (including tests of proportion, t-tests, chi-squared, correlation); and communicate findings to lay audience. Letter grading.",
    "satisfies": [
      "Quantitative Reasoning"
    ],
    "credit_exclusions": [
      "POL SCI 6",
      "STATS 15",
      "STATS 12",
      "STATS 13",
      "STATS 10",
      "ECON 41"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF60"
  },
  {
    "course_code": "PUB AFF 70",
    "units": 4,
    "title": "Information, Evidence, and Persuasion",
    "description": "Lecture, three hours; discussion, one hour. Examination of sources and varieties of knowledge produced in social sciences. Evaluation of types of evidence, arguments, and persuasion on social problems and public issues. Examination of public life of evidence and arguments by different actors in social policy-making, persuasion, and propaganda process. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF70"
  },
  {
    "course_code": "PUB AFF 80",
    "units": 4,
    "title": "How Social Environments Shape Human Development",
    "description": "Lecture, three hours; discussion, one hour. Overview of major theoretical, conceptual, and empirical traditions in study of human development. Exploration of how diverse cultural, social, socioeconomic, and historical contexts interact with biological, cognitive, and psychological processes to affect individuals during key developmental periods (such as early childhood, childhood, adolescence, early adulthood, and late adulthood). Topics may include historical changes in families, schools, neighborhoods, and workplace; economic conditions of families, schools, and neighborhoods; enduring effects of childhood on adult well-being; and impact of ascribed characteristics such as gender, race, and nationality on individuals’ environments, pathways, and outcomes. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF80"
  },
  {
    "course_code": "PUB AFF 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF89"
  },
  {
    "course_code": "PUB AFF 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF89HC"
  },
  {
    "course_code": "PUB AFF 95",
    "units": 2,
    "title": "Introduction to Community or Corporate Internships in Public Affairs",
    "description": "Tutorial, two hours; fieldwork, eight hours. Limited to freshmen/sophomores. Entry-level internship in supervised setting in corporate, governmental, or nonprofit/community organization setting related to public affairs. Students meet on regular basis with instructor and provide periodic reports of their experience. Individual contract with supervising faculty member required. May be repeated for credit. May not be used toward Public Affairs major capstone requirement; consult with undergraduate adviser. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF95"
  },
  {
    "course_code": "PUB AFF 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF99"
  },
  {
    "course_code": "PUB AFF M109",
    "units": 4,
    "title": "Introduction to Cities and Planning",
    "description": "(Same as Urban Planning M120.) Lecture, three hours; discussion, one hour. Survey of urban history and evolution in U.S., urban social theory, current growth trends, system of cities, urban economy and economic restructuring, traditional and alternative location theories, urban transportation, and residential location and segregation. Letter grading.",
    "cross_listed": [
      "URBN PL M120"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM109"
  },
  {
    "course_code": "PUB AFF 110",
    "units": 4,
    "title": "Urban Revolution: Space and Society in Global Context",
    "description": "Lecture, three hours; discussion, one hour. Examination of potentialities and challenges of 21st-century urban revolution in global context. Introduction of theoretical frameworks and conceptual methods used by urban studies and planning to study cities and urban transformations, and historical and contemporary analysis of urbanization to learn about key urban processes such as agglomeration, segregation, gentrification, and suburbanization. Students learn about institutions and policies governing transportation and housing, and forms of community organizing and civil society that seek to redress urban inequalities. Introduction to key theories of space and utopian visions of urbanism. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF110"
  },
  {
    "course_code": "PUB AFF 111",
    "units": 4,
    "title": "Microeconomics: Market Failures and Inequality",
    "description": "Lecture, three hours; discussion, one hour. Requisites: courses 40 (or Economics 1 or 11 or equivalent introductory economics course), 60 (or Political Science 6 or Statistics 10 or equivalent introductory statistics course). Introduction to economic theory for policy analysis. Broad focus on evaluating rationale for government intervention in economy, in particular to address market failures and issues of economic inequality. Major emphasis on market failures in context of environmental sustainability, and economic inequality arising from markets for human capital, health, housing, and labor. Students are expected to have working knowledge of basic statistical and economic concepts. Letter grading.",
    "prerequisites": [
      "PUB AFF 40",
      "ECON 1",
      "ECON 11",
      "ECON 60",
      "POL SCI 6",
      "STATS 10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF111"
  },
  {
    "course_code": "PUB AFF 112",
    "units": 4,
    "title": "Social Movements",
    "description": "Lecture, three hours; discussion, one hour. Introduction to theories, real-life examples, and applied skills for understanding and contributing to social movements. Examination of how and why social movements emerge; how and why people join, lead, stay, or drop out of movements; and strategies and tactics by which social movements enact change. Draws upon wide range of social movements inside and outside of U.S. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF112"
  },
  {
    "course_code": "PUB AFF 113",
    "units": 4,
    "title": "Policy Analysis: Approaches to Addressing Social Problems",
    "description": "Lecture, three hours; discussion, one hour. Introduction to applied policy analysis designed to train students in logic of public policy analysis, introduce them to general skills required to do policy analysis, and to prepare them in persuasive presentation of their work. Development of skills fundamental to effective policy analysis and argumentation. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF113"
  },
  {
    "course_code": "PUB AFF 114",
    "units": 4,
    "title": "People, Organizations, and Systems",
    "description": "Lecture, three hours. Theoretical approaches to human service organizations to explore social ecology of helping relationships and problem-solving processes in which helpers and clients in organizations engage. Examination of organizational structures/function. Study of interplay between individual clients, organizations, larger systems, and social and cultural backdrop. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF114"
  },
  {
    "course_code": "PUB AFF 115",
    "units": 5,
    "title": "Using Quantitative Methods to Understand Social Problems and their Potential Solutions",
    "description": "Lecture, three hours; discussion, two hours. Requisite: course 60 or equivalent introductory statistics course. Course in R preferred. Introduction to multivariate quantitative research models used to answer questions in social science. Students gain practical and intuitive understanding of multivariate regression, program evaluation, and research methods, and apply knowledge by analyzing real world data. Focus on practical analytic tools using statistical software. Letter grading.",
    "prerequisites": [
      "PUB AFF 60"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF115"
  },
  {
    "course_code": "PUB AFF 116",
    "units": 5,
    "title": "Using Qualitative Methods to Understand Social Problems and Their Potential Solutions",
    "description": "Lecture, three hours; discussion, two hours. Introduction to qualitative research methods with focus on ethnographic observations, interviewing, and focus groups. Students practice conducting variety of qualitative methods. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF116"
  },
  {
    "course_code": "PUB AFF M117B",
    "units": 4,
    "title": "Network Science Using R",
    "description": "(Same as Public Policy CM177.) Lecture, three hours. No prior knowledge of R required. Designed for juniors and seniors. Network analysis offers framework for understanding how relationships between people, places, and institutions affect public policy outcomes. For example, why individuals decide to protest or vote, amount of education they pursue, or effect of human interference in ecosystem can all be considered using network analysis. Weekly introduction of concept from network analysis, followed by working through it using popular statistical programming language R. Letter grading.",
    "cross_listed": [
      "PUB PLC CM177"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM117B"
  },
  {
    "course_code": "PUB AFF M117C",
    "units": 4,
    "title": "Community-Engaged Research Methods",
    "description": "(Same as Chicana/o and Central American Studies M129 and Labor Studies M129.) Lecture, four hours. Students are trained in designing, drafting, piloting, and administering new survey focused on transitions to adulthood. Written in collaboration with labor and community partners serving Latinx, Asian Americans and Pacific Islanders, Black, and Indigenous youth and low-wage workers, this survey gathers data on workforce development, labor rights, education, health, mental health, and civic engagement of young people residing in Black, Indigenous, and people of color communities. Students are exposed to historical development of racial statistics, role of racial statistics in contemporary life, and critical quantitative science. Includes testing questions on racial identity and attitudes, gender identity, workforce development, labor rights, healing and wellness, and other topics determined by labor and community partners. P/NP or letter grading.",
    "cross_listed": [
      "CCAS M129",
      "LBR STD M129"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM117C"
  },
  {
    "course_code": "PUB AFF M117DX",
    "units": 4,
    "title": "Data Analysis for Educational Equity and Improvement",
    "description": "(Formerly numbered M117D.) (Same as Public Policy CM126XP.) Lecture, three hours. Requisite: course 60. Exploration of challenge of making data useful for decision-making from cleaning data and deciding which analyses to conduct; to conducting those analyses carefully, thoughtfully, and in reproducible way; to displaying results, interpreting them, and communicating them clearly. Focus on challenge of making survey data useful to educators so that they can use those data to reflect on school and district policies and practices and, ultimately, use information to improve students’ school experiences. Letter grading.",
    "prerequisites": [
      "PUB AFF 60"
    ],
    "cross_listed": [
      "PUB PLC CM126XP"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM117DX"
  },
  {
    "course_code": "PUB AFF 120",
    "units": 4,
    "title": "Urban Poverty and Public Policy",
    "description": "Lecture, three hours. Exploration of how neighborhoods characterized by concentrated poverty affect urban residents. Evaluation of relative efficacy of various public policies that aim to improve life chances of urban poor. Use of explicitly political lens, evaluating roles that elite institutions, mass behavior, class and race-based power disparities, and public opinion play in development and implementation of urban policy. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF120"
  },
  {
    "course_code": "PUB AFF 121",
    "units": 4,
    "title": "Race, Class, Gender, and Spatial Inequality",
    "description": "Lecture, three hours. Introduction to economic and sociological approaches to analyzing dimensions, causes, and consequences of inequality in society. Introduction to public policy concepts and tools for analyzing key urban, labor, and social policies that may help to alleviate inequality in society. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF121"
  },
  {
    "course_code": "PUB AFF M122",
    "units": 4,
    "title": "Participatory Action Research on Youth Organizing for Racial Justice",
    "description": "(Same as African American Studies M129B, American Indian Studies M129, Asian American Studies M128, and Chicana/o and Central American Studies M129B.) Lecture, four hours. Students are trained to conduct participatory action research on grassroots youth organizing across California. Students gain historical and theoretical background on multi-racial and inclusive organizing. Students learn how to collect and analyze data pertaining to pressing organizing issues. Study and critical analysis of youth organizing strategies. Weekly training modules on data collection and grassroots organizing strategies that prepare students for internships in grassroots youth organizing groups serving Asian American, Black, Latinx, and Native American communities. P/NP or letter grading.",
    "cross_listed": [
      "CCAS M129B",
      "AM IND M129",
      "AF AMER M129B",
      "ASIA AM M128"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM122"
  },
  {
    "course_code": "PUB AFF 123",
    "units": 4,
    "title": "History and Public Policy",
    "description": "Seminar, three hours. Consideration of the deep history of racialized displacement in Los Angeles to generate new lines of critique and possibility into the contemporary struggle over displacement. Study engages in a case-study approach to explore the histories of race, gender, sovereignty, conquest, property, public policy, commons, class, and economies of shelter. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF123"
  },
  {
    "course_code": "PUB AFF M124",
    "units": 4,
    "title": "Child Welfare Policy in America",
    "description": "(Same as Social Welfare M151.) Lecture, three hours. Limited to juniors/seniors. Examination of public child welfare system in the U.S. Review of social policies and programs that impact children. History of social policies and programs for children, including discussion of orphanages, foster care, and adoptions. Transformation of public child welfare system into child protection system. Impact of welfare reform on child policies and programs in the U.S. Major programs designed to provide safety net for disadvantaged children, including welfare, food stamps, child care, child support, and children’s allowance programs. Review of research and analysis in this area. Overview of social policies and programs that impact children in the U.S. Examination of comparative policies in other countries. P/NP or letter grading.",
    "cross_listed": [
      "SOC WLF M151"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM124"
  },
  {
    "course_code": "PUB AFF M125",
    "units": 4,
    "title": "Creating Safe and Welcoming Schools",
    "description": "(Formerly numbered 125.) (Same as Education M177.) Lecture, two hours; discussion, one hour. Examination of historical context and causes of school violence, theories, and diverse perceptions of school climate and safety. Special emphasis on impact of school climate on oppressed groups and how social contexts such as poverty and how neighborhood resources influence school safety. Letter grading.",
    "cross_listed": [
      "EDUC M177"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM125"
  },
  {
    "course_code": "PUB AFF 128",
    "units": 4,
    "title": "Practical Applications of Research on Emerging Adults",
    "description": "Lecture, three hours. Focus on practical applications of research on critical transition period in human development—emerging adulthood—with particular emphasis on experiences of college students. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF128"
  },
  {
    "course_code": "PUB AFF M129XP",
    "units": 4,
    "title": "Intergenerational Communication across Lifespan",
    "description": "(Same as Gerontology M142XP and Social Welfare M142XP.) Lecture, three hours; fieldwork, one hour. Limited to juniors/seniors. What do you say to your parents in conversation? How do you talk to your grandparents? Does your family talk well to one another as group? How do you communicate well with boss who is 30 years older than you? Individuals of all ages interact with one another, and their interactions have significance throughout their lives. Introduction to psychological, interpersonal, and societal issues related to intergenerational communication across lifespan. Letter grading.",
    "cross_listed": [
      "SOC WLF M142XP",
      "GRNTLGY M142XP"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM129XP"
  },
  {
    "course_code": "PUB AFF M130",
    "units": 5,
    "title": "Biomedical, Social, and Policy Frontiers in Human Aging",
    "description": "(Same as Gerontology M108 and Social Welfare M108.) Lecture, four hours. Limited to juniors/seniors. Course of human aging charted in ways that are based on variety of recent research frontiers. Use of conceptual frameworks to increase relevance of aging to students’ lives and enhance their critical thinking—biopsychosocial approach that is based on recognition that aging is inherently interdisciplinary phenomenon, and life course perspective that is distinguished by analytical framework it provides for understanding interplay between human lives and changing social structures, and allows students to understand how events, successes, and losses at one stage of life can have important effects later in life. Focus on individuals as they age within one particular sociohistorical context. Letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)"
    ],
    "cross_listed": [
      "GRNTLGY M108",
      "SOC WLF M108"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM130"
  },
  {
    "course_code": "PUB AFF M131",
    "units": 4,
    "title": "Diversity in Aging: Roles of Gender and Ethnicity",
    "description": "(Same as Chicana/o and Central American Studies M106B, Gender Studies M104C, Gerontology M104C, and Social Welfare M104C.) Lecture, four hours. Exploration of complexity of variables related to diversity of aging population and variability in aging process. Examination of gender and ethnicity within context of both physical and social aging, in multidisciplinary perspective utilizing faculty from variety of fields to address issues of diversity. Letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "SOC WLF M104C",
      "GENDER M104C",
      "CCAS M106B",
      "GRNTLGY M104C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM131"
  },
  {
    "course_code": "PUB AFF 134",
    "units": 4,
    "title": "Politics of U.S. Health Policy",
    "description": "Lecture, three hours. Students gain firm understanding of process of health policy making in U.S. primarily through lens of debate over national health care reform culminating in passage of Patient Protection and Affordable Care Act (ACA) of 2010 and efforts of opponents to repeal or overturn it. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF134"
  },
  {
    "course_code": "PUB AFF 135",
    "units": 4,
    "title": "Firearm Violence Prevention Policy",
    "description": "Lecture, three hours. Examination of range of topics connected to contemporary debates about firearm violence in U.S. Exploration of causes and consequences of firearm violence in different contexts. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF135"
  },
  {
    "course_code": "PUB AFF 136",
    "units": 4,
    "title": "Cannabis Policy and Society",
    "description": "Lecture, three hours. Designed to enable students to formulate responsible opinions on cannabis legalization, industry, regulation, and taxation; to defend them with good analysis; and to understand logic behind opinions that may differ from their own. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF136"
  },
  {
    "course_code": "PUB AFF 137",
    "units": 4,
    "title": "Gangs, Criminal Justice, and Mass Incarceration",
    "description": "Lecture, three hours. Exploration of criminal justice policies that surround gangs, sentencing, prisons, incarceration, and rehabilitation. Students develop understanding of how to communicate knowledge and research regarding criminal justice system, gangs, and mass incarceration. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF137"
  },
  {
    "course_code": "PUB AFF 140",
    "units": 4,
    "title": "Race, Rights, and Citizenship: Encounters with Bureaucracies",
    "description": "Lecture, three hours. Examination of role of bureaucracies in emergence of, persistence of, and experience of social inequality. Exploration of dilemmas that bureaucrats face as they do their jobs, and experiences of residents who interact with bureaucrats. Consideration of how peoples’ experience of bureaucracies are associated with socioeconomic standing, and reflection on how experiences with bureaucracies convey messages about race, citizenship, and belonging. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF140"
  },
  {
    "course_code": "PUB AFF M142",
    "units": 4,
    "title": "Latino Social Policy",
    "description": "(Same as Chicana/o and Central American Studies CM177.) Lecture, three hours; discussion, one hour (when scheduled). Examination of social welfare of Latinos (Chicanos, Puerto Ricans, and Cubans) in U.S. through assessment and critical analysis of social policy issues affecting them. Survey of social, economic, cultural, and political circumstances affecting ability of Latinos to access public benefits and human services. Letter grading.",
    "cross_listed": [
      "CCAS CM177"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM142"
  },
  {
    "course_code": "PUB AFF 145",
    "units": 4,
    "title": "California Policy Issues",
    "description": "Lecture, three hours. Application of policy analysis to California issues. Guest lectures from practitioners and academics along with readings and videos. Written reports and oral presentations required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF145"
  },
  {
    "course_code": "PUB AFF 148",
    "units": 4,
    "title": "U.S. Housing Policy and Geography of Opportunity",
    "description": "Lecture, three hours. Exploration of contemporary levels of racial inequality through lens of U.S. housing policy. Study includes historical overview of federal policies; evaluation of ways by which living in racially segregated, high-poverty neighborhoods constrain opportunity and social mobility; exploration of most prevalent affordable housing policies; and evaluation of their respective program designs and outcomes. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF148"
  },
  {
    "course_code": "PUB AFF 149",
    "units": 4,
    "title": "International Housing Policy",
    "description": "Lecture, three hours; discussion, one hour. Study of housing policies in diverse range of countries, contrasting those with U.S. housing policy. Examination of policies in different contexts to better understand how institutional, economic, legal, and cultural contexts shape housing policies and housing outcomes. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF149"
  },
  {
    "course_code": "PUB AFF M153",
    "units": 4,
    "title": "Parking and City",
    "description": "(Same as Urban Planning CM151.) Lecture, three hours. Requisite: course 40 or Economics 1 or 11. Parking is misunderstood link between transportation and land use. Transportation engineers typically assume that free parking simply is there at end of most trips, while urban planners treat parking as transportation issue that engineers must study. No profession is intellectually responsible for parking, and everyone seems to assume that someone else is doing hard thinking. Mistakes in planning for parking help to explain why planning for transportation and land use has in many ways gone slowly, subtly, incrementally wrong. Study of theory and practice of planning for parking and examination of how planning for parking in U.S. has become planning for free parking. Exploration of new ways to improve planning for parking, transportation, and land use. Letter grading.",
    "prerequisites": [
      "PUB AFF 40",
      "ECON 1",
      "ECON 11"
    ],
    "cross_listed": [
      "URBN PL CM151"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM153"
  },
  {
    "course_code": "PUB AFF 154",
    "units": 4,
    "title": "Green Transportation",
    "description": "Lecture, three hours. Introduction to transportation planning and policy from environmental perspective. How to encourage alternatives to private car and reduce air pollution and greenhouse gas emissions. Planning for autonomous vehicles, bicycle, parking, pedestrian, and transit. Environmental justice in transportation. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF154"
  },
  {
    "course_code": "PUB AFF M157",
    "units": 4,
    "title": "Built Environment and Health",
    "description": "(Same as Urban Planning CM157.) Lecture, three hours. Exploration of important linkages between urban-built environment and public-health outcomes using ecological, urban planning, and community-based lenses through theory and series of case studies. Knowledge of these linkages is used to propose ecological solutions to issues at nexus of built environment and public health. Letter grading.",
    "cross_listed": [
      "URBN PL CM157"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM157"
  },
  {
    "course_code": "PUB AFF 158XP",
    "units": 4,
    "title": "Trees in City",
    "description": "Lecture, three hours. Introduction of foundational urban ecological concepts using case of urban trees. Includes wide range of disciplines as well as practitioner and community organizing perspectives to understand social and ecological implications of urban vegetation. Students partner with environmental non-profit located in Los Angeles. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF158XP"
  },
  {
    "course_code": "PUB AFF M159",
    "units": 4,
    "title": "Politics of Water",
    "description": "(Same as Urban Planning M168.) Lecture, three hours; discussion, one hour. Access to safe and sustainable water provision is major challenge for governments. Examination of political, economic, and social dimensions of water provision in Asia, Africa, Latin America, and U.S. Key issues include water and state building, market reforms and globalization, social mobilization, and citizen demand making strategies, role of crisis in citizen claims making. Letter grading.",
    "cross_listed": [
      "URBN PL M168"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM159"
  },
  {
    "course_code": "PUB AFF M160",
    "units": 4,
    "title": "Urban Sustainability",
    "description": "(Same as Urban Planning M161.) Lecture, three hours. In 21st century, majority of Earth’s population now lives in urban areas and virtually no part of globe remains untouched by human influence. Cities constitute crucibles of most pressing social and environmental challenges but are also potential centers of innovation for addressing those challenges. Examination of theory and practice from geography and related fields to understand many articulations of urban sustainability and how it might be achieved. Letter grading.",
    "cross_listed": [
      "URBN PL M161"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM160"
  },
  {
    "course_code": "PUB AFF M161",
    "units": 4,
    "title": "Environmental Justice through Multiple Lenses",
    "description": "(Same as Environment M167 and Urban Planning M167.) Lecture, three hours. Examination of intersection between race, economic class, and environment in U.S., with focus on issues related to social justice. Because environmental inequality is highly complex phenomenon, multidisciplinary and multipopulation approach taken, using alternative ways of understanding, interpreting, and taking action. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "ENVIRON M167",
      "URBN PL M167"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM161"
  },
  {
    "course_code": "PUB AFF 162",
    "units": 4,
    "title": "U.S. Environmental Politics",
    "description": "Lecture, three hours. Examination of political forces that contribute to environmental policy outcomes in U.S. Exploration of how political identity, distributive conflict, economic mobilization, representation gaps, and inequality in exposure to environmental risks and benefits shape individual attitudes and collective decision making about environmental issues, including climate change. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF162"
  },
  {
    "course_code": "PUB AFF M164",
    "units": 4,
    "title": "Science, Technology, and Public Policy",
    "description": "(Same as Electrical and Computer Engineering CM182 and Public Policy CM182.) Lecture, three hours. Recent and continuing advances in science and technology are raising profoundly important public policy issues. Consideration of selection of critical policy issues, each of which has substantial ethical, social, economic, political, scientific, and technological aspects. Letter grading.",
    "cross_listed": [
      "PUB PLC CM182",
      "EC ENGR CM182"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM164"
  },
  {
    "course_code": "PUB AFF M165",
    "units": 4,
    "title": "Advanced Technology: Public Policy, Regulation, and Law",
    "description": "(Same as Public Policy CM175.) Lecture, three hours. Examination of cutting-edge public policy and regulatory issues implicated by advanced technologies such as artificial intelligence, drones, autonomous vehicles, blockchain/Bitcoin, etc. Exploration of whether and how such new technologies should be regulated. Exploration of how policymakers should balance need to promote investment and innovation against need to protect public against potential misuse and abuse of these new technologies. Exploration of many issues raised by these technologies such as privacy, national security, network neutrality, intellectual property rights, and more. Letter grading.",
    "cross_listed": [
      "PUB PLC CM175"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM165"
  },
  {
    "course_code": "PUB AFF 170",
    "units": 4,
    "title": "Civil Society, Nonprofit Organizations, and Philanthropy: Comparative Perspectives",
    "description": "Seminar, three hours. Increased importance of nonprofits, rise of philanthropy, and (re-)discovery of civil society have moved this set of institutions closer to center of policy agendas. Introduction of conceptual and historical background. Examination of organizational performance and impact. Exploration of key policy issues. Comparative perspective between U.S. and other countries and fields. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF170"
  },
  {
    "course_code": "PUB AFF 172",
    "units": 4,
    "title": "Development and Its Governance",
    "description": "Lecture, three hours. Exploration of how economics, institutions, and politics interact to constrain and shape development strategies—emphasizing tension between normative visions of good economic policy and good governance and practical challenge of identifying practical ways of fostering change in specific settings. Focus on challenges of development in low- and middle-income settings, with exploration of governance challenges within U.S. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF172"
  },
  {
    "course_code": "PUB AFF 174",
    "units": 4,
    "title": "Cultural Policy and Cultural Diplomacy: Soft Power, Creative Economy, Innovation, and Arts",
    "description": "Lecture, three hours. Culture is one of most complex concepts in social sciences. Review of cultural policies at international, national, and local levels. Exploration of culture as system of meaning and identity, as well as culture as art and creative expression. Examination of use of culture in international relations and cultural diplomacy. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF174"
  },
  {
    "course_code": "PUB AFF 175",
    "units": 4,
    "title": "Communications and Conflict in Public Affairs",
    "description": "Lecture, four hours. Interactive course that prepares students for successful work with collaborators, policymakers, and public. Students gain interpersonal skills, cultural competency; learn effective communication, conflict resolution, and negotiate their interests successfully; learn to engage constituencies and build community around shared goals. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF175"
  },
  {
    "course_code": "PUB AFF M176XP",
    "units": 5,
    "title": "Making Films about Food",
    "description": "(Formerly numbered M176SL.) (Same as Community Engagement and Social Change M176XP and Food Studies M176XP.) Lecture, three hours. Introduction to documentary video production and distribution. Students work on assignments in pairs and small groups to create 8- to 10-minute video about one of several Los Angeles partner organizations that advocate for healthy, local, sustainable food. Consideration, through video production, of challenges posed by existing farming, ranching, and distribution methods, and strategies these groups are pursuing to create more sustainable food pathways. Students look at social media communication strategies to help think through intervention in face of historically entrenched industrial food production and regulations that remain favorable to mass-produced, processed food items. P/NP or letter grading.",
    "cross_listed": [
      "CESC M176XP",
      "FOOD ST M176XP"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM176XP"
  },
  {
    "course_code": "PUB AFF M179A",
    "units": 4,
    "title": "Social Movements in Theory and Practice",
    "description": "(Same as Public Policy M179.) Lecture, three hours. Social movement is group of people pressuring for political or social change over long periods of time. Study focuses on how mass movements form, when and where they are likely to form, what types of tactics they choose, how those tactics affect their success, and role new technologies play. Weekly focus on one specific topic, such as nonviolence or social media, with historic and more recent movements used as case studies. Letter grading.",
    "cross_listed": [
      "PUB PLC CM179"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM179A"
  },
  {
    "course_code": "PUB AFF 180",
    "units": 4,
    "title": "Lawyers, Law, and Public Affairs",
    "description": "Lecture, three hours. Interplay between public affairs, public policy, and law represents one of most significant and fundamental aspects of American democracy. Students gain tools necessary for understanding how law shapes public policy, and how public policy shapes law. Covers key skills for understanding legal reasoning and shows how those skills operate in various substantive legal policy areas. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF180"
  },
  {
    "course_code": "PUB AFF 187AX",
    "units": 5,
    "title": "Experiential Learning Capstone",
    "description": "(Formerly numbered 187A.) Lecture, two hours; discussion, one hour. Course 187AX is requisite to 187BX, which is requisite to 187CX. Limited to and required for senior Public Affairs majors. Students apply public affairs course concepts and methods to internship experience; refine understanding of concepts and methods based on internship experience; gain new knowledge about specific topics related to their internship; and develop new skills needed to complete capstone project. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF187AX"
  },
  {
    "course_code": "PUB AFF 187BX",
    "units": 5,
    "title": "Experiential Learning Capstone",
    "description": "(Formerly numbered 187B.) Lecture, two hours; discussion, one hour. Requisite: course 187AX. Limited to and required for senior Public Affairs majors. Students apply public affairs course concepts and methods to internship experience; refine understanding of concepts and methods based on internship experience; gain new knowledge about specific topics related to their internship; and develop new skills needed to complete capstone project. Letter grading.",
    "prerequisites": [
      "PUB AFF 187AX"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF187BX"
  },
  {
    "course_code": "PUB AFF 187CX",
    "units": 5,
    "title": "Experiential Learning Capstone",
    "description": "(Formerly numbered 187C.) Lecture, two hours; discussion, one hour. Requisite: course 187BX. Limited to and required for senior Public Affairs majors. Students apply public affairs course concepts and methods to internship experience; refine understanding of concepts and methods based on internship experience; gain new knowledge about specific topics related to their internship; and develop new skills needed to complete capstone project. Letter grading.",
    "prerequisites": [
      "PUB AFF 187BX"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF187CX"
  },
  {
    "course_code": "PUB AFF 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF188SA"
  },
  {
    "course_code": "PUB AFF 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "PUB AFF 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF188SB"
  },
  {
    "course_code": "PUB AFF 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "PUB AFF 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF188SC"
  },
  {
    "course_code": "PUB AFF 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF189"
  },
  {
    "course_code": "PUB AFF 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF189HC"
  },
  {
    "course_code": "PUB AFF 191A",
    "units": 4,
    "title": "Variable Topics Seminar: Public Affairs",
    "description": "Seminar, three hours; outside study, nine hours. Emerging issues in public affairs. May be repeated for credit. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF191A"
  },
  {
    "course_code": "PUB AFF M191DC",
    "units": 8,
    "title": "CAPPP Washington, DC, Research Seminars",
    "description": "(Same as Communication M191DC, History M191DC, Political Science M191DC, and Sociology M191DC.) Seminar, three hours. Limited to CAPPP Program students. Seminars for undergraduate students in Center for American Politics and Public Policy’s program in Washington, DC. Focus on development and execution of original empirical research based on experiences from Washington, DC—based field placements. Study of variety of qualitative methods (observation, interviewing, etc.), with comparison to quantitative analysis. Examination of features of solid and significant research; intensive writing. Letter grading.",
    "cross_listed": [
      "POL SCI M191DC",
      "COMM M191DC",
      "HIST M191DC",
      "SOCIOL M191DC"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM191DC"
  },
  {
    "course_code": "PUB AFF M191P",
    "units": 4,
    "title": "Variable Topics Seminar: Public Policy",
    "description": "(Same as Public Policy CM191B.) Seminar, three hours; discussion, one hour (when scheduled); outside study, eight hours. Emerging issues in public policy. May be repeated for credit. P/NP or letter grading.",
    "cross_listed": [
      "PUB PLC CM191B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM191P"
  },
  {
    "course_code": "PUB AFF 195",
    "units": 2,
    "title": "Community or Corporate Internships in Public Affairs",
    "description": "Tutorial, to be arranged; fieldwork, six to 12 hours. Limited to juniors/seniors. Internship in supervised setting in corporate, governmental, or nonprofit/community organization setting related to Public Affairs. Students meet with instructor and provide periodic reports of their experience. Individual contract with supervising faculty member required. May be repeated for credit. May not be used toward Public Affairs major capstone requirement; consult with undergraduate adviser. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF195"
  },
  {
    "course_code": "PUB AFF 195CE",
    "units": 4,
    "title": "Community or Corporate Internships in Public Affairs",
    "description": "Tutorial, to be arranged; fieldwork, eight to 10 hours. Limited to juniors/seniors. Internship in corporate, governmental, or nonprofit settings coordinated through Center for Community Engagement. Students complete weekly written assignments, attend biweekly meetings with graduate student instructor, and write final research paper. May be repeated for credit with consent of Center for Community Engagement. No more than 8 units may be applied toward major; units applied must be taken for letter grade. May not be applied toward concentration or distribution requirements. Individual contract with supervising faculty member required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF195CE"
  },
  {
    "course_code": "PUB AFF M195DC",
    "units": 4,
    "title": "Quarter in Washington, DC, Internships",
    "description": "(Same as Community Engagement and Social Change M195DC, History M195DC, Political Science M195DC, and Sociology M195DC.) Tutorial, four hours. Limited to junior/senior Quarter in Washington program students. Internships in Washington, DC, through Center for American Politics and Public Policy. Students meet on regular basis with instructor and provide periodic reports of their experience. Individual contract with supervising faculty member required. P/NP grading.",
    "cross_listed": [
      "HIST M195DC",
      "CESC M195DC",
      "SOCIOL M195DC",
      "POL SCI M195DC"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFFM195DC"
  },
  {
    "course_code": "PUB AFF 196",
    "units": 2,
    "title": "Research Apprenticeship in Public Affairs",
    "description": "Tutorial, three hours per week per unit. Limited to juniors/seniors. Research apprenticeship for upper-division students under guidance of faculty mentor. May be repeated for credit. Individual contract required. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF196"
  },
  {
    "course_code": "PUB AFF 198A",
    "units": 4,
    "title": "Honors Research in Public Affairs",
    "description": "Tutorial, to be arranged. Limited to senior Public Affairs majors. Requisites: courses 115, 116. Course 198A is requisite to 198B, which is requisite to 198C. Development and completion of research project and thesis under direct supervision of faculty member. Individual contract required. Letter grading.",
    "prerequisites": [
      "PUB AFF 115",
      "PUB AFF 116"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF198A"
  },
  {
    "course_code": "PUB AFF 198B",
    "units": 4,
    "title": "Honors Research in Public Affairs",
    "description": "Tutorial, to be arranged. Limited to senior Public Affairs majors. Requisites: courses 115, 116, 198A. Development and completion of research project and thesis under direct supervision of faculty member. Individual contract required. Letter grading.",
    "prerequisites": [
      "PUB AFF 115",
      "PUB AFF 116",
      "PUB AFF 198A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF198B"
  },
  {
    "course_code": "PUB AFF 198C",
    "units": 4,
    "title": "Honors Research in Public Affairs",
    "description": "Tutorial, to be arranged. Limited to senior Public Affairs majors. Requisites: courses 115, 116, 198B. Development and completion of research project and thesis under direct supervision of faculty member. Individual contract required. Letter grading.",
    "prerequisites": [
      "PUB AFF 115",
      "PUB AFF 116",
      "PUB AFF 198B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF198C"
  },
  {
    "course_code": "PUB AFF 199",
    "units": 2,
    "title": "Directed Research or Senior Project in Public Affairs",
    "description": "Tutorial, to be arranged. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for maximum of 16 units. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/PUBAFF199"
  }
]