[
  {
    "course_code": "RELIGN M4",
    "units": 5,
    "title": "Introduction to History of Religions",
    "description": "(Same as History M4.) Lecture, three hours; discussion, two hours. Comparative study of eight major religious traditions, with emphasis on their beginnings and subsequent decisive changes in their respective historical developments and interactions. Equips students with intellectual tools necessary for thinking analytically, empathetically, and comparatively about fascinating human phenomena identified as religious, such as sacred acts, places, words, and persons in their varied historical contexts. Development of student skills in critical thinking, analyzing documents, and making persuasive arguments based on historical evidence. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Historical Analysis (Society & Culture)"
    ],
    "cross_listed": [
      "HIST M4"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM4"
  },
  {
    "course_code": "RELIGN M10",
    "units": 5,
    "title": "Introduction to Judaism",
    "description": "(Same as Jewish Studies M10.) Lecture, three hours; discussion, one hour. Judaism’s basic beliefs, institutions, and practices. Topics include development of biblical and rabbinic Judaism; concepts of god, sin, repentance, prayer, and the messiah; history of Talmud and synagogue; evolution of folk beliefs and year-cycle and life-cycle practices. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "cross_listed": [
      "JEWISH M10"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM10"
  },
  {
    "course_code": "RELIGN 11",
    "units": 5,
    "title": "Religion in Los Angeles",
    "description": "Lecture, four hours. Introduction to varieties of religious experience in Los Angeles and its environs. Presentations, required readings, and (where possible) site visits to examine selected faiths and spiritual practices throughout Southern California and provide deeper understanding of myriad ways that sacred is made manifest and encountered. Foundational academic orientations within study of religion (anthropological, historical, psychological, sociological, etc.) used as framework to examine and interpret almost unparalleled religious diversity of City of Angels. Recognizing that spiritual traditions are crucial reflection of region’s ever-changing demographics, emphasis on role of ethnicity, gender, nationality, and race in shaping of religious landscape. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN11"
  },
  {
    "course_code": "RELIGN 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN19"
  },
  {
    "course_code": "RELIGN M20",
    "units": 5,
    "title": "Introduction to Islam",
    "description": "(Same as Islamic Studies M20.) Lecture, three hours; discussion, one hour. Genesis of Islam, its doctrines, and practices, with readings from Qur’an and Hadith; schools of law and theology; piety and Sufism; reform and modernism. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Philosophical & Linguistic Analysis (Arts & Humanities)"
    ],
    "cross_listed": [
      "ISLM ST M20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM20"
  },
  {
    "course_code": "RELIGN M40",
    "units": 5,
    "title": "Christianities East and West",
    "description": "(Same as Slavic M40.) Lecture, three hours; discussion, one hour. Survey of three major historical branches of Christianity—Eastern and Oriental Orthodoxy, Roman Catholicism, and Protestantism, contrasting how history, dogma, culture, and community structures develop in those three traditions. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "cross_listed": [
      "SLAVC M40"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM40"
  },
  {
    "course_code": "RELIGN M50",
    "units": 5,
    "title": "Origins of Judaism, Christianity, and Islam",
    "description": "(Same as Ancient Near East M50B and Middle Eastern Studies M50B.) Lecture, three hours; discussion, one hour. Examination of three major monotheisms of Western cultures—Judaism, Christianity, and Islam—historically and comparatively. Development, teachings, and ritual practices of each tradition up to and including medieval period. Composition and development of various sacred texts, highlighting key themes and ideas within different historical and literary strata of traditions, such as mechanisms of revelation, struggle for religious authority, and common theological issues such as origin of evil and status of nonbelievers. Letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "Diversity - Arts and Architecture",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "cross_listed": [
      "M E STD M50B",
      "AN N EA M50B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM50"
  },
  {
    "course_code": "RELIGN 55",
    "units": 5,
    "title": "Spirit of Medicine",
    "description": "Lecture, three hours; discussion, one hour. Examination of relationship between medicine, religion, and society; how religion is help or hindrance to health; and what health care might look like beyond biomedical clinic. Examination of historical entwinement of religion, medicine, and society in Western antiquity to early modern period; disentanglement in Enlightenment to early 20th century; and confluence of science, technology, and capitalism in biomedicine compartmentalized from religion today. Conceptualization of rhetorics and epistemplogies of healing—what it means to be healed and how one would know—and put in tension with faith healings and religion-as-medicine, medicine-as-religion, and integrated approaches. Analysis of alternatives to biomedical status quo in theoretical medicine and in health care delivery, with particular attention to questions of justice and holistic care in U.S. and of policy and practice globally. P/NP or letter grading.",
    "satisfies": [
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN55"
  },
  {
    "course_code": "RELIGN M60A",
    "units": 5,
    "title": "Introduction to Buddhism",
    "description": "(Same as Asian M60.) Lecture, three hours; discussion, one hour. Not open for credit to students with credit for course M60W. Knowledge of Asian languages not required. General survey of development of Buddhism in India, with focus on those religious doctrines and meditative practices most essential to various Asian traditions of Buddhism. Letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "equivalent_courses": [
      "RELIGN M60W",
      "ASIAN M60W"
    ],
    "cross_listed": [
      "ASIAN M60"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM60A"
  },
  {
    "course_code": "RELIGN M60B",
    "units": 5,
    "title": "Introduction to Chinese Religions",
    "description": "(Same as Chinese M60.) Lecture, three hours; discussion, one hour. Not open for credit to students with credit for course M61W. Knowledge of Chinese not required. General survey of religious life in China, with emphasis on everyday religious practice over doctrine, and themes common to Buddhism, Daoism, and Confucianism. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Philosophical & Linguistic Analysis (Arts & Humanities)"
    ],
    "equivalent_courses": [
      "CHIN M60W",
      "RELIGN M61W"
    ],
    "cross_listed": [
      "CHIN M60"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM60B"
  },
  {
    "course_code": "RELIGN M60C",
    "units": 5,
    "title": "Introduction to Korean Religions",
    "description": "(Same as Korean M60.) Lecture, three hours; discussion, one hour. Knowledge of Asian languages not required. General survey of history of religions in Korea—Shamanism, Buddhism, Confucianism, Daoism, Christianity, Tonghak, and some new religions—with focus on religious doctrines, practices, Korean characteristics, and social impacts. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Philosophical & Linguistic Analysis (Arts & Humanities)"
    ],
    "cross_listed": [
      "KOREA M60"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM60C"
  },
  {
    "course_code": "RELIGN M60D",
    "units": 5,
    "title": "Religion in Classical India: Introduction",
    "description": "(Same as South Asian M60.) Lecture, three hours; discussion, one hour. Introduction to religions of classical India—Vedic, Brahmanical, Hindu, Jain, and Buddhist—paying equal attention to change and continuity, with emphasis on chronological development. P/NP or letter grading.",
    "satisfies": [
      "General Education - Philosophical & Linguistic Analysis (Arts & Humanities)",
      "Diversity - Arts and Architecture",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "cross_listed": [
      "S ASIAN M60"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM60D"
  },
  {
    "course_code": "RELIGN M60E",
    "units": 4,
    "title": "Religious Traditions in Southeast Asia",
    "description": "(Same as Southeast Asian M60.) Lecture, three hours. Introduction to historical development and contemporary practice of religions in Southeast Asia. Examination of indigenous religious beliefs and major textually based religions introduced to region, including Hinduism, Buddhism, Islam, and Christianity. P/NP or letter grading.",
    "cross_listed": [
      "SEASIAN M60"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM60E"
  },
  {
    "course_code": "RELIGN M60W",
    "units": 5,
    "title": "Introduction to Buddhism",
    "description": "(Same as Asian M60W.) Lecture, three hours; discussion, one hour. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course M60A. Knowledge of Asian languages not required. General survey of Buddhist worldview and lifestyle, with focus on those religious doctrines and meditative practices most essential to various Asian traditions of Buddhism. Particular attention to problems involved in study of religion. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3",
      "ENGCOMP 3H",
      "ESL 36"
    ],
    "equivalent_courses": [
      "RELIGN M60A",
      "ASIAN M60"
    ],
    "cross_listed": [
      "ASIAN M60W"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM60W"
  },
  {
    "course_code": "RELIGN M61",
    "units": 5,
    "title": "Introduction to Zen Buddhism",
    "description": "(Same as Asian M61.) Lecture, three hours; discussion, one hour. Knowledge of Asian languages not required. Introduction to Zen traditions and to interplay between Zen and other fundamental cultural and religious concerns in East Asia. Topics include role of Zen within Buddhist thought and practice, artistic and literary arts, society, and daily life. Letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "Diversity - Arts and Architecture"
    ],
    "cross_listed": [
      "ASIAN M61"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM61"
  },
  {
    "course_code": "RELIGN M61W",
    "units": 5,
    "title": "Introduction to Chinese Religions",
    "description": "(Same as Chinese M60W.) Lecture, three hours; discussion, one hour. Enforced requisite: English Composition 3 or 3H or English as a Second Language 36. Not open for credit to students with credit for course M60B. Knowledge of Chinese not required. General survey of religious life in China, with emphasis on everyday religious practice over doctrine, and themes common to Buddhism, Daoism, and Confucianism. Satisfies Writing II requirement. Letter grading.",
    "satisfies": [
      "Writing II"
    ],
    "prerequisites": [
      "ENGCOMP 3",
      "ENGCOMP 3H",
      "ESL 36"
    ],
    "equivalent_courses": [
      "RELIGN M60B",
      "CHIN M60"
    ],
    "cross_listed": [
      "CHIN M60W"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM61W"
  },
  {
    "course_code": "RELIGN M70",
    "units": 5,
    "title": "Demons, Fear, and Uncanny in Ancient World",
    "description": "(Same as Ancient Near East M70.) Lecture, three hours; discussion, one hour. Consideration of place of demons and fear in several different societies and cultures in ancient world: Mesopotamia; ancient Egypt, Greece, and Rome; and Biblical and early Jewish contexts. Investigation into why demons and monsters existed in these cultures; how they were opposed or protected again; and what these different societies feared, and how that fear was represented. As demons and monsters are reflections of particular culturally specific fears and norms, studying them allows for examination of societies that constructed them. Examination of how fear of threats such as disease, illness, and death were constructed alongside fears of foreign and of women. Critical examination of wide range of primary source texts, addressing core question of how different societies construct unique fears—and how those fears shape those societies in turn. P/NP or letter grading.",
    "satisfies": [
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "cross_listed": [
      "AN N EA M70"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM70"
  },
  {
    "course_code": "RELIGN 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN89"
  },
  {
    "course_code": "RELIGN 89HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to lower-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN89HC"
  },
  {
    "course_code": "RELIGN 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN99"
  },
  {
    "course_code": "RELIGN 101",
    "units": 4,
    "title": "History of Study of Religion",
    "description": "Lecture, four hours. Recommended requisite: History 4. Survey of major modern theories, methods, and approaches to study of religion to situate them within their own historical, philosophical, and social contexts. Critical consideration of changing and contested meanings of term religion and its relationship to such categories as science and magic, as well as to other domains of social experience. Examination of how study of religion has interacted with other academic fields, especially biblical studies, anthropology, sociology, psychology, and evolutionary biology. P/NP or letter grading.",
    "prerequisites": [
      "HIST 4"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN101"
  },
  {
    "course_code": "RELIGN M105A",
    "units": 4,
    "title": "Bahá'í Faith in Iran: Historical and Sociological Survey",
    "description": "(Same as Iranian M105A.) Lecture, three hours. Readings in English. Rise and development of Bábí and Bahá’í religions in context of 19th century Iran. Focus on personalities of Báb, Bahá’u’lláh, and ‘Abdu’l-Bahá. May be taken independently for credit. P/NP or letter grading.",
    "cross_listed": [
      "IRANIAN M105A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM105A"
  },
  {
    "course_code": "RELIGN M105B",
    "units": 4,
    "title": "Bahá'í Faith in Iran: Survey of Bahá'í Scriptures and Thought",
    "description": "(Same as Iranian M105B.) Lecture, three hours. Readings in English. Analysis of major writings by Báb, Bahá’u’lláh, and ‘Abdu’l-Bahá. Emphasis on mystical and social principles. May be taken independently for credit. P/NP or letter grading.",
    "cross_listed": [
      "IRANIAN M105B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM105B"
  },
  {
    "course_code": "RELIGN M105C",
    "units": 4,
    "title": "Bahá'í Faith in Iran: 20th-Century Iran and the Bahá'ís",
    "description": "(Same as Iranian M105C.) Lecture, three hours. Readings in English. Focus on history of 20th-century Iran beginning with constitutional revolution, development and persecution of Bahá’í community, and latter’s relation to reform movements in Iran. May be taken independently for credit. P/NP or letter grading.",
    "cross_listed": [
      "IRANIAN M105C",
      "IRANIAN 20"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM105C"
  },
  {
    "course_code": "RELIGN M106A",
    "units": 4,
    "title": "Premodern Islam",
    "description": "(Same as History M106.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of early development of Islam with special attention to doctrine of nature of God, human responsibility, guidance, revelation and religious authority, duties of believers, ritual, law, sectarian movements, mysticism, and popular religion. P/NP or letter grading.",
    "cross_listed": [
      "HIST M106"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM106A"
  },
  {
    "course_code": "RELIGN M107",
    "units": 5,
    "title": "Islam in West",
    "description": "(Same as Arabic M107 and Islamic Studies CM107.) Lecture, three hours; discussion, one hour. Acquisition of understanding of basic doctrines and practices of Islam. Survey of history of Islam in West, with focus on U.S. and France. Analysis of issues relevant to growth and development of selected Muslim communities in West. Exposure to diverse expressions of Islam through independent research on Muslim communities and institutions in U.S. Development of strong analytical writing and speaking skills. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Historical Analysis (Society & Culture)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "cross_listed": [
      "ARABIC M107",
      "ISLM ST CM107"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM107"
  },
  {
    "course_code": "RELIGN M108",
    "units": 4,
    "title": "Qur'an",
    "description": "(Same as Arabic CM106.) Lecture, three hours. Introduction to Qur’an, its early history, and form and function as scripture in Muslim history, civilization, and culture. Focus also on Qur’anic interpretation, its relationship to Islamic law, and Qur’an in contemporary discourses such as human rights, feminism, and contemporary reform movements. Primary sources include excerpts from Qur’an, Qur’anic interpretation, and selected writings of Muslim thinkers and reformists. Strong focus on analytical and writing skills through in-class assignments and discussion. Letter grading.",
    "cross_listed": [
      "ARABIC CM106"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM108"
  },
  {
    "course_code": "RELIGN 110",
    "units": 4,
    "title": "Religion and Violence",
    "description": "Seminar, three hours; discussion, one hour. Exploration of capacity of religion to mobilize and legitimate violence. Materials include theoretical texts by Rene Girard, Walter Burkert, Jonathan Z. Smith, and David Rapoport and case studies dealing with religion and violence in India, Northern Ireland, Egypt, Lebanon, Israel, Palestine, Sri Lanka, and the U.S. Letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN110"
  },
  {
    "course_code": "RELIGN 113",
    "units": 5,
    "title": "In Search of Meaning: From Holy Texts to Hollywood",
    "description": "Lecture, two and one half hours. Exploration of topics such as existence of a higher being, meaning of life, one’s role in world, one’s obligations to others, human nature, and existence of evil. Examination of texts ranging from scriptures to film that reflect religious, philosophical, and secular ways people—over centuries and throughout world—have sought answers to basic questions of human existence. Today, in time of global disruption, people still search for meaning and purpose on path is rarely straight forward or upward, and often requires movement backward or downward. Introduction to how various thinkers and cultures have approached life’s big questions, including religious and philosophical responses to them. Students are encouraged to think critically about them and formulate their own responses. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Arts and Architecture",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Philosophical & Linguistic Analysis (Arts & Humanities)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN113"
  },
  {
    "course_code": "RELIGN M115",
    "units": 5,
    "title": "Islam and Other Religions",
    "description": "(Same as Islamic Studies CM115.) Lecture, three hours; discussion, one hour. Students gain familiarity with historical cases and modes of interaction between Muslims and non-Muslims in plural societies. Consideration of axis questions such as how does Qur’an reflect religious plurality; how does it situate Islam vis-à-vis its alternatives; what encounters did rapid expansion of Islam bring about in diverse societies; how did Islam and other religions change through debate, war, and exchange of ideas; what roles has political power played in conditioning interreligious interaction; how have conversion and hybridity affected what it means to be Muslim; what is different about interreligious interactions in secular states and societies; and how is past invoked to justify opinions and policies today. Investigation of these questions by conducting microstudies: close readings of sources through theoretical lens. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)",
      "General Education - Social Analysis (Society & Culture)"
    ],
    "cross_listed": [
      "ISLM ST CM115"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM115"
  },
  {
    "course_code": "RELIGN M118B",
    "units": 4,
    "title": "Kierkegaard and Philosophy of Religion",
    "description": "(Same as Philosophy M118B.) Lecture, three to four hours; discussion, one hour (when scheduled). Preparation: one philosophy course. Study of selected works of Kierkegaard on philosophy of religion, with emphasis on interpretation of texts. P/NP or letter grading.",
    "cross_listed": [
      "PHILOS M118B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM118B"
  },
  {
    "course_code": "RELIGN 120",
    "units": 4,
    "title": "Judaism, Christianity, and Islam: Comparative Approach",
    "description": "Seminar, three hours. Introduction to analysis of complex relationship of Judaism, Christianity, and Islam as living traditions whose historical origins, current interactions, and future development continue to shape spiritual, cultural, political, and social aspects of human civilization in 21st century. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN120"
  },
  {
    "course_code": "RELIGN M132",
    "units": 5,
    "title": "Ancient Egyptian Religion",
    "description": "(Same as Ancient Near East M130.) Lecture, three hours; discussion, one hour. Introduction to religious beliefs, practices, and sentiments of ancient Egypt to study Egyptian religion as coherent system of thought and sphere of action that once served as meaningful and relevant framework for understanding physical reality and human life for inhabitants of Nile Valley. General principles as well as developments through time (circa 3000 BC to 300 CE). Topics include mythology, temple and cult, magic, and personal piety. P/NP or letter grading.",
    "satisfies": [
      "General Education - Philosophical & Linguistic Analysis (Arts & Humanities)",
      "General Education - Literacy & Cultural Analysis (Arts & Humanities)"
    ],
    "cross_listed": [
      "AN N EA M130"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM132"
  },
  {
    "course_code": "RELIGN M133",
    "units": 4,
    "title": "Bible and Qur'an",
    "description": "(Same as Middle Eastern Studies M133.) Lecture, three hours. Survey of Hebrew Bible/Old Testament, New Testament, and Qur’an to familiarize students with content of scriptures of Judaism, Christianity, and Islam, and sociocultural background from which these multifarious texts emerged, and to explore major themes and consider variety of approaches to scripture. Development of appreciation for role scripture plays in these religious systems and in American culture and society. P/NP or letter grading.",
    "cross_listed": [
      "M E STD M133"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM133"
  },
  {
    "course_code": "RELIGN M135",
    "units": 4,
    "title": "Religion in Ancient Israel",
    "description": "(Same as Ancient Near East M135.) Lecture, three hours. Introductory survey of various ancient Israelite religious beliefs and practices, their origin, and development, with special attention to diversity of religious practice in ancient Israel and Canaan during 1st millennium BCE. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M135"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM135"
  },
  {
    "course_code": "RELIGN 140",
    "units": 4,
    "title": "Undergraduate Seminar: Study of Religion",
    "description": "Seminar, three hours. Interdisciplinary approach to some major topics in study of religion, such as religion and politics, mysticism, ideas of revelation, myth and religion, worship and ritual. May be repeated for credit with consent of instructor. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN140"
  },
  {
    "course_code": "RELIGN M142C",
    "units": 4,
    "title": "History of Religion in U.S.",
    "description": "(Same as History M142C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Consideration of religious dimension of people’s experience in U.S. Examination of number of religious traditions that have been important in this country, with emphasis on relating developments in religion to other aspects of American culture. P/NP or letter grading.",
    "satisfies": [
      "American History and Institutions",
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "HIST M142C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM142C"
  },
  {
    "course_code": "RELIGN 150",
    "units": 4,
    "title": "Women, Gender, and Religion",
    "description": "Lecture, four hours. Investigation and consideration of roles, status, and representations of women and gender in one or more religious traditions. Examination of how cultural conceptions of gender as well as social realities (as far as they can be known) for women and men in particular historical periods shape and are shaped by these religious traditions, including discussions regarding ritual practices, spirituality, sexuality, sexual renunciation, religious authority, marriage and family life, fertility, conceptions of body, public life, and/or literary representations of gender (including those of divine). Variety of approaches to be employed, including feminist, literary, historical, sociological, and anthropological. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN150"
  },
  {
    "course_code": "RELIGN M155",
    "units": 4,
    "title": "Angels, Demons, and End of World: Magic, Mysticism, and Apocalypse in Jewish Traditions",
    "description": "(Same as Jewish Studies M155.) Lecture, three hours. Focus on popular Jewish traditions of magic, mysticism, apocalypse, and various contours of Judaism’s textual and material traditions in antiquity. Examination of texts and objects from Hebrew Bible to modern discussions of Kabbalah and end of world, concentrating on Jewish antiquity. Discussion of texts, including Hebrew Bible, Dead Sea Scrolls, extra-biblical Jewish texts, New Testament, and rabbinic and later Jewish literature. Discussion of sociohistorical context in order to decipher features and functions of magic, mysticism, and apocalypse in antiquity and modernity. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M155"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM155"
  },
  {
    "course_code": "RELIGN 156",
    "units": 4,
    "title": "Religion and Liberation",
    "description": "Lecture, two hours; discussion, 30 minutes. Study traces ways religion and liberation have been understood to connect in the later 20th-century phenomenon called liberation theology. Started by James Cone’s embrace of Christian Black Power movement in the U.S. and Gustavo Gutiérrez’s Latin American theology against poverty, this method of religious interpretation spread across world and sacred traditions. Reading of central texts that sparked the movement, and sampling of various ways movement was picked up and adapted by people of other identities: queer, South African, Islamic, Palestinian, etc. Highlights key issues of the relationship between religion and liberation, political-religious theory, utopia, oppression, justice, and hope. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN156"
  },
  {
    "course_code": "RELIGN 160",
    "units": 4,
    "title": "Religion, Film, and Media",
    "description": "Lecture, four hours. Examination of complex relationship between religious traditions and various media (e.g., print, film, photography, television, radio, and electronic) as they have intersected in specific historical and cultural contexts. Illumination of role of media in forming and expressing religious ideas, practices, and identities. Topics may include representations of religious groups, visual and aural piety, identity formation, interreligious conflict, religious education, and use of media technologies for propaganda or proselytizing purposes. Historical, sociological, and anthropological approaches used in concert with various methodologies current within media studies. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN160"
  },
  {
    "course_code": "RELIGN M161A",
    "units": 4,
    "title": "Chinese Buddhism",
    "description": "(Same as Chinese CM160.) Lecture, three hours; discussion, one hour. Knowledge of Chinese not required. Introduction and development of Buddhism in China, interaction between Buddhism and Chinese culture, rise of Chinese schools of Buddhism. Letter grading.",
    "cross_listed": [
      "CHIN CM160"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM161A"
  },
  {
    "course_code": "RELIGN M161B",
    "units": 4,
    "title": "Japanese Buddhism",
    "description": "(Same as Japanese CM160.) Lecture, three hours; discussion, one hour. Knowledge of Japanese not required. Development of Buddhism in Japan in its cultural context, with emphasis on key ideas and teachings. Letter grading.",
    "cross_listed": [
      "JAPAN CM160"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM161B"
  },
  {
    "course_code": "RELIGN M161C",
    "units": 4,
    "title": "Korean Buddhism",
    "description": "(Same as Korean CM160.) Lecture, three hours; discussion, one hour. Knowledge of Korean not required. Introduction and development of Buddhism in Korea, interactions between indigenous Korean culture and Sinitic traditions of Buddhism, Korean syntheses of imported Buddhist theological systems and meditative techniques, and independent Son (Zen) schools of Korea. Letter grading.",
    "cross_listed": [
      "KOREA CM160"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM161C"
  },
  {
    "course_code": "RELIGN M161D",
    "units": 4,
    "title": "Buddhism in India",
    "description": "(Same as South Asian CM160.) Lecture, three hours; discussion, one hour. Knowledge of Indian languages not required. Overview of social and doctrinal history of Buddhism from its origin to its disappearance in India, based not only on texts but on archaeological, art historical, and inscriptional sources. Examination of both formal doctrine and actual practices and on what learned Buddhists wrote and ordinary Buddhists did, saw, and made. Letter grading.",
    "cross_listed": [
      "S ASIAN CM160"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM161D"
  },
  {
    "course_code": "RELIGN M172",
    "units": 4,
    "title": "Bible and Its Interpreters",
    "description": "(Same as Ancient Near East M170.) Lecture, three hours. Knowledge of original languages not required. Bible (Old and New Testaments) as book. Canon, text, and versions. Linguistic, literary, historical, and religious approaches to Bible study. Survey of history of interpretation from antiquity to present. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M170"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM172"
  },
  {
    "course_code": "RELIGN M173C",
    "units": 4,
    "title": "Shinto, Buddhism, and Japanese Folk Religion",
    "description": "(Same as History M173C.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Social dimension of various Ways, great and little: Shinto’s connection with cultural nationalism, Buddhism’s medieval Reformation and Zen’s relation to warrior culture, folk religious aspects such as shamanism, ancestor worship, and millenarianism. P/NP or letter grading.",
    "cross_listed": [
      "HIST M173C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM173C"
  },
  {
    "course_code": "RELIGN M174D",
    "units": 4,
    "title": "Indo-Islamic Interactions, 700 to 1750",
    "description": "(Same as History M174D.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Historical introduction to Muslim communities of what eventually became nations of India, Pakistan, and Bangladesh. Topics include social, political, religious, and cultural history. P/NP or letter grading.",
    "cross_listed": [
      "HIST M174D",
      "Islamic Interactions, 700",
      "Islamic Interactions, 1750"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM174D"
  },
  {
    "course_code": "RELIGN M174E",
    "units": 4,
    "title": "Indo-Islamic Interactions, 1750 to 1950",
    "description": "(Same as History M174E.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Examination of interplay of factors that, from Christian missionaries to Islamic madrasa schools and colonial rebellions, gave shape to multifaceted Muslim reformation in context of colonial modernity. P/NP or letter grading.",
    "cross_listed": [
      "HIST M174E",
      "Islamic Interactions, 1750",
      "Islamic Interactions, 1950"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM174E"
  },
  {
    "course_code": "RELIGN M175",
    "units": 4,
    "title": "Topics in Philosophy of Religion",
    "description": "(Same as Philosophy M175.) Lecture, three hours; discussion, one hour. Requisite: Philosophy 21 or 22. Intensive investigation of one or two topics or works in philosophy of religion, such as attributes of God, arguments for or against existence of God, or relation between religion and ethics. Topics announced each term. May be repeated for credit with consent of instructor.",
    "prerequisites": [
      "PHILOS 21",
      "PHILOS 22"
    ],
    "cross_listed": [
      "PHILOS M175"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM175"
  },
  {
    "course_code": "RELIGN 177",
    "units": 4,
    "title": "Variable Topics in Religion",
    "description": "Seminar, three hours. Interdisciplinary approach to some major topics in study of religion, such as religion and science, religion and society, politics, mysticism, ideas of revelation, scripture, myth and religion, worship and ritual. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN177"
  },
  {
    "course_code": "RELIGN M178",
    "units": 4,
    "title": "Variable Topics",
    "description": "(Same as Middle Eastern Studies M178.) Seminar, three hours. Interdisciplinary approach to some major topics in study of religion and Middle Eastern studies. May be repeated for credit with topic change. P/NP or letter grading.",
    "cross_listed": [
      "M E STD M178"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM178"
  },
  {
    "course_code": "RELIGN M179",
    "units": 4,
    "title": "Topics in Moral Philosophy: Evil",
    "description": "(Same as Philosophy M152B.) Lecture, three to four hours; discussion, one hour (when scheduled). Preparation: one philosophy course. Exploration of philosophical issues raised by topic of evil actions and/or evil people. Issues may include nature of evil, problem of evil and theodicies, responsibility for evil and problem of free will, causes and motivations for evil action, and variant responses to evil such as forgiveness and punishment. P/NP or letter grading.",
    "cross_listed": [
      "PHILOS M152B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM179"
  },
  {
    "course_code": "RELIGN 180",
    "units": 4,
    "title": "Religion and Modern Critical Thought",
    "description": "Lecture, four hours. Examination of how various traditions of modern critical thought inform academic study of religion, with primary focus on philosophical analysis of religious belief and practice and its relation to other areas of theoretical discussion, such as philosophy of language, discourse analysis, epistemology, metaphysics, ethics, practice theory, and political theory. Topics may include nature of religious experience and its epistemic status, embodiment and religious self, relationship between knowledge, faith, and doubt, nature and function of religious language, relationship between science and religion, religious belief and standards of rational discourse, theoretical approaches to problems of religious diversity and competing truth claims, formation of religious and secular in modernity. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN180"
  },
  {
    "course_code": "RELIGN M182A",
    "units": 4,
    "title": "Ancient Jewish History",
    "description": "(Same as History M182A and Jewish Studies M182A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Survey of social, political, and religious developments. P/NP or letter grading.",
    "cross_listed": [
      "HIST M182A",
      "JEWISH M182A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM182A"
  },
  {
    "course_code": "RELIGN M182B",
    "units": 4,
    "title": "Medieval Jewish History",
    "description": "(Same as History M182B and Jewish Studies M182B.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exploration of unfolding of Jewish history from rise of Christianity to expulsion of Jews from Spain in 1492. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M182B",
      "HIST M182B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM182B"
  },
  {
    "course_code": "RELIGN M184A",
    "units": 4,
    "title": "Jewish Civilization: Encounter with Great World Cultures",
    "description": "(Same as History M184A and Jewish Studies M184A.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Exploration of dynamic and millennia-old interaction of Jews with great world cultures. Creative adaptations that have lent Jewish culture its distinct and various forms. P/NP or letter grading.",
    "cross_listed": [
      "JEWISH M184A",
      "HIST M184A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM184A"
  },
  {
    "course_code": "RELIGN M185D",
    "units": 4,
    "title": "Religions of Ancient Near East",
    "description": "(Same as Ancient Near East M185D and History M185D.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Main polytheistic systems of ancient Near East, with emphasis on Mesopotamia and Syria and with reference to religion of ancient Israel: varying concepts of divinity, hierarchies of gods, prayer and cult, magics, wisdom, and moral conduct. P/NP or letter grading.",
    "cross_listed": [
      "AN N EA M185D",
      "HIST M185D"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM185D"
  },
  {
    "course_code": "RELIGN M186A",
    "units": 4,
    "title": "History of Early Christians",
    "description": "(Same as History M185F.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Christian movement from its origins to circa 160 CE, stressing its continuity/discontinuity with Judaism, various responses to Jesus of Nazareth, writings produced during this period, movement’s encounters with its religious, social, and political world, and methods of research. P/NP or letter grading.",
    "cross_listed": [
      "HIST M185F"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM186A"
  },
  {
    "course_code": "RELIGN M186B",
    "units": 4,
    "title": "Religious Environment of Early Christians",
    "description": "(Same as History M185G.) Lecture, three hours; discussion, one hour (when scheduled). Designed for juniors/seniors. Rich variety in religious practice and thought in Mediterranean world of 1st century CE as in context of developing Christian movement. Topics include Pharisees, Qumran, Philo, Stoics, Epicureans, traditional Greek and Roman religions, mysteries, astrology, magic, gnosticism, and emperor-worship. P/NP or letter grading.",
    "cross_listed": [
      "HIST M185G"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM186B"
  },
  {
    "course_code": "RELIGN M186C",
    "units": 4,
    "title": "Jesus of Nazareth in Historical Research",
    "description": "(Same as History M185I.) Lecture, three hours; discussion, one hour (when scheduled). Recommended preparation: course M185F. Designed for juniors/seniors. Stimulated by significant post-Enlightenment historical evaluations, students are led into firsthand knowledge (in translation) of various multilayered sources for reconstruction of life, teaching, and initial impact of Jesus of Nazareth in his social, economic, political, and religious contexts. P/NP or letter grading.",
    "cross_listed": [
      "HIST M185I"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGNM186C"
  },
  {
    "course_code": "RELIGN 187XP",
    "units": 4,
    "title": "Religion, Society, and Civic Engagement",
    "description": "(Formerly numbered 187SL.) Seminar, three hours; fieldwork, two hours. Examination of variable topics related to religion and civic engagement, with particular emphasis on justice and coexistence in pluralistic societies. How are we to best enact—or manage—clashing visions of what Los Angeles is and ought to be; theoretical and practical ways citizens work out tensions in what city of angels means. Key themes may include cities and utopia, secularity and secularism, political economy, trust, solidarity, access, equality, liberty, philanthropy, and eschatology. May be repeated for credit with topic or instructor change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN187XP"
  },
  {
    "course_code": "RELIGN 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN189"
  },
  {
    "course_code": "RELIGN 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors Program. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN189HC"
  },
  {
    "course_code": "RELIGN 191",
    "units": 4,
    "title": "Variable Topics Research Seminars: Study of Religion",
    "description": "Seminar, four hours. Preparation: completion of preparation for major courses and at least half of upper-division courses required for major (including theory and method courses). Designed for senior majors. Seminar on central method and/or theme in study of religion. Refinement and integration of this knowledge by means of close reading and analysis of primary documents, debating contested issues, and researching and writing original paper. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN191"
  },
  {
    "course_code": "RELIGN 198",
    "units": 4,
    "title": "Honors Research in Religion",
    "description": "Tutorial, three hours. Limited to juniors/seniors. Development and completion of 40-page honors thesis under direct supervision of faculty member. Must be taken twice to receive departmental honors program credit. Individual contract required. May be repeated for maximum of 12 units. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN198"
  },
  {
    "course_code": "RELIGN 199",
    "units": 2,
    "title": "Directed Research in Study of Religion",
    "description": "Tutorial, one hour. Limited to juniors/seniors. Supervised individual research under guidance of faculty mentor. Culminating paper or project required. Twelve units may be applied toward major. Individual contract required. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/RELIGN199"
  }
]