[
  {
    "course_code": "UNIV ST 1",
    "units": 1,
    "title": "Ace the UCLA College-to-Career Transition",
    "description": "Seminar, one hour (six weeks). Limited to continuing students. Students are introduced to the value of a research institution, its transferable skills, and how they can most effectively maximize time at UCLA to prepare for the college-to-career transition. Offers opportunities for students to reflect upon what they have accomplished both inside and outside of the classroom and how they may market the skills and strengths they have cultivated. Features modules highlighting transferable skills acquired through coursework and co-curricular high impact practices; how to foster meaningful relationships with diverse communities of scholars; the demonstration of awareness of career readiness competencies; how to assess one’s values, skills, interests, and strengths; and how to navigate the college-to-career transition. Offered in summer only. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/UNIVST1"
  },
  {
    "course_code": "UNIV ST 10A",
    "units": 2,
    "title": "ACE UCLA | Critical Strategies to Achieve Undergraduate Excellence (First- and Second-Year Students)",
    "description": "Seminar, two hours. Not open for credit to students with credit for course 10B, 10C, 10D, 10E, 10F, or former course 10. Imparts students with critical strategies to achieve undergraduate excellence at top-tier research institution. Study of research university’s mission, rigors, and expectations of students, as well as its pedagogical implications. Cultivation of formal space on campus where UCLA students learn to engage collaboratively with their diverse community of scholars; to comprehend and apply effective learning strategies and theoretical foundations of college student development; to navigate complex structure of UCLA; to practice resilience and growth mindset; to think critically about diversity and their identity; and to be fully aware of their value to intellectual fabric of institution as contributors to innovative research and scholarship. P/NP grading.",
    "credit_exclusions": [
      "UNIV ST 10D",
      "UNIV ST 10E",
      "UNIV ST 10F",
      "UNIV ST 10B",
      "UNIV ST 10C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/UNIVST10A"
  },
  {
    "course_code": "UNIV ST 10B",
    "units": 2,
    "title": "ACE UCLA | Critical Strategies to Achieve Undergraduate Excellence for International Students",
    "description": "Seminar, two hours. Not open to students who have completed University Studies 10A, 10C, 10D, or former course 10. Designed to assist first-year international students in making successful transition to UCLA and to U.S. by focusing on academic, social, and emotional aspects of transition. Study of research university’s history, mission, rigors, expectations of students, and pedagogical implications. Cultivation of formal space on campus where UCLA students learn to engage both diplomatically and collaboratively with diverse community of scholars; to comprehend and apply theoretical foundations of college student development; to navigate complex structure of UCLA; and to be fully aware of their value to intellectual fabric of institution as contributors to innovative research and scholarship. P/NP grading.",
    "credit_exclusions": [
      "UNIV ST 10A",
      "UNIV ST 10D",
      "UNIV ST 10E",
      "UNIV ST 10F",
      "UNIV ST 10C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/UNIVST10B"
  },
  {
    "course_code": "UNIV ST 10C",
    "units": 2,
    "title": "ACE UCLA | Critical Strategies to Achieve Undergraduate Excellence for Life Sciences Students",
    "description": "Seminar, two hours. Not open for credit to students with credit for course 10A, 10B, 10D, 10E, 10F, or former course 10. Imparts students interested in or pursuing majors in life sciences with critical strategies to achieve undergraduate excellence at top-tier research institution. Study of research university’s mission, rigors, and expectations of students, as well as its pedagogical implications. Cultivation of formal space on campus where UCLA students learn to engage collaboratively with their diverse community of scholars; to comprehend and apply effective learning strategies and theoretical foundations of college student development; to navigate complex structure of UCLA; to practice resilience and growth mindset; to think critically about diversity and their identity; and to be fully aware of their value to intellectual fabric of institution as contributors to innovative research and scholarship. P/NP grading.",
    "credit_exclusions": [
      "UNIV ST 10A",
      "UNIV ST 10D",
      "UNIV ST 10E",
      "UNIV ST 10F",
      "UNIV ST 10B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/UNIVST10C"
  },
  {
    "course_code": "UNIV ST 10D",
    "units": 2,
    "title": "ACE UCLA | Critical Strategies to Achieve Undergraduate Excellence (Transfers)",
    "description": "Seminar, two hours. Not open for credit to students with credit for course 10A, 10B, 10C, 10E, 10F, or former course 10. Designed for transfer students. Imparts students with critical strategies to achieve undergraduate excellence at top-tier research institution. Study of research university’s mission, rigors, and expectations of students, as well as its pedagogical implications. Cultivation of formal space on campus where UCLA students learn to engage collaboratively with their diverse community of scholars; to comprehend and apply effective learning strategies and theoretical foundations of college student development; to navigate complex structure of UCLA; to practice resilience and growth mindset; to think critically about diversity and their identity; and to be fully aware of their value to intellectual fabric of institution as contributors to innovative research and scholarship. P/NP grading.",
    "credit_exclusions": [
      "UNIV ST 10A",
      "UNIV ST 10E",
      "UNIV ST 10F",
      "UNIV ST 10B",
      "UNIV ST 10C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/UNIVST10D"
  },
  {
    "course_code": "UNIV ST 10E",
    "units": 2,
    "title": "ACE UCLA | Critical Strategies to Achieve Undergraduate Excellence for First-Generation Students",
    "description": "Seminar, two hours. Not open for credit to students with credit for course 10A, 10B, 10C, 10D, 10F, or former course 10. Designed for first-generation college students. Imparts students with critical strategies to achieve undergraduate excellence at top-tier research institution. Study of research university’s mission, rigors, and expectations of students, as well as its pedagogical implications. Cultivation of formal space on campus where UCLA students learn to engage collaboratively with their diverse community of scholars; to comprehend and apply effective learning strategies and theoretical foundations of college student development; to navigate complex structure of UCLA; to practice resilience and growth mindset; to think critically about diversity and their identity; and to be fully aware of their value to intellectual fabric of institution as contributors to innovative research and scholarship. P/NP grading.",
    "credit_exclusions": [
      "UNIV ST 10A",
      "UNIV ST 10D",
      "UNIV ST 10F",
      "UNIV ST 10B",
      "UNIV ST 10C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/UNIVST10E"
  },
  {
    "course_code": "UNIV ST 10F",
    "units": 2,
    "title": "ACE UCLA | Critical Strategies to Achieve Undergraduate Excellence for Humanities Students",
    "description": "Seminar, two hours. Not open for credit to students with credit for course 10A, 10B, 10C, 10D, 10E, or former course 10. Imparts students interested in or pursuing majors in humanities with critical strategies to achieve undergraduate excellence at top-tier research institution. Study of research university’s mission, rigors, and expectations of students, as well as its pedagogical implications. Cultivation of formal space on campus where UCLA students learn to engage collaboratively with their diverse community of scholars; to comprehend and apply effective learning strategies and theoretical foundations of college student development; to navigate complex structure of UCLA; to practice resilience and growth mindset; to think critically about diversity and their identity; and to be fully aware of their value to intellectual fabric of institution as contributors to innovative research and scholarship. P/NP grading.",
    "credit_exclusions": [
      "UNIV ST 10A",
      "UNIV ST 10D",
      "UNIV ST 10E",
      "UNIV ST 10B",
      "UNIV ST 10C"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/UNIVST10F"
  },
  {
    "course_code": "UNIV ST 15A",
    "units": 2,
    "title": "Collaborative Learning Workshops for Humanities and Social Sciences Majors",
    "description": "Seminar, two hours. Designed for students in First Year Scholars Program (FYSP). Part I of three-part series of collaborative learning and community-building work sessions. Collaborative work spaces and participatory learning environments are integral component of student development. Creates specific and unique space for FYSP scholars to cultivate community and support, as well as develop critical strategies to achieve undergraduate excellence at top-tier institution. Engages students collaboratively with diverse community of scholars; supports their understanding and application of effective learning strategies; guides students in practice growth mindset, navigation of complex structure of UCLA, thinking critically about diversity and their identity, and being fully aware of their value to intellectual fabric of institution as contributors to innovative research scholarship. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/UNIVST15A"
  },
  {
    "course_code": "UNIV ST 15B",
    "units": 2,
    "title": "Collaborative Learning Workshops for Humanities and Social Sciences Majors",
    "description": "Seminar, two hours. Requisite: course 15A. Designed for students in First Year Scholars Program. Workshops are integral component of student learning and development. Continues to cultivate learning communities. Workshops prepare students for second year, as they become more intentionally engaged in academic community, at UCLA and beyond. Workshops foster academic, professional, and personal development of students majoring in humanities and social sciences. Instructors, peer mentors, and campus partners facilitate interactive workshops that help students transition to, engage with, and navigate UCLA as they culminate their first year at university. P/NP grading.",
    "prerequisites": [
      "UNIV ST 15A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/UNIVST15B"
  },
  {
    "course_code": "UNIV ST 15C",
    "units": 2,
    "title": "Collaborative Learning Workshops for Humanities and Social Sciences Majors",
    "description": "Seminar, two hours. Requisite: course 15B. Designed for students in First Year Scholars Program (FYSP). Part III of three-part series of collaborative learning and community-building work sessions. Students work together on ongoing research proposal and project presented at culmination of program. Collaborative work spaces and participatory learning environments are integral component of student development. Creates specific and unique space for FYSP scholars to cultivate community and support, as well as develop critical strategies to achieve undergraduate excellence at top-tier institution. Engages students collaboratively with diverse community of scholars; supports their understanding and application of effective learning strategies; guides students in practice growth mindset, navigation of complex structure of UCLA, thinking critically about diversity and their identity, and being fully aware of their value to intellectual fabric of institution as contributors to innovative research scholarship. P/NP grading.",
    "prerequisites": [
      "UNIV ST 15B"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/UNIVST15C"
  },
  {
    "course_code": "UNIV ST 30",
    "units": 2,
    "title": "How to Succeed at UCLA: Retention",
    "description": "Seminar, two hours. Limited to students in Bruin Readmission Program. Designed to provide students who are working toward readmission critical understanding of how they and others arrive at their dismissal status and steps they can take that lead to academic success in future. Examination of research on retention and departure in high education and both individual and collective strategies for academic success. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/UNIVST30"
  }
]