[
  {
    "course_code": "URBN PL 214",
    "units": 4,
    "title": "Neighborhood Analysis",
    "description": "Lecture, two hours; laboratory, two hours. Experience with GIS and statistical software useful but not necessary. Methods-oriented studio course, with focus on developing data and analytical skills required to profile and analyze neighborhoods. Working in teams students develop quantitative neighborhood profiles that can used in community planning and at other geographical levels (e.g., cities, counties, and regions). Students gain professional experience and produce product that benefits larger community. Data management and analysis, including accessing, cleaning, and presenting data. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL214"
  },
  {
    "course_code": "URBN PL 19",
    "units": 1,
    "title": "Fiat Lux Freshman Seminars",
    "description": "Seminar, one hour. Discussion of and critical thinking about topics of current intellectual importance, taught by faculty members in their areas of expertise and illuminating many paths of discovery at UCLA. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL19"
  },
  {
    "course_code": "URBN PL 89",
    "units": 1,
    "title": "Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to lower-division lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL89"
  },
  {
    "course_code": "URBN PL 99",
    "units": 1,
    "title": "Student Research Program",
    "description": "Tutorial (supervised research or other scholarly work), three hours per week per unit. Entry-level research for lower-division students under guidance of faculty mentor. Students must be in good academic standing and enrolled in minimum of 12 units (excluding this course). Individual contract required; consult Undergraduate Research Center. May be repeated. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL99"
  },
  {
    "course_code": "URBN PL M110",
    "units": 4,
    "title": "Inequality and Democracy: Analysis and Praxis of Public Problems",
    "description": "(Same as Social Welfare M110.) Lecture, three hours; discussion, one hour. Analysis and praxis of public problems. Taking up case of persistent inequality in liberal democracies, coverage of key frameworks and methodologies for understanding and analyzing poverty and inequality and examination of forms of action, from role of government to social movements, that seek to intervene in such problems. Study of problems, programs, policies, and politics in globally interconnected, transnational world, while avoiding analytical divide between global north and global south. Letter grading.",
    "cross_listed": [
      "SOC WLF M110"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM110"
  },
  {
    "course_code": "URBN PL M120",
    "units": 4,
    "title": "Introduction to Cities and Planning",
    "description": "(Same as Public Affairs M109.) Lecture, three hours; discussion, one hour. Survey of urban history and evolution in U.S., urban social theory, current growth trends, system of cities, urban economy and economic restructuring, traditional and alternative location theories, urban transportation, and residential location and segregation. Letter grading.",
    "cross_listed": [
      "PUB AFF M109"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM120"
  },
  {
    "course_code": "URBN PL 121",
    "units": 4,
    "title": "Urban Policy and Planning",
    "description": "Lecture, three hours. Examination of current urban planning and policy issues and debates, such as normative theories of good urban form, metropolitan organization and governance, economic development and growth management, edge cities, spatial mismatch hypothesis, urban poverty, racial/ethnic inequality, gender and urban structure, sustainability, and future of cities. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL121"
  },
  {
    "course_code": "URBN PL M122",
    "units": 4,
    "title": "Policy, Planning, and Community",
    "description": "(Same as Asian American Studies M108.) Lecture, three hours; field laboratory. Project-oriented methods course on conducting needs assessment in Asian American communities. Geographic information systems to be used to define problems and needs. Letter grading.",
    "cross_listed": [
      "ASIA AM M108"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM122"
  },
  {
    "course_code": "URBN PL 129",
    "units": 4,
    "title": "Special Topics in Urban Policy and Research",
    "description": "Lecture, three hours. Examination of particular planning/policy subfield (e.g., economic development, environmental planning, housing and community development, international planning and development, land use, or urban design) in some depth. Specific topic area rotates depending on instructor. May be repeated for credit with topic change. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL129"
  },
  {
    "course_code": "URBN PL 130",
    "units": 4,
    "title": "Fundamentals of Urban and Regional Economics",
    "description": "Lecture, three hours. Preparation: one introduction to microeconomics course. Most U.S. population lives and works in urbanized areas, and world’s population is becoming more urbanized with each passing decade. National, state, and local governments are engaged in managing, planning, policymaking, and governance in urban context. Ultimate efficacy of those public activities can be enhanced by understanding of economic forces acting on urban areas. Basic concepts related to location choice, agglomeration effects, economies of scale, and specialization by cities and transportation. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL130"
  },
  {
    "course_code": "URBN PL CM137",
    "units": 4,
    "title": "Southern California Regional Economy",
    "description": "(Same as Labor Studies M180.) Lecture, three hours. Introduction to regional economy, with emphasis on Los Angeles. Key economic sectors, labor market composition, and review of conflicting portrayals depicting dynamics of region. Two all-day bus tours of key economic regions and guest lectures by regional experts included. Concurrently scheduled with course C237C. Letter grading.",
    "cross_listed": [
      "LBR STD M180"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLCM137"
  },
  {
    "course_code": "URBN PL M140",
    "units": 4,
    "title": "Issues in Latina/Latino Poverty: Mexican and Central American Voices from Los Angeles",
    "description": "(Same as Chicana/o and Central American Studies M121 and Labor Studies M121.) Lecture, four hours. Examination of key issues (work, housing, and neighborhoods) in urban poverty, with particular focus on Mexican and Central American immigrant populations in Los Angeles. Exploration of major theoretical models that explain urban poverty and application of them in comparative context while exploring differences between Mexican and Central American immigrants. Social conditions and forces that help us understand lives of poor people in comparative context while looking at differences between two major Latino-origin populations in Los Angeles. Critical analysis of new forms of urban poverty in contemporary American society. Letter grading.",
    "cross_listed": [
      "LBR STD M121",
      "CCAS M121"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM140"
  },
  {
    "course_code": "URBN PL 141",
    "units": 4,
    "title": "Planning with Minority Communities",
    "description": "Lecture, three hours. Overview of planning history, theory, and contemporary issues that affect low-income communities, communities of color, and underserved neighborhoods, particularly in Los Angeles area. Field of planning offers distinct perspectives and opportunities for improving vulnerable communities. Topics range from discussion of intersection between race and income, critical race theory, community development, residential segregation, spatial mismatch, and environmental justice to social justice. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL141"
  },
  {
    "course_code": "URBN PL M150",
    "units": 4,
    "title": "Transportation Geography",
    "description": "(Same as Geography M153.) Lecture, three hours. Designed for juniors/seniors. Study of geographical aspects of transportation, with focus on characteristics and functions of various modes and on complexities of intra-urban transport. P/NP or letter grading.",
    "cross_listed": [
      "GEOG M153"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM150"
  },
  {
    "course_code": "URBN PL CM151",
    "units": 4,
    "title": "Parking and City",
    "description": "(Same as Public Affairs M153.) Lecture, three hours. Requisite: Economics 1 or 11 or Public Affairs 40. Parking is misunderstood link between transportation and land use. Transportation engineers typically assume that free parking simply is there at end of most trips, while urban planners treat parking as transportation issue that engineers must study. No profession is intellectually responsible for parking, and everyone seems to assume that someone else is doing hard thinking. Mistakes in planning for parking help to explain why planning for transportation and land use has in many ways gone slowly, subtly, incrementally wrong. Study of theory and practice of planning for parking and examination of how planning for parking in U.S. has become planning for free parking. Exploration of new ways to improve planning for parking, transportation, and land use. Concurrently scheduled with C251. Letter grading.",
    "prerequisites": [
      "ECON 1",
      "ECON 11",
      "Public Affairs 40"
    ],
    "cross_listed": [
      "PUB AFF M153"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLCM151"
  },
  {
    "course_code": "URBN PL CM157",
    "units": 4,
    "title": "Built Environment and Health",
    "description": "(Same as Public Affairs M157.) Lecture, three hours. Exploration of important linkages between urban-built environment and public-health outcomes using ecological, urban planning, and community-based lenses through theory and series of case studies. Knowledge of these linkages is used to propose ecological solutions to issues at nexus of built environment and public health. May be concurrently scheduled with course C285. Letter grading.",
    "cross_listed": [
      "PUB AFF M157"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLCM157"
  },
  {
    "course_code": "URBN PL M160",
    "units": 4,
    "title": "Environmental Politics and Governance",
    "description": "(Same as Environment M164.) Lecture, three hours. Environmental planning is more than simply finding problems and fixing them. Each policy must be negotiated and implemented within multiple, complex systems of governance. Institutions and politics matter deeply. Overview of how environmental governance works in practice and how it might be improved. Letter grading.",
    "cross_listed": [
      "ENVIRON M164"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM160"
  },
  {
    "course_code": "URBN PL M161",
    "units": 4,
    "title": "Urban Sustainability",
    "description": "(Same as Public Affairs M160.) Lecture, three hours. In 21st century, majority of Earth’s population now lives in urban areas and virtually no part of globe remains untouched by human influence. Cities constitute crucibles of most pressing social and environmental challenges but are also potential centers of innovation for addressing those challenges. Examination of theory and practice from geography and related fields to understand many articulations of urban sustainability and how it might be achieved. Letter grading.",
    "cross_listed": [
      "PUB AFF M160"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM161"
  },
  {
    "course_code": "URBN PL M164A",
    "units": 5,
    "title": "Documentary Production for Social Change: Mobility in Los Angeles",
    "description": "(Same as Disability Studies M164A.) Seminar, three hours; fieldwork, two hours. Exploration of documentary filmmaking as catalyst for social change, using daily commute in Los Angeles as case study. Introduction to issues of race, ethnicity, gender, disability, and class on experiences of commuting, access to public transportation, and car-based versus alternative (bike and pedestrian) forms of commuting. Exposure to observational, interview-based, and participatory documentary shooting and editing techniques, as well as social marketing strategies that are vital to documentary production and distribution. Letter grading.",
    "cross_listed": [
      "DIS STD M164A"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM164A"
  },
  {
    "course_code": "URBN PL M165",
    "units": 4,
    "title": "Environmentalism: Past, Present, and Future",
    "description": "(Same as Environment M125 and Geography M125.) Lecture, three hours; discussion, one hour. Exploration of history and origin of major environmental ideas, movements or countermovements they spawned, and new and changing nature of modern environmentalism. Introduction to early ideas of environment, how rise of modern sciences reshaped environmental thought, and how this was later transformed by 19th-century ideas and rise of American conservation movements. Review of politics of American environmental thought and contemporary environmental questions as they relate to broader set of questions about nature of development, sustainability, and equity in environmental debate. Exploration of issues in broad context, including global climate change, rise of pandemics, deforestation, and environmental justice impacts of war. Letter grading.",
    "cross_listed": [
      "GEOG M125",
      "ENVIRON M125"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM165"
  },
  {
    "course_code": "URBN PL CM166",
    "units": 4,
    "title": "Global Environment and Development: Problems and Issues",
    "description": "(Same as Geography M127.) Lecture, three hours; discussion, one hour. Designed for juniors/seniors. Questions of population, resource use, Third World poverty, and environment. Analysis of global economic restructuring and its connections to changing organization of production and resulting environmental impacts. Case studies from Africa, Latin America, Asia, and U.S. Concurrently scheduled with course C266. P/NP or letter grading.",
    "cross_listed": [
      "GEOG M127"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLCM166"
  },
  {
    "course_code": "URBN PL M167",
    "units": 4,
    "title": "Environmental Justice through Multiple Lenses",
    "description": "(Same as Environment M167 and Public Affairs M161.) Lecture, three hours. Examination of intersection between race, economic class, and environment in U.S., with focus on issues related to social justice. Because environmental inequality is highly complex phenomenon, multidisciplinary and multipopulation approach taken, using alternative ways of understanding, interpreting, and taking action. P/NP or letter grading.",
    "satisfies": [
      "Diversity - Letters and Science, Education and Information Studies, Music, Public Affairs"
    ],
    "cross_listed": [
      "ENVIRON M167",
      "PUB AFF M161"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM167"
  },
  {
    "course_code": "URBN PL M168",
    "units": 4,
    "title": "Politics of Water",
    "description": "(Same as Public Affairs M159.) Lecture, three hours; discussion, one hour. Access to safe and sustainable water provision is major challenge for governments. Examination of political, economic, and social dimensions of water provision in Asia, Africa, Latin America, and U.S. Key issues include water and state building, market reforms and globalization, social mobilization, and citizen demand making strategies, role of crisis in citizen claims making. Letter grading.",
    "cross_listed": [
      "PUB AFF M159"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM168"
  },
  {
    "course_code": "URBN PL M171",
    "units": 4,
    "title": "Planning Issues in Latina/Latino Communities: Preserving and Strengthening Community Assets in Mexican and Salvadoran Los Angeles",
    "description": "(Same as Chicana/o and Central American Studies M122 and Labor Studies M122.) Lecture, four hours. How community and economic development interact, role of assets in community development, and unique synergies and pitfalls that enable or disable communities from developing to their potential. How to strengthen and how to preserve community resources in Pico-Union neighborhood in Los Angeles. Research entails historical analysis, reviews, interviews, electronic asset mapping, web-based data processing and analysis, oral and written reports, and cyber-based research. Letter grading.",
    "cross_listed": [
      "CCAS M122",
      "LBR STD M122"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM171"
  },
  {
    "course_code": "URBN PL CM172",
    "units": 4,
    "title": "Labor and Economic Development",
    "description": "(Same as Labor Studies M171.) Lecture, three hours. Exploration of economic development and identification of ways that labor and labor unions directly and indirectly influence and shape economic development. Wide range of roles that labor plays, and could play, in promoting and supporting economic development for all. Concurrently scheduled with course C271B. Letter grading.",
    "cross_listed": [
      "LBR STD M171"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLCM172"
  },
  {
    "course_code": "URBN PL M175",
    "units": 4,
    "title": "Women and Cities",
    "description": "(Same as Gender Studies M175.) Lecture, three hours. Limited to juniors/seniors. Examination of relationship between women and cities: (1) how cities have affected women’s opportunities for economic and social equality, (2) women’s contributions to development of U.S. cities, and (3) contemporary strategies and efforts to create urban environments that reflect women’s needs and interests. P/NP or letter grading.",
    "cross_listed": [
      "GENDER M175"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM175"
  },
  {
    "course_code": "URBN PL C184",
    "units": 4,
    "title": "Looking at Los Angeles",
    "description": "Lecture, three hours. Introduction to history and physical form of Los Angeles, with emphasis on understanding social, economic, and political issues in development of Los Angeles. Concurrently scheduled with course C284. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLC184"
  },
  {
    "course_code": "URBN PL 185XP",
    "units": 4,
    "title": "Community-Based Research in Planning",
    "description": "(Formerly numbered 185SL.) Seminar, one hour; fieldwork, three hours. Preparation: at least four Urban and Regional Studies minor courses, of which at least one should be related to subject area of service learning setting. Limited to junior/senior minor students. Designed to serve as complement to service learning requirement and may be used to fulfill capstone requirement for minor. Students are matched to public, private, or nonprofit agency through Center for Community Learning and must complete minimum of 30 hours of work. Duties and responsibilities to be set by students and sponsoring organizations. Readings to be determined in consultation with instructor. P/NP grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL185XP"
  },
  {
    "course_code": "URBN PL M187",
    "units": 4,
    "title": "Latino Metropolis: Architecture and Urbanism in Americas",
    "description": "(Same as Chicana/o and Central American Studies M187 and History M151E.) Lecture, four hours. Introduction to history of architecture and urbanism in Americas, from fabled cities of Aztec empire to barrios of 21st-century Los Angeles and Miami. Emphasis on role of cities in Latina/Latino experience and uses of architecture and city planning to forge new social identities rooted in historical experiences of conquest, immigration, nationalization, and revolution. P/NP or letter grading.",
    "cross_listed": [
      "HIST M151E",
      "CCAS M187"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPLM187"
  },
  {
    "course_code": "URBN PL 188SA",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to discuss selected USIE seminar topic, conduct preparatory research, and begin preparation of syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "HNRS 101E"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL188SA"
  },
  {
    "course_code": "URBN PL 188SB",
    "units": 1,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SA. Enforced corequisite: Honors Collegium 101E. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor to finalize course syllabus. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "URBN PL 188SA"
    ],
    "corequisites": [
      "HNRS 101E"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL188SB"
  },
  {
    "course_code": "URBN PL 188SC",
    "units": 2,
    "title": "Individual Studies for USIE Facilitators",
    "description": "Tutorial, to be arranged. Enforced requisite: course 188SB. Limited to junior/senior USIE facilitators. Individual study in regularly scheduled meetings with faculty mentor while facilitating USIE 88S course. Individual contract with faculty mentor required. May not be repeated. Letter grading.",
    "prerequisites": [
      "URBN PL 188SB"
    ],
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL188SC"
  },
  {
    "course_code": "URBN PL 189",
    "units": 1,
    "title": "Advanced Honors Seminars",
    "description": "Seminar, three hours. Limited to 20 students. Designed as adjunct to undergraduate lecture course. Exploration of topics in greater depth through supplemental readings, papers, or other activities and led by lecture course instructor. May be applied toward honors credit for eligible students. Honors content noted on transcript. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL189"
  },
  {
    "course_code": "URBN PL 189HC",
    "units": 1,
    "title": "Honors Contracts",
    "description": "Tutorial, three hours. Limited to students in College Honors and departmental honors programs. Designed as adjunct to upper-division lecture course. Individual study with lecture course instructor to explore topics in greater depth through supplemental readings, papers, or other activities. May be repeated for maximum of 4 units. Individual honors contract required. Honors content noted on transcript. Letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL189HC"
  },
  {
    "course_code": "URBN PL 195",
    "units": 4,
    "title": "Community Internships in Urban Planning",
    "description": "Tutorial, 12 hours. Limited to junior/senior Urban and Regional Studies minors. Internship in supervised setting in community agency or urban planning setting. Students meet on regular basis with instructor and provide periodic reports of their experience. May be repeated for credit. Individual contract with supervising faculty member required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL195"
  },
  {
    "course_code": "URBN PL 199",
    "units": 2,
    "title": "Directed Research in Urban Planning",
    "description": "Tutorial, three hours. Limited to juniors/seniors. Supervised individual research or investigation under guidance of faculty mentor. Culminating paper or project required. May be repeated for credit. Individual contract required. P/NP or letter grading.",
    "url": "https://catalog.registrar.ucla.edu/course/2024/URBNPL199"
  }
]